const CHAPTERS = [
{id:"ch1",category:"shu1",number:1,name:"基础30讲 - 高数 - 第1讲 函数极限与连续",short:"第1讲 函数极限与连续",total:54,cols:5,wb:"基础30讲",subj:"高数",relPath:"基础30讲/高数/第1讲 函数极限与连续",labels:["例1-1", "例1-2", "例1-3", "例1-4", "例1-5", "例1-6", "例1-7", "例1-8", "例1-9", "例1-10", "例1-11", "例1-12", "例1-13", "例1-14", "例1-15", "例1-16", "例1-17", "例1-18", "例1-19", "例1-20", "例1-21", "例1-22", "例1-23", "例1-24", "例1-25", "例1-26", "例1-27", "例1-28", "例1-29", "例1-30", "例1-31", "例1-32", "例1-33", "例1-34", "例1-35", "例1-36", "例1-37", "例1-38", "1-1", "1-2", "1-3", "1-4", "1-5", "1-6", "1-7", "1-8", "1-9", "1-10", "1-11", "1-12", "1-13", "1-14", "1-15", "1-16"]},
{id:"ch2",category:"shu1",number:2,name:"基础30讲 - 高数 - 第2讲 数列极限",short:"第2讲 数列极限",total:26,cols:5,wb:"基础30讲",subj:"高数",relPath:"基础30讲/高数/第2讲 数列极限",labels:["例2-1", "例2-2", "例2-3", "例2-4", "例2-5", "例2-6", "例2-7", "例2-8", "例2-9", "例2-10", "例2-11", "例2-12", "例2-13", "例2-14", "例2-15", "例2-16", "例2-17", "例2-18", "2-1", "2-2", "2-3", "2-4", "2-5", "2-6", "2-7", "2-8"]},
{id:"ch3",category:"shu1",number:3,name:"基础30讲 - 高数 - 第3讲 一元函数微分学的概念",short:"第3讲 一元函数微分学的概念",total:21,cols:5,wb:"基础30讲",subj:"高数",relPath:"基础30讲/高数/第3讲 一元函数微分学的概念",labels:["例3-1", "例3-2", "例3-3", "例3-4", "例3-5", "例3-6", "例3-7", "例3-8", "例3-9", "例3-10", "例3-11", "例3-12", "3-1", "3-2", "3-3", "3-4", "3-5", "3-6", "3-7", "3-8", "3-9"]},
{id:"ch4",category:"shu1",number:4,name:"基础30讲 - 高数 - 第4讲 一元函数微分学的计算",short:"第4讲 一元函数微分学的计算",total:27,cols:5,wb:"基础30讲",subj:"高数",relPath:"基础30讲/高数/第4讲 一元函数微分学的计算",labels:["例4-1", "例4-2", "例4-3", "例4-4", "例4-5", "例4-6", "例4-7", "例4-8", "例4-9", "例4-10", "例4-11", "例4-12", "例4-13", "例4-14", "例4-15", "例4-16", "例4-17", "例4-18", "例4-19", "4-1", "4-2", "4-3", "4-4", "4-5", "4-6", "4-7", "4-8"]},
{id:"ch5",category:"shu1",number:5,name:"基础30讲 - 高数 - 第5讲 一元函数微分学的应用（一）",short:"第5讲 一元函数微分学的应用（一）",total:24,cols:5,wb:"基础30讲",subj:"高数",relPath:"基础30讲/高数/第5讲 一元函数微分学的应用（一）",labels:["例5-1", "例5-2", "例5-3", "例5-4", "例5-5", "例5-6", "例5-7", "例5-8", "例5-9", "例5-10", "例5-11", "例5-12", "例5-13", "例5-14", "例5-15", "5-1", "5-2", "5-3", "5-4", "5-5", "5-6", "5-7", "5-8", "5-9"]},
{id:"ch6",category:"shu1",number:6,name:"基础30讲 - 高数 - 第6讲一元函数微分学的应用（二）",short:"第6讲一元函数微分学的应用（二）",total:31,cols:5,wb:"基础30讲",subj:"高数",relPath:"基础30讲/高数/第6讲一元函数微分学的应用（二）",labels:["例6-1", "例6-2", "例6-3", "例6-4", "例6-5", "例6-6", "例6-7", "例6-8", "例6-9", "例6-10", "例6-11", "例6-12", "例6-13", "例6-14", "例6-15", "例6-16", "例6-17", "例6-18", "例6-19", "例6-20", "例6-21", "6-1", "6-2", "6-3", "6-4", "6-5", "6-6", "6-7", "6-8", "6-9", "6-10"]},
{id:"ch7",category:"shu1",number:7,name:"基础30讲 - 高数 - 第7讲 一元函数微分学的应用（三）",short:"第7讲 一元函数微分学的应用（三）",total:9,cols:5,wb:"基础30讲",subj:"高数",relPath:"基础30讲/高数/第7讲 一元函数微分学的应用（三）",labels:["例7-1", "例7-2", "例7-3", "例7-4", "例7-5", "7-1", "7-2", "7-3", "7-4"]},
{id:"ch8",category:"shu1",number:8,name:"基础30讲 - 高数 - 第8讲 一元函数积分学的概念与性质",short:"第8讲 一元函数积分学的概念与性质",total:26,cols:5,wb:"基础30讲",subj:"高数",relPath:"基础30讲/高数/第8讲 一元函数积分学的概念与性质",labels:["例8-1", "例8-2", "例8-3", "例8-4", "例8-5", "例8-6", "例8-7", "例8-8", "例8-9", "例8-10", "例8-11", "例8-12", "例8-13", "例8-14", "例8-15", "例8-16", "例8-17", "例8-18", "例8-19", "8-1", "8-2", "8-3", "8-4", "8-5", "8-6", "8-7"]},
{id:"ch9",category:"shu1",number:9,name:"基础30讲 - 高数 - 第9讲 一元函数积分学的计算",short:"第9讲 一元函数积分学的计算",total:46,cols:5,wb:"基础30讲",subj:"高数",relPath:"基础30讲/高数/第9讲 一元函数积分学的计算",labels:["例9-1", "例9-2", "例9-3", "例9-4", "例9-5", "例9-6", "例9-7", "例9-8", "例9-9", "例9-10", "例9-11", "例9-12", "例9-13", "例9-14", "例9-15", "例9-16", "例9-17", "例9-18", "例9-19", "例9-20", "例9-21", "例9-22", "例9-23", "例9-24", "例9-25", "例9-26", "例9-27", "例9-28", "例9-29", "9-1", "9-2", "9-3", "9-4", "9-5", "9-6", "9-7", "9-8", "9-9", "9-10", "9-11", "9-12", "9-13", "9-14", "9-15", "9-16", "9-17"]},
{id:"ch10",category:"shu1",number:10,name:"基础30讲 - 高数 - 第10讲 一元函数积分学的应用（一）",short:"第10讲 一元函数积分学的应用（一）",total:23,cols:5,wb:"基础30讲",subj:"高数",relPath:"基础30讲/高数/第10讲 一元函数积分学的应用（一）",labels:["例10-1", "例10-2", "例10-3", "例10-4", "例10-5", "例10-6", "例10-7", "例10-8", "例10-9", "例10-10", "例10-11", "例10-12", "例10-13", "例10-14", "10-1", "10-2", "10-3", "10-4", "10-5", "10-6", "10-7", "10-8", "10-9"]},
{id:"ch11",category:"shu1",number:11,name:"基础30讲 - 高数 - 第11讲 一元函数积分学的应用（二）",short:"第11讲 一元函数积分学的应用（二）",total:17,cols:5,wb:"基础30讲",subj:"高数",relPath:"基础30讲/高数/第11讲 一元函数积分学的应用（二）",labels:["例11-1", "例11-2", "例11-3", "例11-4", "例11-5", "例11-6", "例11-7", "例11-8", "例11-9", "例11-10", "例11-11", "11-1", "11-2", "11-3", "11-4", "11-5", "11-6"]},
{id:"ch12",category:"shu1",number:12,name:"基础30讲 - 高数 - 第12讲 一元函数积分学的应用（三）",short:"第12讲 一元函数积分学的应用（三）",total:8,cols:5,wb:"基础30讲",subj:"高数",relPath:"基础30讲/高数/第12讲 一元函数积分学的应用（三）",labels:["例12-1", "例12-2", "例12-3", "例12-4", "12-1", "12-2", "12-3", "12-4"]},
{id:"ch13",category:"shu1",number:13,name:"基础30讲 - 高数 - 第13讲 多元函数微分学",short:"第13讲 多元函数微分学",total:36,cols:5,wb:"基础30讲",subj:"高数",relPath:"基础30讲/高数/第13讲 多元函数微分学",labels:["例13-1", "例13-2", "例13-3", "例13-4", "例13-5", "例13-6", "例13-7", "例13-8", "例13-9", "例13-10", "例13-11", "例13-12", "例13-13", "例13-14", "例13-15", "例13-16", "例13-17", "例13-18", "例13-19", "例13-20", "例13-21", "例13-22", "13-1", "13-2", "13-3", "13-4", "13-5", "13-6", "13-7", "13-8", "13-9", "13-10", "13-11", "13-12", "13-13", "13-14"]},
{id:"ch14",category:"shu1",number:14,name:"基础30讲 - 高数 - 第14讲 二重积分",short:"第14讲 二重积分",total:29,cols:5,wb:"基础30讲",subj:"高数",relPath:"基础30讲/高数/第14讲 二重积分",labels:["例14-1", "例14-2", "例14-3", "例14-4", "例14-5", "例14-6", "例14-7", "例14-8", "例14-9", "例14-10", "例14-11", "例14-12", "例14-13", "例14-14", "例14-15", "例14-16", "例14-17", "14-1", "14-2", "14-3", "14-4", "14-5", "14-6", "14-7", "14-8", "14-9", "14-10", "14-11", "14-12"]},
{id:"ch15",category:"shu1",number:15,name:"基础30讲 - 高数 - 第15讲 微分方程",short:"第15讲 微分方程",total:40,cols:5,wb:"基础30讲",subj:"高数",relPath:"基础30讲/高数/第15讲 微分方程",labels:["例15-1", "例15-2", "例15-3", "例15-4", "例15-5", "例15-6", "例15-7", "例15-8", "例15-9", "例15-10", "例15-11", "例15-12", "例15-13", "例15-14", "例15-15", "例15-16", "例15-17", "例15-18", "例15-19", "例15-20", "例15-21", "例15-22", "例15-23", "例15-24", "例15-25", "15-1", "15-2", "15-3", "15-4", "15-5", "15-6", "15-7", "15-8", "15-9", "15-10", "15-11", "15-12", "15-13", "15-14", "15-15"]},
{id:"ch16",category:"shu1",number:16,name:"基础30讲 - 高数 - 第16讲 无穷级数（仅数一、数三）",short:"第16讲 无穷级数（仅数一、数三）",total:56,cols:5,wb:"基础30讲",subj:"高数",relPath:"基础30讲/高数/第16讲 无穷级数（仅数一、数三）",labels:["例16-1", "例16-2", "例16-3", "例16-4", "例16-5", "例16-6", "例16-7", "例16-8", "例16-9", "例16-10", "例16-11", "例16-12", "例16-13", "例16-14", "例16-15", "例16-16", "例16-17", "例16-18", "例16-19", "例16-20", "例16-21", "例16-22", "例16-23", "例16-24", "例16-25", "例16-26", "例16-27", "例16-28", "例16-29", "例16-30", "例16-31", "例16-32", "例16-33", "例16-34", "例16-35", "例16-36", "例16-37", "例16-38", "例16-39", "16-1", "16-2", "16-3", "16-4", "16-5", "16-6", "16-7", "16-8", "16-9", "16-10", "16-11", "16-12", "16-13", "16-14", "16-15", "16-16", "16-17"]},
{id:"ch17",category:"shu1",number:17,name:"基础30讲 - 高数 - 第17讲 多元函数积分学的预备知识（仅数一）",short:"第17讲 多元函数积分学的预备知识（仅数一）",total:23,cols:5,wb:"基础30讲",subj:"高数",relPath:"基础30讲/高数/第17讲 多元函数积分学的预备知识（仅数一）",labels:["例17-1", "例17-2", "例17-3", "例17-4", "例17-5", "例17-6", "例17-7", "例17-8", "例17-9", "例17-10", "例17-11", "例17-12", "例17-13", "17-1", "17-2", "17-3", "17-4", "17-5", "17-6", "17-7", "17-8", "17-9", "17-10"]},
{id:"ch18",category:"shu1",number:18,name:"基础30讲 - 高数 - 第18讲 多元函数积分学（仅数一）",short:"第18讲 多元函数积分学（仅数一）",total:41,cols:5,wb:"基础30讲",subj:"高数",relPath:"基础30讲/高数/第18讲 多元函数积分学（仅数一）",labels:["例18-1", "例18-2", "例18-3", "例18-4", "例18-5", "例18-6", "例18-7", "例18-8", "例18-9", "例18-10", "例18-11", "例18-12", "例18-13", "例18-14", "例18-15", "例18-16", "例18-17", "例18-18", "例18-19", "例18-20", "例18-21", "例18-22", "例18-23", "例18-24", "例18-25", "例18-26", "例18-27", "例18-28", "例18-29", "例18-30", "18-1", "18-2", "18-3", "18-4", "18-5", "18-6", "18-7", "18-8", "18-9", "18-10", "18-11"]},
{id:"ch19",category:"shu1",number:19,name:"基础30讲 - 线代 - 第1讲 行列式",short:"第1讲 行列式",total:24,cols:5,wb:"基础30讲",subj:"线代",relPath:"基础30讲/线代/第1讲 行列式",labels:["例1-1", "例1-2", "例1-3", "例1-4", "例1-5", "例1-6", "例1-7", "例1-8", "例1-9", "例1-10", "例1-11", "例1-12", "例1-13", "1-1", "1-2", "1-3", "1-4", "1-5", "1-6", "1-7", "1-8", "1-9", "1-10", "1-11"]},
{id:"ch20",category:"shu1",number:20,name:"基础30讲 - 线代 - 第2讲 矩阵",short:"第2讲 矩阵",total:35,cols:5,wb:"基础30讲",subj:"线代",relPath:"基础30讲/线代/第2讲 矩阵",labels:["例2-1", "例2-2", "例2-3", "例2-4", "例2-5", "例2-6", "例2-7", "例2-8", "例2-9", "例2-10", "例2-11", "例2-12", "例2-13", "例2-14", "例2-15", "例2-16", "例2-17", "例2-18", "例2-19", "例2-20", "2-1", "2-2", "2-3", "2-4", "2-5", "2-6", "2-7", "2-8", "2-9", "2-10", "2-11", "2-12", "2-13", "2-14", "2-15"]},
{id:"ch21",category:"shu1",number:21,name:"基础30讲 - 线代 - 第3讲 向量组",short:"第3讲 向量组",total:26,cols:5,wb:"基础30讲",subj:"线代",relPath:"基础30讲/线代/第3讲 向量组",labels:["例3-1", "例3-2", "例3-3", "例3-4", "例3-5", "例3-6", "例3-7", "例3-8", "例3-9", "例3-10", "例3-11", "例3-12", "例3-13", "例3-14", "3-1", "3-2", "3-3", "3-4", "3-5", "3-6", "3-7", "3-8", "3-9", "3-10", "3-11", "3-12"]},
{id:"ch22",category:"shu1",number:22,name:"基础30讲 - 线代 - 第4讲 线性方程组",short:"第4讲 线性方程组",total:25,cols:5,wb:"基础30讲",subj:"线代",relPath:"基础30讲/线代/第4讲 线性方程组",labels:["例4-1", "例4-2", "例4-3", "例4-4", "例4-5", "例4-6", "例4-7", "例4-8", "例4-9", "例4-10", "例4-11", "例4-12", "例4-13", "例4-14", "例4-15", "4-1", "4-2", "4-3", "4-4", "4-5", "4-6", "4-7", "4-8", "4-9", "4-10"]},
{id:"ch23",category:"shu1",number:23,name:"基础30讲 - 线代 - 第5讲 特征值与特征向量",short:"第5讲 特征值与特征向量",total:34,cols:5,wb:"基础30讲",subj:"线代",relPath:"基础30讲/线代/第5讲 特征值与特征向量",labels:["例5-1", "例5-2", "例5-3", "例5-4", "例5-5", "例5-6", "例5-7", "例5-8", "例5-9", "例5-10", "例5-11", "例5-12", "例5-13", "例5-14", "例5-15", "例5-16", "例5-17", "例5-18", "例5-19", "5-1", "5-2", "5-3", "5-4", "5-5", "5-6", "5-7", "5-8", "5-9", "5-10", "5-11", "5-12", "5-13", "5-14", "5-15"]},
{id:"ch24",category:"shu1",number:24,name:"基础30讲 - 线代 - 第6讲 二次型",short:"第6讲 二次型",total:25,cols:5,wb:"基础30讲",subj:"线代",relPath:"基础30讲/线代/第6讲 二次型",labels:["例6-1", "例6-2", "例6-3", "例6-4", "例6-5", "例6-6", "例6-7", "例6-8", "例6-9", "例6-10", "例6-11", "例6-12", "6-1", "6-2", "6-3", "6-4", "6-5", "6-6", "6-7", "6-8", "6-9", "6-10", "6-11", "6-12", "6-13"]},
{id:"ch25",category:"shu1",number:25,name:"基础30讲 - 概率论 - 第1讲 随机事件与概率",short:"第1讲 随机事件与概率",total:34,cols:5,wb:"基础30讲",subj:"概率论",relPath:"基础30讲/概率论/第1讲 随机事件与概率",labels:["例1-1", "例1-2", "例1-3", "例1-4", "例1-5", "例1-6", "例1-7", "例1-8", "例1-9", "例1-10", "例1-11", "例1-12", "例1-13", "例1-14", "例1-15", "1-1", "1-2", "1-3", "1-4", "1-5", "1-6", "1-7", "1-8", "1-9", "1-10", "1-11", "1-12", "1-13", "1-14", "1-15", "1-16", "1-17", "1-18", "1-19"]},
{id:"ch26",category:"shu1",number:26,name:"基础30讲 - 概率论 - 第2讲 一维随机变量及其分布",short:"第2讲 一维随机变量及其分布",total:36,cols:5,wb:"基础30讲",subj:"概率论",relPath:"基础30讲/概率论/第2讲 一维随机变量及其分布",labels:["例2-1", "例2-2", "例2-3", "例2-4", "例2-5", "例2-6", "例2-7", "例2-8", "例2-9", "例2-10", "例2-11", "例2-12", "例2-13", "例2-14", "例2-15", "例2-16", "例2-17", "例2-18", "2-1", "2-2", "2-3", "2-4", "2-5", "2-6", "2-7", "2-8", "2-9", "2-10", "2-11", "2-12", "2-13", "2-14", "2-15", "2-16", "2-17", "2-18"]},
{id:"ch27",category:"shu1",number:27,name:"基础30讲 - 概率论 - 第3讲 多维随机变量及其分布",short:"第3讲 多维随机变量及其分布",total:30,cols:5,wb:"基础30讲",subj:"概率论",relPath:"基础30讲/概率论/第3讲 多维随机变量及其分布",labels:["例3-1", "例3-2", "例3-3", "例3-4", "例3-5", "例3-6", "例3-7", "例3-8", "例3-9", "例3-10", "例3-11", "例3-12", "3-1", "3-2", "3-3", "3-4", "3-5", "3-6", "3-7", "3-8", "3-9", "3-10", "3-11", "3-12", "3-13", "3-14", "3-15", "3-16", "3-17", "3-18"]},
{id:"ch28",category:"shu1",number:28,name:"基础30讲 - 概率论 - 第4讲 随机变量的数字特征",short:"第4讲 随机变量的数字特征",total:26,cols:5,wb:"基础30讲",subj:"概率论",relPath:"基础30讲/概率论/第4讲 随机变量的数字特征",labels:["例4-1", "例4-2", "例4-3", "例4-4", "例4-5", "例4-6", "例4-7", "例4-8", "例4-9", "例4-10", "例4-11", "例4-12", "4-1", "4-2", "4-3", "4-4", "4-5", "4-6", "4-7", "4-8", "4-9", "4-10", "4-11", "4-12", "4-13", "4-14"]},
{id:"ch29",category:"shu1",number:29,name:"基础30讲 - 概率论 - 第5讲 大数定律与中心极限定理",short:"第5讲 大数定律与中心极限定理",total:11,cols:5,wb:"基础30讲",subj:"概率论",relPath:"基础30讲/概率论/第5讲 大数定律与中心极限定理",labels:["例5-1", "例5-2", "例5-3", "例5-4", "例5-5", "例5-6", "5-1", "5-2", "5-3", "5-4", "5-5"]},
{id:"ch30",category:"shu1",number:30,name:"基础30讲 - 概率论 - 第6讲 数理统计",short:"第6讲 数理统计",total:29,cols:5,wb:"基础30讲",subj:"概率论",relPath:"基础30讲/概率论/第6讲 数理统计",labels:["例6-1", "例6-2", "例6-3", "例6-4", "例6-5", "例6-6", "例6-7", "例6-8", "例6-9", "例6-10", "例6-11", "例6-12", "例6-13", "例6-14", "例6-15", "例6-16", "例6-17", "6-1", "6-2", "6-3", "6-4", "6-5", "6-6", "6-7", "6-8", "6-9", "6-10", "6-11", "6-12"]},
{id:"ch31",category:"shu1",number:31,name:"张宇强化36讲 - 高数 - 第1讲 函数极限与连续",short:"第1讲 函数极限与连续",total:15,cols:5,wb:"张宇强化36讲",subj:"高数",relPath:"强化36讲/高数/第1讲 函数极限与连续",labels:["例1-1", "例1-2", "例1-3", "例1-4", "例1-5", "例1-6", "例1-7", "例1-8", "例1-9", "例1-10", "例1-11", "例1-12", "例1-13", "例1-14", "例1-15"]},
{id:"ch32",category:"shu1",number:32,name:"张宇强化36讲 - 高数 - 第2讲 数列极限",short:"第2讲 数列极限",total:13,cols:5,wb:"张宇强化36讲",subj:"高数",relPath:"强化36讲/高数/第2讲 数列极限",labels:["例2-1", "例2-2", "例2-3", "例2-4", "例2-5", "例2-6", "例2-7", "例2-8", "例2-9", "例2-10", "例2-11", "例2-12", "例2-13"]},
{id:"ch33",category:"shu1",number:33,name:"张宇强化36讲 - 高数 - 第3讲 一元函数微分学的概念",short:"第3讲 一元函数微分学的概念",total:8,cols:5,wb:"张宇强化36讲",subj:"高数",relPath:"强化36讲/高数/第3讲 一元函数微分学的概念",labels:["例3-1", "例3-2", "例3-3", "例3-4", "例3-5", "例3-6", "例3-7", "例3-8"]},
{id:"ch34",category:"shu1",number:34,name:"张宇强化36讲 - 高数 - 第4讲 一元函数微分学的计算",short:"第4讲 一元函数微分学的计算",total:9,cols:5,wb:"张宇强化36讲",subj:"高数",relPath:"强化36讲/高数/第4讲 一元函数微分学的计算",labels:["例4-1", "例4-2", "例4-3", "例4-4", "例4-5", "例4-6", "例4-7", "例4-8", "例4-9"]},
{id:"ch35",category:"shu1",number:35,name:"张宇强化36讲 - 高数 - 第5讲 一元函数微分学的应用（一）—几何应用",short:"第5讲 一元函数微分学的应用（一）—几何应用",total:9,cols:5,wb:"张宇强化36讲",subj:"高数",relPath:"强化36讲/高数/第5讲 一元函数微分学的应用（一）—几何应用",labels:["例5-1", "例5-2", "例5-3", "例5-4", "例5-5", "例5-6", "例5-7", "例5-8", "例5-9"]},
{id:"ch36",category:"shu1",number:36,name:"张宇强化36讲 - 高数 - 第6讲 一元函数微分学的应用（二）—中值定理等",short:"第6讲 一元函数微分学的应用（二）—中值定理等",total:22,cols:5,wb:"张宇强化36讲",subj:"高数",relPath:"强化36讲/高数/第6讲 一元函数微分学的应用（二）—中值定理等",labels:["例6-1", "例6-2", "例6-3", "例6-4", "例6-5", "例6-6", "例6-7", "例6-8", "例6-9", "例6-10", "例6-11", "例6-12", "例6-13", "例6-14", "例6-15", "例6-16", "例6-17", "例6-18", "例6-19", "例6-20", "例6-21", "例6-22"]},
{id:"ch37",category:"shu1",number:37,name:"张宇强化36讲 - 高数 - 第7讲 一元函数微分学的应用（三）—物理应用与经济应用",short:"第7讲 一元函数微分学的应用（三）—物理应用与经济应用",total:5,cols:5,wb:"张宇强化36讲",subj:"高数",relPath:"强化36讲/高数/第7讲 一元函数微分学的应用（三）—物理应用与经济应用",labels:["例7-1", "例7-2", "例7-3", "例7-4", "例7-5"]},
{id:"ch38",category:"shu1",number:38,name:"张宇强化36讲 - 高数 - 第8讲 一元函数积分学的概念与性质",short:"第8讲 一元函数积分学的概念与性质",total:8,cols:5,wb:"张宇强化36讲",subj:"高数",relPath:"强化36讲/高数/第8讲 一元函数积分学的概念与性质",labels:["例8-1", "例8-2", "例8-3", "例8-4", "例8-5", "例8-6", "例8-7", "例8-8"]},
{id:"ch39",category:"shu1",number:39,name:"张宇强化36讲 - 高数 - 第9讲 一元函数积分学的概念与性质",short:"第9讲 一元函数积分学的概念与性质",total:22,cols:5,wb:"张宇强化36讲",subj:"高数",relPath:"强化36讲/高数/第9讲 一元函数积分学的概念与性质",labels:["例9-1", "例9-2", "例9-3", "例9-4", "例9-5", "例9-6", "例9-7", "例9-8", "例9-9", "例9-10", "例9-11", "例9-12", "例9-13", "例9-14", "例9-15", "例9-16", "例9-17", "例9-18", "例9-19", "例9-20", "例9-21", "例9-22"]},
{id:"ch40",category:"shu1",number:40,name:"张宇强化36讲 - 高数 - 第10讲 一元函数积分学的应用（一）—几何应用",short:"第10讲 一元函数积分学的应用（一）—几何应用",total:15,cols:5,wb:"张宇强化36讲",subj:"高数",relPath:"强化36讲/高数/第10讲 一元函数积分学的应用（一）—几何应用",labels:["例10-1", "例10-2", "例10-3", "例10-4", "例10-5", "例10-6", "例10-7", "例10-8", "例10-9", "例10-10", "例10-11", "例10-12", "例10-13", "例10-14", "例10-15"]},
{id:"ch41",category:"shu1",number:41,name:"张宇强化36讲 - 高数 - 第11讲 一元函数积分学的应用（二）—积分等式与积分不等式",short:"第11讲 一元函数积分学的应用（二）—积分等式与积分不等式",total:19,cols:5,wb:"张宇强化36讲",subj:"高数",relPath:"强化36讲/高数/第11讲 一元函数积分学的应用（二）—积分等式与积分不等式",labels:["例11-1", "例11-2", "例11-3", "例11-4", "例11-5", "例11-6", "例11-7", "例11-8", "例11-9", "例11-10", "例11-11", "例11-12", "例11-13", "例11-14", "例11-15", "例11-16", "例11-17", "例11-18", "例11-19"]},
{id:"ch42",category:"shu1",number:42,name:"张宇强化36讲 - 高数 - 第12讲 一元函数积分学的应用（三）—物理应用与经济应用",short:"第12讲 一元函数积分学的应用（三）—物理应用与经济应用",total:7,cols:5,wb:"张宇强化36讲",subj:"高数",relPath:"强化36讲/高数/第12讲 一元函数积分学的应用（三）—物理应用与经济应用",labels:["例12-1", "例12-2", "例12-3", "例12-4", "例12-5", "例12-6", "例12-7"]},
{id:"ch43",category:"shu1",number:43,name:"张宇强化36讲 - 高数 - 第13讲 多元函数微分学",short:"第13讲 多元函数微分学",total:32,cols:5,wb:"张宇强化36讲",subj:"高数",relPath:"强化36讲/高数/第13讲 多元函数微分学",labels:["例13-1", "例13-2", "例13-3", "例13-4", "例13-5", "例13-6", "例13-7", "例13-8", "例13-9", "例13-10", "例13-11", "例13-12", "例13-13", "例13-14", "例13-15", "例13-16", "例13-17", "例13-18", "例13-19", "例13-20", "例13-21", "例13-22", "例13-23", "例13-24", "例13-25", "例13-26", "例13-27", "例13-28", "例13-29", "例13-30", "例13-31", "例13-32"]},
{id:"ch44",category:"shu1",number:44,name:"张宇强化36讲 - 高数 - 第14讲 二重积分",short:"第14讲 二重积分",total:8,cols:5,wb:"张宇强化36讲",subj:"高数",relPath:"强化36讲/高数/第14讲 二重积分",labels:["例14-1", "例14-2", "例14-3", "例14-4", "例14-5", "例14-6", "例14-7", "例14-8"]},
{id:"ch45",category:"shu1",number:45,name:"张宇强化36讲 - 高数 - 第15讲 微分方程",short:"第15讲 微分方程",total:19,cols:5,wb:"张宇强化36讲",subj:"高数",relPath:"强化36讲/高数/第15讲 微分方程",labels:["例15-1", "例15-2", "例15-3", "例15-4", "例15-5", "例15-6", "例15-7", "例15-8", "例15-9", "例15-10", "例15-11", "例15-12", "例15-13", "例15-14", "例15-15", "例15-16", "例15-17", "例15-18", "例15-19"]},
{id:"ch46",category:"shu1",number:46,name:"张宇强化36讲 - 高数 - 第16讲 无穷级数（仅数一、三）",short:"第16讲 无穷级数（仅数一、三）",total:57,cols:5,wb:"张宇强化36讲",subj:"高数",relPath:"强化36讲/高数/第16讲 无穷级数（仅数一、三）",labels:["例16-1", "例16-2", "例16-3", "例16-4", "例16-5", "例16-6", "例16-7", "例16-8", "例16-9", "例16-10", "例16-11", "例16-12", "例16-13", "例16-14", "例16-15", "例16-16", "例16-17", "例16-18", "例16-19", "例16-20", "例16-21", "例16-22", "例16-23", "例16-24", "例16-25", "例16-26", "例16-27", "例16-28", "例16-29", "例16-30", "例16-31", "例16-32", "例16-33", "例16-34", "例16-35", "例16-36", "例16-37", "例16-38", "例16-39", "例16-40", "例16-41", "例16-42", "例16-43", "例16-44", "例16-45", "例16-46", "例16-47", "例16-48", "例16-49", "例16-50", "例16-51", "例16-52", "例16-53", "例16-54", "例16-55", "例16-56", "例16-57"]},
{id:"ch47",category:"shu1",number:47,name:"张宇强化36讲 - 高数 - 第17讲 多元函数积分学的预备知识（仅数一）",short:"第17讲 多元函数积分学的预备知识（仅数一）",total:7,cols:5,wb:"张宇强化36讲",subj:"高数",relPath:"强化36讲/高数/第17讲 多元函数积分学的预备知识（仅数一）",labels:["例17-1", "例17-2", "例17-3", "例17-4", "例17-5", "例17-6", "例17-7"]},
{id:"ch48",category:"shu1",number:48,name:"张宇强化36讲 - 高数 - 第18讲 多元函数积分学（仅数一）",short:"第18讲 多元函数积分学（仅数一）",total:29,cols:5,wb:"张宇强化36讲",subj:"高数",relPath:"强化36讲/高数/第18讲 多元函数积分学（仅数一）",labels:["例18-1", "例18-2", "例18-3", "例18-4", "例18-5", "例18-6", "例18-7", "例18-8", "例18-9", "例18-10", "例18-11", "例18-12", "例18-13", "例18-14", "例18-15", "例18-16", "例18-17", "例18-18", "例18-19", "例18-20", "例18-21", "例18-22", "例18-23", "例18-24", "例18-25", "例18-26", "例18-27", "例18-28", "例18-29"]},
{id:"ch49",category:"shu1",number:49,name:"张宇强化36讲 - 线代 - 第1讲 行列式",short:"第1讲 行列式",total:7,cols:5,wb:"张宇强化36讲",subj:"线代",relPath:"强化36讲/线代/第1讲 行列式",labels:["例1-2", "例1-3", "例1-4", "例1-5", "例1-6", "例1-7", "例1-8"]},
{id:"ch50",category:"shu1",number:50,name:"张宇强化36讲 - 线代 - 第2讲 余子式和代数余子式的计算",short:"第2讲 余子式和代数余子式的计算",total:4,cols:5,wb:"张宇强化36讲",subj:"线代",relPath:"强化36讲/线代/第2讲 余子式和代数余子式的计算",labels:["例2-1", "例2-2", "例2-3", "例2-4"]},
{id:"ch51",category:"shu1",number:51,name:"张宇强化36讲 - 线代 - 第3讲 矩阵运算",short:"第3讲 矩阵运算",total:20,cols:5,wb:"张宇强化36讲",subj:"线代",relPath:"强化36讲/线代/第3讲 矩阵运算",labels:["例3-1", "例3-2", "例3-3", "例3-4", "例3-5", "例3-6", "例3-7", "例3-8", "例3-9", "例3-10", "例3-11", "例3-12", "例3-13", "例3-14", "例3-15", "例3-16", "例3-17", "例3-18", "例3-19", "例3-20"]},
{id:"ch52",category:"shu1",number:52,name:"张宇强化36讲 - 线代 - 第4讲 矩阵的秩",short:"第4讲 矩阵的秩",total:9,cols:5,wb:"张宇强化36讲",subj:"线代",relPath:"强化36讲/线代/第4讲 矩阵的秩",labels:["例4-1", "例4-2", "例4-3", "例4-4", "例4-5", "例4-6", "例4-7", "例4-8", "例4-9"]},
{id:"ch53",category:"shu1",number:53,name:"张宇强化36讲 - 线代 - 第5讲 线性方程组",short:"第5讲 线性方程组",total:10,cols:5,wb:"张宇强化36讲",subj:"线代",relPath:"强化36讲/线代/第5讲 线性方程组",labels:["例5-1", "例5-2", "例5-3", "例5-4", "例5-5", "例5-6", "例5-7", "例5-8", "例5-9", "例5-10"]},
{id:"ch54",category:"shu1",number:54,name:"张宇强化36讲 - 线代 - 第6讲 向量组",short:"第6讲 向量组",total:7,cols:5,wb:"张宇强化36讲",subj:"线代",relPath:"强化36讲/线代/第6讲 向量组",labels:["例6-1", "例6-2", "例6-3", "例6-4", "例6-5", "例6-6", "例6-7"]},
{id:"ch55",category:"shu1",number:55,name:"张宇强化36讲 - 线代 - 第7讲 特征值与特征向量",short:"第7讲 特征值与特征向量",total:4,cols:5,wb:"张宇强化36讲",subj:"线代",relPath:"强化36讲/线代/第7讲 特征值与特征向量",labels:["例7-1", "例7-2", "例7-3", "例7-4"]},
{id:"ch56",category:"shu1",number:56,name:"张宇强化36讲 - 线代 - 第8讲 相似理论",short:"第8讲 相似理论",total:10,cols:5,wb:"张宇强化36讲",subj:"线代",relPath:"强化36讲/线代/第8讲 相似理论",labels:["例8-1", "例8-2", "例8-3", "例8-4", "例8-5", "例8-6", "例8-7", "例8-8", "例8-9", "例8-10"]},
{id:"ch57",category:"shu1",number:57,name:"张宇强化36讲 - 线代 - 第9讲 二次型",short:"第9讲 二次型",total:15,cols:5,wb:"张宇强化36讲",subj:"线代",relPath:"强化36讲/线代/第9讲 二次型",labels:["例9-1", "例9-2", "例9-3", "例9-4", "例9-5", "例9-6", "例9-7", "例9-8", "例9-9", "例9-10", "例9-11", "例9-12", "例9-13", "例9-14", "例9-15"]},
{id:"ch58",category:"shu1",number:58,name:"张宇强化36讲 - 概率论 - 第1讲 随机事件和概率",short:"第1讲 随机事件和概率",total:10,cols:5,wb:"张宇强化36讲",subj:"概率论",relPath:"强化36讲/概率论/第1讲 随机事件和概率",labels:["例1-1", "例1-2", "例1-3", "例1-4", "例1-5", "例1-6", "例1-7", "例1-8", "例1-9", "例1-10"]},
{id:"ch59",category:"shu1",number:59,name:"张宇强化36讲 - 概率论 - 第2讲 一维随机变量及其分布",short:"第2讲 一维随机变量及其分布",total:12,cols:5,wb:"张宇强化36讲",subj:"概率论",relPath:"强化36讲/概率论/第2讲 一维随机变量及其分布",labels:["例2-1", "例2-2", "例2-3", "例2-4", "例2-5", "例2-6", "例2-7", "例2-8", "例2-9", "例2-10", "例2-11", "例2-12"]},
{id:"ch60",category:"shu1",number:60,name:"张宇强化36讲 - 概率论 - 第3讲 一维随机变量函数的分布",short:"第3讲 一维随机变量函数的分布",total:6,cols:5,wb:"张宇强化36讲",subj:"概率论",relPath:"强化36讲/概率论/第3讲 一维随机变量函数的分布",labels:["例3-1", "例3-2", "例3-3", "例3-4", "例3-5", "例3-6"]},
{id:"ch61",category:"shu1",number:61,name:"张宇强化36讲 - 概率论 - 第4讲 多维随机变量及其分布",short:"第4讲 多维随机变量及其分布",total:4,cols:5,wb:"张宇强化36讲",subj:"概率论",relPath:"强化36讲/概率论/第4讲 多维随机变量及其分布",labels:["例4-1", "例4-2", "例4-3", "例4-4"]},
{id:"ch62",category:"shu1",number:62,name:"张宇强化36讲 - 概率论 - 第5讲 多维随机变量函数的分布",short:"第5讲 多维随机变量函数的分布",total:9,cols:5,wb:"张宇强化36讲",subj:"概率论",relPath:"强化36讲/概率论/第5讲 多维随机变量函数的分布",labels:["例5-1", "例5-2", "例5-3", "例5-4", "例5-5", "例5-6", "例5-7", "例5-8", "例5-9"]},
{id:"ch63",category:"shu1",number:63,name:"张宇强化36讲 - 概率论 - 第6讲 数字特征",short:"第6讲 数字特征",total:10,cols:5,wb:"张宇强化36讲",subj:"概率论",relPath:"强化36讲/概率论/第6讲 数字特征",labels:["例6-1", "例6-2", "例6-3", "例6-4", "例6-5", "例6-6", "例6-7", "例6-8", "例6-9", "例6-10"]},
{id:"ch64",category:"shu1",number:64,name:"张宇强化36讲 - 概率论 - 第7讲 大数定律与中心极限定理",short:"第7讲 大数定律与中心极限定理",total:3,cols:5,wb:"张宇强化36讲",subj:"概率论",relPath:"强化36讲/概率论/第7讲 大数定律与中心极限定理",labels:["例7-1", "例7-2", "例7-3"]},
{id:"ch65",category:"shu1",number:65,name:"张宇强化36讲 - 概率论 - 第8讲 统计量及其分布",short:"第8讲 统计量及其分布",total:5,cols:5,wb:"张宇强化36讲",subj:"概率论",relPath:"强化36讲/概率论/第8讲 统计量及其分布",labels:["例8-1", "例8-2", "例8-3", "例8-4", "例8-5"]},
{id:"ch66",category:"shu1",number:66,name:"张宇强化36讲 - 概率论 - 第9讲 参数估计与假设检验",short:"第9讲 参数估计与假设检验",total:12,cols:5,wb:"张宇强化36讲",subj:"概率论",relPath:"强化36讲/概率论/第9讲 参数估计与假设检验",labels:["例9-1", "例9-2", "例9-3", "例9-4", "例9-5", "例9-6", "例9-7", "例9-8", "例9-9", "例9-10", "例9-11", "例9-12"]},
{id:"ch67",category:"shu1",number:67,name:"数一1000题 - 基础篇-高数 - 第1章 函数极限与连续",short:"第1章 函数极限与连续",total:23,cols:5,wb:"数一1000题",subj:"基础篇-高数",relPath:"1000题/基础篇/高数/第1章 函数极限与连续",labels:["例1-1", "例1-2", "例1-3", "例1-4", "例1-5", "例1-6", "例1-7", "例1-8", "例1-9", "例1-10", "例1-11", "例1-12", "例1-13", "例1-14", "例1-15", "例1-16", "例1-17", "例1-18", "例1-19", "例1-20", "例1-21", "例1-22", "例1-23"]},
{id:"ch68",category:"shu1",number:68,name:"数一1000题 - 基础篇-高数 - 第2讲 数列极限",short:"第2讲 数列极限",total:12,cols:5,wb:"数一1000题",subj:"基础篇-高数",relPath:"1000题/基础篇/高数/第2讲 数列极限",labels:["例2-1", "例2-2", "例2-3", "例2-4", "例2-5", "例2-6", "例2-7", "例2-8", "例2-9", "例2-10", "例2-11", "例2-12"]},
{id:"ch69",category:"shu1",number:69,name:"数一1000题 - 基础篇-高数 - 第3章 一元函数微分学的概念",short:"第3章 一元函数微分学的概念",total:15,cols:5,wb:"数一1000题",subj:"基础篇-高数",relPath:"1000题/基础篇/高数/第3章 一元函数微分学的概念",labels:["例3-1", "例3-2", "例3-3", "例3-4", "例3-5", "例3-6", "例3-7", "例3-8", "例3-9", "例3-10", "例3-11", "例3-12", "例3-13", "例3-14", "例3-15"]},
{id:"ch70",category:"shu1",number:70,name:"数一1000题 - 基础篇-高数 - 第4章 一元函数微分学的计算",short:"第4章 一元函数微分学的计算",total:18,cols:5,wb:"数一1000题",subj:"基础篇-高数",relPath:"1000题/基础篇/高数/第4章 一元函数微分学的计算",labels:["例4-1", "例4-2", "例4-3", "例4-4", "例4-5", "例4-6", "例4-7", "例4-8", "例4-9", "例4-10", "例4-11", "例4-12", "例4-13", "例4-14", "例4-15", "例4-16", "例4-17", "例4-18"]},
{id:"ch71",category:"shu1",number:71,name:"数一1000题 - 基础篇-高数 - 第5章 一元函数微分学的应用（一）—几何应用",short:"第5章 一元函数微分学的应用（一）—几何应用",total:24,cols:5,wb:"数一1000题",subj:"基础篇-高数",relPath:"1000题/基础篇/高数/第5章 一元函数微分学的应用（一）—几何应用",labels:["例5-1", "例5-2", "例5-3", "例5-4", "例5-5", "例5-6", "例5-7", "例5-8", "例5-9", "例5-10", "例5-11", "例5-12", "例5-13", "例5-14", "例5-15", "例5-16", "例5-17", "例5-18", "例5-19", "例5-20", "例5-21", "例5-22", "例5-23", "例5-24"]},
{id:"ch72",category:"shu1",number:72,name:"数一1000题 - 基础篇-高数 - 第6章 一元函数微分学的应用（二）—中值定理与不等式",short:"第6章 一元函数微分学的应用（二）—中值定理与不等式",total:22,cols:5,wb:"数一1000题",subj:"基础篇-高数",relPath:"1000题/基础篇/高数/第6章 一元函数微分学的应用（二）—中值定理与不等式",labels:["例6-1", "例6-2", "例6-3", "例6-4", "例6-5", "例6-6", "例6-7", "例6-8", "例6-9", "例6-10", "例6-11", "例6-12", "例6-13", "例6-14", "例6-15", "例6-16", "例6-17", "例6-18", "例6-19", "例6-20", "例6-21", "例6-22"]},
{id:"ch73",category:"shu1",number:73,name:"数一1000题 - 基础篇-高数 - 第7章 一元函数微分学的应用（三）—物理应用",short:"第7章 一元函数微分学的应用（三）—物理应用",total:5,cols:5,wb:"数一1000题",subj:"基础篇-高数",relPath:"1000题/基础篇/高数/第7章 一元函数微分学的应用（三）—物理应用",labels:["例7-1", "例7-2", "例7-3", "例7-4", "例7-5"]},
{id:"ch74",category:"shu1",number:74,name:"数一1000题 - 基础篇-高数 - 第8章 一元函数积分学的概念与性质",short:"第8章 一元函数积分学的概念与性质",total:25,cols:5,wb:"数一1000题",subj:"基础篇-高数",relPath:"1000题/基础篇/高数/第8章 一元函数积分学的概念与性质",labels:["例8-1", "例8-2", "例8-3", "例8-4", "例8-5", "例8-6", "例8-7", "例8-8", "例8-9", "例8-10", "例8-11", "例8-12", "例8-13", "例8-14", "例8-15", "例8-16", "例8-17", "例8-18", "例8-19", "例8-20", "例8-21", "例8-22", "例8-23", "例8-24", "例8-25"]},
{id:"ch75",category:"shu1",number:75,name:"数一1000题 - 基础篇-高数 - 第9章 一元函数积分学的计算",short:"第9章 一元函数积分学的计算",total:36,cols:5,wb:"数一1000题",subj:"基础篇-高数",relPath:"1000题/基础篇/高数/第9章 一元函数积分学的计算",labels:["例9-1", "例9-2", "例9-3", "例9-4", "例9-5", "例9-6", "例9-7", "例9-8", "例9-9", "例9-10", "例9-11", "例9-12", "例9-13", "例9-14", "例9-15", "例9-16", "例9-17", "例9-18", "例9-19", "例9-20", "例9-21", "例9-22", "例9-23", "例9-24", "例9-25", "例9-26", "例9-27", "例9-28", "例9-29", "例9-30", "例9-31", "例9-32", "例9-33", "例9-34", "例9-35", "例9-36"]},
{id:"ch76",category:"shu1",number:76,name:"数一1000题 - 基础篇-高数 - 第10章 一元函数积分的应用（一）—几何应用",short:"第10章 一元函数积分的应用（一）—几何应用",total:19,cols:5,wb:"数一1000题",subj:"基础篇-高数",relPath:"1000题/基础篇/高数/第10章 一元函数积分的应用（一）—几何应用",labels:["例10-1", "例10-2", "例10-3", "例10-4", "例10-5", "例10-6", "例10-7", "例10-8", "例10-9", "例10-10", "例10-11", "例10-12", "例10-13", "例10-14", "例10-15", "例10-16", "例10-17", "例10-18", "例10-19"]},
{id:"ch77",category:"shu1",number:77,name:"数一1000题 - 基础篇-高数 - 第11章 一元函数积分学的应用（二）—积分等式与积分不等式",short:"第11章 一元函数积分学的应用（二）—积分等式与积分不等式",total:11,cols:5,wb:"数一1000题",subj:"基础篇-高数",relPath:"1000题/基础篇/高数/第11章 一元函数积分学的应用（二）—积分等式与积分不等式",labels:["例11-1", "例11-2", "例11-3", "例11-4", "例11-5", "例11-6", "例11-7", "例11-8", "例11-9", "例11-10", "例11-11"]},
{id:"ch78",category:"shu1",number:78,name:"数一1000题 - 基础篇-高数 - 第12章 一元函数积分学的应用（三）—物理应用",short:"第12章 一元函数积分学的应用（三）—物理应用",total:7,cols:5,wb:"数一1000题",subj:"基础篇-高数",relPath:"1000题/基础篇/高数/第12章 一元函数积分学的应用（三）—物理应用",labels:["例12-1", "例12-2", "例12-3", "例12-4", "例12-5", "例12-6", "例12-7"]},
{id:"ch79",category:"shu1",number:79,name:"数一1000题 - 基础篇-高数 - 第13章 多元函数微分学",short:"第13章 多元函数微分学",total:24,cols:5,wb:"数一1000题",subj:"基础篇-高数",relPath:"1000题/基础篇/高数/第13章 多元函数微分学",labels:["例13-1", "例13-2", "例13-3", "例13-4", "例13-5", "例13-6", "例13-7", "例13-8", "例13-9", "例13-10", "例13-11", "例13-12", "例13-13", "例13-14", "例13-15", "例13-16", "例13-17", "例13-18", "例13-19", "例13-20", "例13-21", "例13-22", "例13-23", "例13-24"]},
{id:"ch80",category:"shu1",number:80,name:"数一1000题 - 基础篇-高数 - 第14章 二重积分",short:"第14章 二重积分",total:24,cols:5,wb:"数一1000题",subj:"基础篇-高数",relPath:"1000题/基础篇/高数/第14章 二重积分",labels:["例14-1", "例14-2", "例14-3", "例14-4", "例14-5", "例14-6", "例14-7", "例14-8", "例14-9", "例14-10", "例14-11", "例14-12", "例14-13", "例14-14", "例14-15", "例14-16", "例14-17", "例14-18", "例14-19", "例14-20", "例14-21", "例14-22", "例14-23", "例14-24"]},
{id:"ch81",category:"shu1",number:81,name:"数一1000题 - 基础篇-高数 - 第15章 微分方程",short:"第15章 微分方程",total:21,cols:5,wb:"数一1000题",subj:"基础篇-高数",relPath:"1000题/基础篇/高数/第15章 微分方程",labels:["例15-1", "例15-2", "例15-3", "例15-4", "例15-5", "例15-6", "例15-7", "例15-8", "例15-9", "例15-10", "例15-11", "例15-12", "例15-13", "例15-14", "例15-15", "例15-16", "例15-17", "例15-18", "例15-19", "例15-20", "例15-21"]},
{id:"ch82",category:"shu1",number:82,name:"数一1000题 - 基础篇-高数 - 第16章 无穷级数",short:"第16章 无穷级数",total:19,cols:5,wb:"数一1000题",subj:"基础篇-高数",relPath:"1000题/基础篇/高数/第16章 无穷级数",labels:["例16-1", "例16-2", "例16-3", "例16-4", "例16-5", "例16-6", "例16-7", "例16-8", "例16-9", "例16-10", "例16-11", "例16-12", "例16-13", "例16-14", "例16-15", "例16-16", "例16-17", "例16-18", "例16-19"]},
{id:"ch83",category:"shu1",number:83,name:"数一1000题 - 基础篇-高数 - 第17章 多元函数积分学的预备知识",short:"第17章 多元函数积分学的预备知识",total:14,cols:5,wb:"数一1000题",subj:"基础篇-高数",relPath:"1000题/基础篇/高数/第17章 多元函数积分学的预备知识",labels:["例17-1", "例17-2", "例17-3", "例17-4", "例17-5", "例17-6", "例17-7", "例17-8", "例17-9", "例17-10", "例17-11", "例17-12", "例17-13", "例17-14"]},
{id:"ch84",category:"shu1",number:84,name:"数一1000题 - 基础篇-高数 - 第18章 多元函数积分学",short:"第18章 多元函数积分学",total:16,cols:5,wb:"数一1000题",subj:"基础篇-高数",relPath:"1000题/基础篇/高数/第18章 多元函数积分学",labels:["例18-1", "例18-2", "例18-3", "例18-4", "例18-5", "例18-6", "例18-7", "例18-8", "例18-9", "例18-10", "例18-11", "例18-12", "例18-13", "例18-14", "例18-15", "例18-16"]},
{id:"ch85",category:"shu1",number:85,name:"数一1000题 - 基础篇-高数 - 零基础",short:"零基础",total:16,cols:5,wb:"数一1000题",subj:"基础篇-高数",relPath:"1000题/基础篇/高数/零基础",labels:["例1-1", "例1-2", "例1-3", "例1-4", "例1-5", "例1-6", "例1-7", "例1-8", "例1-9", "例1-10", "例1-11", "例1-12", "例1-13", "例1-14", "例1-15", "例1-16"]},
{id:"ch86",category:"shu1",number:86,name:"数一1000题 - 强化篇-高数 - 第1章 函数极限与连续",short:"第1章 函数极限与连续",total:38,cols:5,wb:"数一1000题",subj:"强化篇-高数",relPath:"1000题/强化篇/高数/第1章 函数极限与连续",labels:["例1-1", "例1-2", "例1-3", "例1-4", "例1-5", "例1-6", "例1-7", "例1-8", "例1-9", "例1-10", "例1-11", "例1-12", "例1-13", "例1-14", "例1-15", "例1-16", "例1-17", "例1-18", "例1-19", "例1-20", "例1-21", "例1-22", "例1-23", "例1-24", "例1-25", "例1-26", "例1-27", "例1-28", "例1-29", "例1-30", "例1-31", "例1-32", "例1-33", "例1-34", "例1-35", "例1-36", "例1-37", "例1-38"]},
{id:"ch87",category:"shu1",number:87,name:"数一1000题 - 强化篇-高数 - 第2章 数列极限",short:"第2章 数列极限",total:11,cols:5,wb:"数一1000题",subj:"强化篇-高数",relPath:"1000题/强化篇/高数/第2章 数列极限",labels:["例2-1", "例2-2", "例2-3", "例2-4", "例2-5", "例2-6", "例2-7", "例2-8", "例2-9", "例2-10", "例2-11"]},
{id:"ch88",category:"shu1",number:88,name:"数一1000题 - 强化篇-高数 - 第3章 一元函数微分学的概念",short:"第3章 一元函数微分学的概念",total:22,cols:5,wb:"数一1000题",subj:"强化篇-高数",relPath:"1000题/强化篇/高数/第3章 一元函数微分学的概念",labels:["例3-1", "例3-2", "例3-3", "例3-4", "例3-5", "例3-6", "例3-7", "例3-8", "例3-9", "例3-10", "例3-11", "例3-12", "例3-13", "例3-14", "例3-15", "例3-16", "例3-17", "例3-18", "例3-19", "例3-20", "例3-21", "例3-22"]},
{id:"ch89",category:"shu1",number:89,name:"数一1000题 - 强化篇-高数 - 第4章 一元函数微分学的计算",short:"第4章 一元函数微分学的计算",total:16,cols:5,wb:"数一1000题",subj:"强化篇-高数",relPath:"1000题/强化篇/高数/第4章 一元函数微分学的计算",labels:["例4-1", "例4-2", "例4-3", "例4-4", "例4-5", "例4-6", "例4-7", "例4-8", "例4-9", "例4-10", "例4-11", "例4-12", "例4-13", "例4-14", "例4-15", "例4-16"]},
{id:"ch90",category:"shu1",number:90,name:"数一1000题 - 强化篇-高数 - 第5章 一元函数微分学的应用—几何应用",short:"第5章 一元函数微分学的应用—几何应用",total:33,cols:5,wb:"数一1000题",subj:"强化篇-高数",relPath:"1000题/强化篇/高数/第5章 一元函数微分学的应用—几何应用",labels:["例5-1", "例5-2", "例5-3", "例5-4", "例5-5", "例5-6", "例5-7", "例5-8", "例5-9", "例5-10", "例5-11", "例5-12", "例5-13", "例5-14", "例5-15", "例5-16", "例5-17", "例5-18", "例5-19", "例5-20", "例5-21", "例5-22", "例5-23", "例5-24", "例5-25", "例5-26", "例5-27", "例5-28", "例5-29", "例5-30", "例5-31", "例5-32", "例5-33"]},
{id:"ch91",category:"shu1",number:91,name:"数一1000题 - 强化篇-高数 - 第6章 一元函数为分析的应用—中值定理等",short:"第6章 一元函数为分析的应用—中值定理等",total:21,cols:5,wb:"数一1000题",subj:"强化篇-高数",relPath:"1000题/强化篇/高数/第6章 一元函数为分析的应用—中值定理等",labels:["例6-1", "例6-2", "例6-3", "例6-4", "例6-5", "例6-6", "例6-7", "例6-8", "例6-9", "例6-10", "例6-11", "例6-12", "例6-13", "例6-14", "例6-15", "例6-16", "例6-17", "例6-18", "例6-19", "例6-20", "例6-21"]},
{id:"ch92",category:"shu1",number:92,name:"数一1000题 - 强化篇-高数 - 第7章 一元函数微分学的应用—物理应用",short:"第7章 一元函数微分学的应用—物理应用",total:3,cols:5,wb:"数一1000题",subj:"强化篇-高数",relPath:"1000题/强化篇/高数/第7章 一元函数微分学的应用—物理应用",labels:["例7-1", "例7-2", "例7-3"]},
{id:"ch93",category:"shu1",number:93,name:"数一1000题 - 强化篇-高数 - 第8章 一元函数积分学的概念与性质",short:"第8章 一元函数积分学的概念与性质",total:19,cols:5,wb:"数一1000题",subj:"强化篇-高数",relPath:"1000题/强化篇/高数/第8章 一元函数积分学的概念与性质",labels:["例8-1", "例8-2", "例8-3", "例8-4", "例8-5", "例8-6", "例8-7", "例8-8", "例8-9", "例8-10", "例8-11", "例8-12", "例8-13", "例8-14", "例8-15", "例8-16", "例8-17", "例8-18", "例8-19"]},
{id:"ch94",category:"shu1",number:94,name:"数一1000题 - 强化篇-高数 - 第9章 一元函数积分学的计算",short:"第9章 一元函数积分学的计算",total:28,cols:5,wb:"数一1000题",subj:"强化篇-高数",relPath:"1000题/强化篇/高数/第9章 一元函数积分学的计算",labels:["例9-1", "例9-2", "例9-3", "例9-4", "例9-5", "例9-6", "例9-7", "例9-8", "例9-9", "例9-10", "例9-11", "例9-12", "例9-13", "例9-14", "例9-15", "例9-16", "例9-17", "例9-18", "例9-19", "例9-20", "例9-21", "例9-22", "例9-23", "例9-24", "例9-25", "例9-26", "例9-27", "例9-28"]},
{id:"ch95",category:"shu1",number:95,name:"数一1000题 - 强化篇-高数 - 第10章 一元函数积分学的应用—几何应用",short:"第10章 一元函数积分学的应用—几何应用",total:26,cols:5,wb:"数一1000题",subj:"强化篇-高数",relPath:"1000题/强化篇/高数/第10章 一元函数积分学的应用—几何应用",labels:["例10-1", "例10-2", "例10-3", "例10-4", "例10-5", "例10-6", "例10-7", "例10-8", "例10-9", "例10-10", "例10-11", "例10-12", "例10-13", "例10-14", "例10-15", "例10-16", "例10-17", "例10-18", "例10-19", "例10-20", "例10-21", "例10-22", "例10-23", "例10-24", "例10-25", "例10-26"]},
{id:"ch96",category:"shu1",number:96,name:"数一1000题 - 强化篇-高数 - 第11章 一元函数积分学的应用—积分等式与积分不等式",short:"第11章 一元函数积分学的应用—积分等式与积分不等式",total:9,cols:5,wb:"数一1000题",subj:"强化篇-高数",relPath:"1000题/强化篇/高数/第11章 一元函数积分学的应用—积分等式与积分不等式",labels:["例11-1", "例11-2", "例11-3", "例11-4", "例11-5", "例11-6", "例11-7", "例11-8", "例11-9"]},
{id:"ch97",category:"shu1",number:97,name:"数一1000题 - 强化篇-高数 - 第12章 一元函数积分学的应用—物理应用",short:"第12章 一元函数积分学的应用—物理应用",total:5,cols:5,wb:"数一1000题",subj:"强化篇-高数",relPath:"1000题/强化篇/高数/第12章 一元函数积分学的应用—物理应用",labels:["例12-1", "例12-2", "例12-3", "例12-4", "例12-5"]},
{id:"ch98",category:"shu1",number:98,name:"数一1000题 - 强化篇-高数 - 第13章 多元函数微分学",short:"第13章 多元函数微分学",total:40,cols:5,wb:"数一1000题",subj:"强化篇-高数",relPath:"1000题/强化篇/高数/第13章 多元函数微分学",labels:["例13-1", "例13-2", "例13-3", "例13-4", "例13-5", "例13-6", "例13-7", "例13-8", "例13-9", "例13-10", "例13-11", "例13-12", "例13-13", "例13-14", "例13-15", "例13-16", "例13-17", "例13-18", "例13-19", "例13-20", "例13-21", "例13-22", "例13-23", "例13-24", "例13-25", "例13-26", "例13-27", "例13-28", "例13-29", "例13-30", "例13-31", "例13-32", "例13-33", "例13-34", "例13-35", "例13-36", "例13-37", "例13-38", "例13-39", "例13-40"]},
{id:"ch99",category:"shu1",number:99,name:"数一1000题 - 强化篇-高数 - 第14章 二重积分",short:"第14章 二重积分",total:41,cols:5,wb:"数一1000题",subj:"强化篇-高数",relPath:"1000题/强化篇/高数/第14章 二重积分",labels:["例14-1", "例14-2", "例14-3", "例14-4", "例14-5", "例14-6", "例14-7", "例14-8", "例14-9", "例14-10", "例14-11", "例14-12", "例14-13", "例14-14", "例14-15", "例14-16", "例14-17", "例14-18", "例14-19", "例14-20", "例14-21", "例14-22", "例14-23", "例14-24", "例14-25", "例14-26", "例14-27", "例14-28", "例14-29", "例14-30", "例14-31", "例14-32", "例14-33", "例14-34", "例14-35", "例14-36", "例14-37", "例14-38", "例14-39", "例14-40", "例14-41"]},
{id:"ch100",category:"shu1",number:100,name:"数一1000题 - 强化篇-高数 - 第15章 微分方程",short:"第15章 微分方程",total:40,cols:5,wb:"数一1000题",subj:"强化篇-高数",relPath:"1000题/强化篇/高数/第15章 微分方程",labels:["例15-1", "例15-2", "例15-3", "例15-4", "例15-5", "例15-6", "例15-7", "例15-8", "例15-9", "例15-10", "例15-11", "例15-12", "例15-13", "例15-14", "例15-15", "例15-16", "例15-17", "例15-18", "例15-19", "例15-20", "例15-21", "例15-22", "例15-23", "例15-24", "例15-25", "例15-26", "例15-27", "例15-28", "例15-29", "例15-30", "例15-31", "例15-32", "例15-33", "例15-34", "例15-35", "例15-36", "例15-37", "例15-38", "例15-39", "例15-40"]},
{id:"ch101",category:"shu1",number:101,name:"数一1000题 - 强化篇-高数 - 第16章 无穷级数",short:"第16章 无穷级数",total:40,cols:5,wb:"数一1000题",subj:"强化篇-高数",relPath:"1000题/强化篇/高数/第16章 无穷级数",labels:["例16-1", "例16-2", "例16-3", "例16-4", "例16-5", "例16-6", "例16-7", "例16-8", "例16-9", "例16-10", "例16-11", "例16-12", "例16-13", "例16-14", "例16-15", "例16-16", "例16-17", "例16-18", "例16-19", "例16-20", "例16-21", "例16-22", "例16-23", "例16-24", "例16-25", "例16-26", "例16-27", "例16-28", "例16-29", "例16-30", "例16-31", "例16-32", "例16-33", "例16-34", "例16-35", "例16-36", "例16-37", "例16-38", "例16-39", "例16-40"]},
{id:"ch102",category:"shu1",number:102,name:"数一1000题 - 强化篇-高数 - 第17章 多元函数积分学的预备知识",short:"第17章 多元函数积分学的预备知识",total:15,cols:5,wb:"数一1000题",subj:"强化篇-高数",relPath:"1000题/强化篇/高数/第17章 多元函数积分学的预备知识",labels:["例17-1", "例17-2", "例17-3", "例17-4", "例17-5", "例17-6", "例17-7", "例17-8", "例17-9", "例17-10", "例17-11", "例17-12", "例17-13", "例17-14", "例17-15"]},
{id:"ch103",category:"shu1",number:103,name:"数一1000题 - 强化篇-高数 - 第18章 多元函数积分学",short:"第18章 多元函数积分学",total:29,cols:5,wb:"数一1000题",subj:"强化篇-高数",relPath:"1000题/强化篇/高数/第18章 多元函数积分学",labels:["例18-1", "例18-2", "例18-3", "例18-4", "例18-5", "例18-6", "例18-7", "例18-8", "例18-9", "例18-10", "例18-11", "例18-12", "例18-13", "例18-14", "例18-15", "例18-16", "例18-17", "例18-18", "例18-19", "例18-20", "例18-21", "例18-22", "例18-23", "例18-24", "例18-25", "例18-26", "例18-27", "例18-28", "例18-29"]},
{id:"ch104",category:"shu1",number:104,name:"数一1000题 - 基础篇-线代 - 第1章 行列式",short:"第1章 行列式",total:11,cols:5,wb:"数一1000题",subj:"基础篇-线代",relPath:"1000题/基础篇/线代/第1章 行列式",labels:["例1-1", "例1-2", "例1-3", "例1-4", "例1-5", "例1-6", "例1-7", "例1-8", "例1-9", "例1-10", "例1-11"]},
{id:"ch105",category:"shu1",number:105,name:"数一1000题 - 基础篇-线代 - 第2章 矩阵",short:"第2章 矩阵",total:19,cols:5,wb:"数一1000题",subj:"基础篇-线代",relPath:"1000题/基础篇/线代/第2章 矩阵",labels:["例2-1", "例2-2", "例2-3", "例2-4", "例2-5", "例2-6", "例2-7", "例2-8", "例2-9", "例2-10", "例2-11", "例2-12", "例2-13", "例2-14", "例2-15", "例2-16", "例2-17", "例2-18", "例2-19"]},
{id:"ch106",category:"shu1",number:106,name:"数一1000题 - 基础篇-线代 - 第3章 向量组",short:"第3章 向量组",total:15,cols:5,wb:"数一1000题",subj:"基础篇-线代",relPath:"1000题/基础篇/线代/第3章 向量组",labels:["例3-1", "例3-2", "例3-3", "例3-4", "例3-5", "例3-6", "例3-7", "例3-8", "例3-9", "例3-10", "例3-11", "例3-12", "例3-13", "例3-14", "例3-15"]},
{id:"ch107",category:"shu1",number:107,name:"数一1000题 - 基础篇-线代 - 第4章 线性方程组",short:"第4章 线性方程组",total:17,cols:5,wb:"数一1000题",subj:"基础篇-线代",relPath:"1000题/基础篇/线代/第4章 线性方程组",labels:["例4-1", "例4-2", "例4-3", "例4-4", "例4-5", "例4-6", "例4-7", "例4-8", "例4-9", "例4-10", "例4-11", "例4-12", "例4-13", "例4-14", "例4-15", "例4-16", "例4-17"]},
{id:"ch108",category:"shu1",number:108,name:"数一1000题 - 基础篇-线代 - 第5章 特征值与特征向量",short:"第5章 特征值与特征向量",total:23,cols:5,wb:"数一1000题",subj:"基础篇-线代",relPath:"1000题/基础篇/线代/第5章 特征值与特征向量",labels:["例5-1", "例5-2", "例5-3", "例5-4", "例5-5", "例5-6", "例5-7", "例5-8", "例5-9", "例5-10", "例5-11", "例5-12", "例5-13", "例5-14", "例5-15", "例5-16", "例5-17", "例5-18", "例5-19", "例5-20", "例5-21", "例5-22", "例5-23"]},
{id:"ch109",category:"shu1",number:109,name:"数一1000题 - 基础篇-线代 - 第6章 二次型",short:"第6章 二次型",total:22,cols:5,wb:"数一1000题",subj:"基础篇-线代",relPath:"1000题/基础篇/线代/第6章 二次型",labels:["例6-1", "例6-2", "例6-3", "例6-4", "例6-5", "例6-6", "例6-7", "例6-8", "例6-9", "例6-10", "例6-11", "例6-12", "例6-13", "例6-14", "例6-15", "例6-21", "例6-22", "例6-23", "例6-24", "例6-25", "例6-26", "例6-27"]},
{id:"ch110",category:"shu1",number:110,name:"数一1000题 - 强化篇-线代 - 第1章 行列式",short:"第1章 行列式",total:7,cols:5,wb:"数一1000题",subj:"强化篇-线代",relPath:"1000题/强化篇/线代/第1章 行列式",labels:["例1-1", "例1-2", "例1-3", "例1-4", "例1-5", "例1-6", "例1-7"]},
{id:"ch111",category:"shu1",number:111,name:"数一1000题 - 强化篇-线代 - 第2章 余子式和代数余子式的计算",short:"第2章 余子式和代数余子式的计算",total:4,cols:5,wb:"数一1000题",subj:"强化篇-线代",relPath:"1000题/强化篇/线代/第2章 余子式和代数余子式的计算",labels:["例2-1", "例2-2", "例2-3", "例2-4"]},
{id:"ch112",category:"shu1",number:112,name:"数一1000题 - 强化篇-线代 - 第3章 矩阵运算",short:"第3章 矩阵运算",total:10,cols:5,wb:"数一1000题",subj:"强化篇-线代",relPath:"1000题/强化篇/线代/第3章 矩阵运算",labels:["例3-1", "例3-2", "例3-3", "例3-4", "例3-5", "例3-6", "例3-7", "例3-8", "例3-9", "例3-10"]},
{id:"ch113",category:"shu1",number:113,name:"数一1000题 - 强化篇-线代 - 第4章 矩阵的秩",short:"第4章 矩阵的秩",total:8,cols:5,wb:"数一1000题",subj:"强化篇-线代",relPath:"1000题/强化篇/线代/第4章 矩阵的秩",labels:["例4-1", "例4-2", "例4-3", "例4-4", "例4-5", "例4-6", "例4-7", "例4-8"]},
{id:"ch114",category:"shu1",number:114,name:"数一1000题 - 强化篇-线代 - 第5章 线性方程组",short:"第5章 线性方程组",total:15,cols:5,wb:"数一1000题",subj:"强化篇-线代",relPath:"1000题/强化篇/线代/第5章 线性方程组",labels:["例5-1", "例5-2", "例5-3", "例5-4", "例5-5", "例5-6", "例5-7", "例5-8", "例5-9", "例5-10", "例5-11", "例5-12", "例5-13", "例5-14", "例5-15"]},
{id:"ch115",category:"shu1",number:115,name:"数一1000题 - 强化篇-线代 - 第6章 向量组",short:"第6章 向量组",total:11,cols:5,wb:"数一1000题",subj:"强化篇-线代",relPath:"1000题/强化篇/线代/第6章 向量组",labels:["例6-1", "例6-2", "例6-3", "例6-4", "例6-5", "例6-6", "例6-7", "例6-8", "例6-9", "例6-10", "例6-11"]},
{id:"ch116",category:"shu1",number:116,name:"数一1000题 - 强化篇-线代 - 第7章 特征值与特征向量",short:"第7章 特征值与特征向量",total:9,cols:5,wb:"数一1000题",subj:"强化篇-线代",relPath:"1000题/强化篇/线代/第7章 特征值与特征向量",labels:["例7-1", "例7-2", "例7-3", "例7-4", "例7-5", "例7-6", "例7-7", "例7-8", "例7-9"]},
{id:"ch117",category:"shu1",number:117,name:"数一1000题 - 强化篇-线代 - 第8章 相似理论",short:"第8章 相似理论",total:21,cols:5,wb:"数一1000题",subj:"强化篇-线代",relPath:"1000题/强化篇/线代/第8章 相似理论",labels:["例8-1", "例8-2", "例8-3", "例8-4", "例8-5", "例8-6", "例8-7", "例8-8", "例8-9", "例8-10", "例8-11", "例8-12", "例8-13", "例8-14", "例8-15", "例8-16", "例8-17", "例8-18", "例8-19", "例8-20", "例8-21"]},
{id:"ch118",category:"shu1",number:118,name:"数一1000题 - 强化篇-线代 - 第9章 二次型",short:"第9章 二次型",total:27,cols:5,wb:"数一1000题",subj:"强化篇-线代",relPath:"1000题/强化篇/线代/第9章 二次型",labels:["例9-1", "例9-2", "例9-3", "例9-4", "例9-5", "例9-6", "例9-7", "例9-8", "例9-9", "例9-10", "例9-11", "例9-12", "例9-13", "例9-14", "例9-15", "例9-16", "例9-17", "例9-18", "例9-19", "例9-20", "例9-21", "例9-22", "例9-23", "例9-24", "例9-25", "例9-26", "例9-27"]},
{id:"ch119",category:"shu1",number:119,name:"数一1000题 - 基础篇-概率论 - 第1章 随机事件与概率",short:"第1章 随机事件与概率",total:14,cols:5,wb:"数一1000题",subj:"基础篇-概率论",relPath:"1000题/基础篇/概率论/第1章 随机事件与概率",labels:["例1-1", "例1-2", "例1-3", "例1-4", "例1-5", "例1-6", "例1-7", "例1-8", "例1-9", "例1-10", "例1-11", "例1-12", "例1-13", "例1-14"]},
{id:"ch120",category:"shu1",number:120,name:"数一1000题 - 基础篇-概率论 - 第2章 一维随机变量及其分布",short:"第2章 一维随机变量及其分布",total:11,cols:5,wb:"数一1000题",subj:"基础篇-概率论",relPath:"1000题/基础篇/概率论/第2章 一维随机变量及其分布",labels:["例2-1", "例2-2", "例2-3", "例2-4", "例2-5", "例2-6", "例2-7", "例2-8", "例2-9", "例2-10", "例2-11"]},
{id:"ch121",category:"shu1",number:121,name:"数一1000题 - 基础篇-概率论 - 第3章 多维随机变量的数字特征",short:"第3章 多维随机变量的数字特征",total:14,cols:5,wb:"数一1000题",subj:"基础篇-概率论",relPath:"1000题/基础篇/概率论/第3章 多维随机变量的数字特征",labels:["例3-1", "例3-2", "例3-3", "例3-4", "例3-5", "例3-6", "例3-7", "例3-8", "例3-9", "例3-10", "例3-11", "例3-12", "例3-13", "例3-14"]},
{id:"ch122",category:"shu1",number:122,name:"数一1000题 - 基础篇-概率论 - 第4章 随机变量的数字特征",short:"第4章 随机变量的数字特征",total:21,cols:5,wb:"数一1000题",subj:"基础篇-概率论",relPath:"1000题/基础篇/概率论/第4章 随机变量的数字特征",labels:["例4-1", "例4-2", "例4-3", "例4-4", "例4-5", "例4-6", "例4-7", "例4-8", "例4-9", "例4-10", "例4-11", "例4-12", "例4-13", "例4-14", "例4-15", "例4-16", "例4-17", "例4-18", "例4-19", "例4-20", "例4-21"]},
{id:"ch123",category:"shu1",number:123,name:"数一1000题 - 基础篇-概率论 - 第5章 大数定律与中心极限定理",short:"第5章 大数定律与中心极限定理",total:8,cols:5,wb:"数一1000题",subj:"基础篇-概率论",relPath:"1000题/基础篇/概率论/第5章 大数定律与中心极限定理",labels:["例5-1", "例5-2", "例5-3", "例5-4", "例5-5", "例5-6", "例5-7", "例5-8"]},
{id:"ch124",category:"shu1",number:124,name:"数一1000题 - 基础篇-概率论 - 第6章 数理统计",short:"第6章 数理统计",total:24,cols:5,wb:"数一1000题",subj:"基础篇-概率论",relPath:"1000题/基础篇/概率论/第6章 数理统计",labels:["例6-1", "例6-2", "例6-3", "例6-4", "例6-5", "例6-6", "例6-7", "例6-8", "例6-9", "例6-10", "例6-11", "例6-12", "例6-13", "例6-14", "例6-15", "例6-16", "例6-17", "例6-18", "例6-19", "例6-20", "例6-21", "例6-22", "例6-23", "例6-24"]},
{id:"ch125",category:"shu1",number:125,name:"数一1000题 - 强化篇-概率论 - 第1章 随机事件和概率",short:"第1章 随机事件和概率",total:6,cols:5,wb:"数一1000题",subj:"强化篇-概率论",relPath:"1000题/强化篇/概率论/第1章 随机事件和概率",labels:["例1-1", "例1-2", "例1-3", "例1-4", "例1-5", "例1-6"]},
{id:"ch126",category:"shu1",number:126,name:"数一1000题 - 强化篇-概率论 - 第2章 一维随机变量及其分布",short:"第2章 一维随机变量及其分布",total:9,cols:5,wb:"数一1000题",subj:"强化篇-概率论",relPath:"1000题/强化篇/概率论/第2章 一维随机变量及其分布",labels:["例2-1", "例2-2", "例2-3", "例2-4", "例2-5", "例2-6", "例2-7", "例2-8", "例2-9"]},
{id:"ch127",category:"shu1",number:127,name:"数一1000题 - 强化篇-概率论 - 第3章 一维随机变量函数的分布",short:"第3章 一维随机变量函数的分布",total:7,cols:5,wb:"数一1000题",subj:"强化篇-概率论",relPath:"1000题/强化篇/概率论/第3章 一维随机变量函数的分布",labels:["例3-1", "例3-2", "例3-3", "例3-4", "例3-5", "例3-6", "例3-7"]},
{id:"ch128",category:"shu1",number:128,name:"数一1000题 - 强化篇-概率论 - 第4章 多维随机变量及其分布",short:"第4章 多维随机变量及其分布",total:7,cols:5,wb:"数一1000题",subj:"强化篇-概率论",relPath:"1000题/强化篇/概率论/第4章 多维随机变量及其分布",labels:["例4-1", "例4-2", "例4-3", "例4-4", "例4-5", "例4-6", "例4-7"]},
{id:"ch129",category:"shu1",number:129,name:"数一1000题 - 强化篇-概率论 - 第5章 多维随机变量函数的分布",short:"第5章 多维随机变量函数的分布",total:12,cols:5,wb:"数一1000题",subj:"强化篇-概率论",relPath:"1000题/强化篇/概率论/第5章 多维随机变量函数的分布",labels:["例5-1", "例5-2", "例5-3", "例5-4", "例5-5", "例5-6", "例5-7", "例5-8", "例5-9", "例5-10", "例5-11", "例5-12"]},
{id:"ch130",category:"shu1",number:130,name:"数一1000题 - 强化篇-概率论 - 第6章 数字特征",short:"第6章 数字特征",total:21,cols:5,wb:"数一1000题",subj:"强化篇-概率论",relPath:"1000题/强化篇/概率论/第6章 数字特征",labels:["例6-1", "例6-2", "例6-3", "例6-4", "例6-5", "例6-6", "例6-7", "例6-8", "例6-9", "例6-10", "例6-11", "例6-12", "例6-13", "例6-14", "例6-15", "例6-16", "例6-17", "例6-18", "例6-19", "例6-20", "例6-21"]},
{id:"ch131",category:"shu1",number:131,name:"数一1000题 - 强化篇-概率论 - 第7章 大数定律与中心极限定理",short:"第7章 大数定律与中心极限定理",total:4,cols:5,wb:"数一1000题",subj:"强化篇-概率论",relPath:"1000题/强化篇/概率论/第7章 大数定律与中心极限定理",labels:["例7-1", "例7-2", "例7-3", "例7-4"]},
{id:"ch132",category:"shu1",number:132,name:"数一1000题 - 强化篇-概率论 - 第8章 统计量及其分布",short:"第8章 统计量及其分布",total:12,cols:5,wb:"数一1000题",subj:"强化篇-概率论",relPath:"1000题/强化篇/概率论/第8章 统计量及其分布",labels:["例8-1", "例8-2", "例8-3", "例8-4", "例8-5", "例8-6", "例8-7", "例8-8", "例8-9", "例8-10", "例8-11", "例8-12"]},
{id:"ch133",category:"shu1",number:133,name:"数一1000题 - 强化篇-概率论 - 第9章 参数估计与假设检验",short:"第9章 参数估计与假设检验",total:30,cols:5,wb:"数一1000题",subj:"强化篇-概率论",relPath:"1000题/强化篇/概率论/第9章 参数估计与假设检验",labels:["例9-1", "例9-2", "例9-3", "例9-4", "例9-5", "例9-6", "例9-7", "例9-8", "例9-9", "例9-10", "例9-11", "例9-12", "例9-13", "例9-14", "例9-15", "例9-16", "例9-17", "例9-18", "例9-19", "例9-20", "例9-21", "例9-22", "例9-23", "例9-24", "例9-25", "例9-26", "例9-27", "例9-28", "例9-29", "例9-30"]},
{id:"ch134",category:"shu1",number:134,name:"李范全书 - 高数 - 第1章 极限、连续与求极限的方法",short:"第1章 极限、连续与求极限的方法",total:41,cols:5,wb:"李范全书",subj:"高数",relPath:"李范全书/高数/第1章 极限、连续与求极限的方法",labels:["例1-1", "例1-2", "例1-3", "例1-4", "例1-5", "例1-6", "例1-7", "例1-8", "例1-9", "例1-10", "例1-11", "例1-12", "例1-13", "例1-14", "例1-15", "例1-16", "例1-17", "例1-18", "例1-19", "例1-20", "例1-21", "例1-22", "例1-23", "例1-24", "例1-25", "例1-26", "例1-27", "例1-28", "例1-29", "例1-30", "例1-31", "例1-32", "例1-33", "例1-34", "例1-35", "例1-36", "例1-37", "例1-38", "例1-39", "例1-40", "例1-41"]},
{id:"ch135",category:"shu1",number:135,name:"李范全书 - 高数 - 第2章 一元函数的导数与微分概念及其计算",short:"第2章 一元函数的导数与微分概念及其计算",total:39,cols:5,wb:"李范全书",subj:"高数",relPath:"李范全书/高数/第2章 一元函数的导数与微分概念及其计算",labels:["例2-1", "例2-2", "例2-3", "例2-4", "例2-5", "例2-6", "例2-7", "例2-8", "例2-9", "例2-10", "例2-11", "例2-12", "例2-13", "例2-14", "例2-15", "例2-16", "例2-17", "例2-18", "例2-19", "例2-20", "例2-21", "例2-22", "例2-23", "例2-24", "例2-25", "例2-26", "例2-27", "例2-28", "例2-29", "例2-30", "例2-31", "例2-32", "例2-33", "例2-34", "例2-35", "例2-36", "例2-37", "例2-38", "例2-39"]},
{id:"ch136",category:"shu1",number:136,name:"李范全书 - 高数 - 第3章 一元函数积分概念、计算及应用",short:"第3章 一元函数积分概念、计算及应用",total:63,cols:5,wb:"李范全书",subj:"高数",relPath:"李范全书/高数/第3章 一元函数积分概念、计算及应用",labels:["例3-1", "例3-2", "例3-3", "例3-4", "例3-5", "例3-6", "例3-7", "例3-8", "例3-9", "例3-10", "例3-11", "例3-12", "例3-13", "例3-14", "例3-15", "例3-16", "例3-17", "例3-18", "例3-19", "例3-20", "例3-21", "例3-22", "例3-23", "例3-24", "例3-25", "例3-26", "例3-27", "例3-28", "例3-29", "例3-30", "例3-31", "例3-32", "例3-33", "例3-34", "例3-35", "例3-36", "例3-37", "例3-38", "例3-39", "例3-40", "例3-41", "例3-42", "例3-43", "例3-44", "例3-45", "例3-46", "例3-47", "例3-48", "例3-49", "例3-50", "例3-51", "例3-52", "例3-53", "例3-54", "例3-55", "例3-56", "例3-57", "例3-58", "例3-59", "例3-60", "例3-61", "例3-62", "例3-63"]},
{id:"ch137",category:"shu1",number:137,name:"李范全书 - 高数 - 第4章 微分中值定理及其应用",short:"第4章 微分中值定理及其应用",total:43,cols:5,wb:"李范全书",subj:"高数",relPath:"李范全书/高数/第4章 微分中值定理及其应用",labels:["例4-1", "例4-2", "例4-3", "例4-4", "例4-5", "例4-7", "例4-8", "例4-9", "例4-10", "例4-11", "例4-12", "例4-13", "例4-14", "例4-15", "例4-16", "例4-17", "例4-18", "例4-19", "例4-20", "例4-21", "例4-22", "例4-23", "例4-24", "例4-25", "例4-26", "例4-27", "例4-28", "例4-29", "例4-30", "例4-31", "例4-32", "例4-33", "例4-34", "例4-35", "例4-36", "例4-37", "例4-38", "例4-39", "例4-40", "例4-41", "例4-42", "例4-43", "例4-44"]},
{id:"ch138",category:"shu1",number:138,name:"李范全书 - 高数 - 第5章 一元函数的泰勒公式及其应用",short:"第5章 一元函数的泰勒公式及其应用",total:16,cols:5,wb:"李范全书",subj:"高数",relPath:"李范全书/高数/第5章 一元函数的泰勒公式及其应用",labels:["例5-1", "例5-2", "例5-3", "例5-4", "例5-5", "例5-6", "例5-7", "例5-8", "例5-9", "例5-10", "例5-11", "例5-12", "例5-13", "例5-14", "例5-15", "例5-16"]},
{id:"ch139",category:"shu1",number:139,name:"李范全书 - 高数 - 第6章 常微分方程",short:"第6章 常微分方程",total:24,cols:5,wb:"李范全书",subj:"高数",relPath:"李范全书/高数/第6章 常微分方程",labels:["例6-1", "例6-2", "例6-3", "例6-4", "例6-5", "例6-6", "例6-7", "例6-8", "例6-9", "例6-10", "例6-11", "例6-12", "例6-13", "例6-14", "例6-15", "例6-16", "例6-17", "例6-18", "例6-19", "例6-20", "例6-21", "例6-22", "例6-23", "例6-24"]},
{id:"ch140",category:"shu1",number:140,name:"李范全书 - 高数 - 第7章 向量代数和空间解析几何",short:"第7章 向量代数和空间解析几何",total:20,cols:5,wb:"李范全书",subj:"高数",relPath:"李范全书/高数/第7章 向量代数和空间解析几何",labels:["例7-1", "例7-2", "例7-3", "例7-4", "例7-5", "例7-6", "例7-7", "例7-8", "例7-9", "例7-10", "例7-11", "例7-12", "例7-13", "例7-14", "例7-15", "例7-16", "例7-17", "例7-18", "例7-19", "例7-20"]},
{id:"ch141",category:"shu1",number:141,name:"李范全书 - 高数 - 第8章 多元函数微分学",short:"第8章 多元函数微分学",total:32,cols:5,wb:"李范全书",subj:"高数",relPath:"李范全书/高数/第8章 多元函数微分学",labels:["例8-1", "例8-2", "例8-3", "例8-4", "例8-5", "例8-6", "例8-7", "例8-8", "例8-9", "例8-10", "例8-11", "例8-12", "例8-13", "例8-14", "例8-15", "例8-16", "例8-17", "例8-18", "例8-19", "例8-20", "例8-21", "例8-22", "例8-23", "例8-24", "例8-25", "例8-26", "例8-27", "例8-28", "例8-29", "例8-30", "例8-31", "例8-32"]},
{id:"ch142",category:"shu1",number:142,name:"李范全书 - 高数 - 第9章 多元函数积分的概念、计算及其应用",short:"第9章 多元函数积分的概念、计算及其应用",total:70,cols:5,wb:"李范全书",subj:"高数",relPath:"李范全书/高数/第9章 多元函数积分的概念、计算及其应用",labels:["例9-1", "例9-2", "例9-3", "例9-4", "例9-5", "例9-6", "例9-7", "例9-8", "例9-9", "例9-10", "例9-11", "例9-12", "例9-13", "例9-14", "例9-15", "例9-16", "例9-17", "例9-18", "例9-19", "例9-20", "例9-21", "例9-22", "例9-23", "例9-24", "例9-25", "例9-26", "例9-27", "例9-28", "例9-29", "例9-30", "例9-31", "例9-32", "例9-33", "例9-34", "例9-35", "例9-36", "例9-37", "例9-38", "例9-39", "例9-40", "例9-41", "例9-42", "例9-43", "例9-44", "例9-45", "例9-46", "例9-47", "例9-48", "例9-49", "例9-50", "例9-51", "例9-52", "例9-53", "例9-54", "例9-55", "例9-56", "例9-57", "例9-58", "例9-59", "例9-60", "例9-61", "例9-62", "例9-63", "例9-64", "例9-65", "例9-66", "例9-67", "例9-68", "例9-69", "例9-70"]},
{id:"ch143",category:"shu1",number:143,name:"李范全书 - 高数 - 第10章 多元函数积分学中的基本公式及其应用",short:"第10章 多元函数积分学中的基本公式及其应用",total:25,cols:5,wb:"李范全书",subj:"高数",relPath:"李范全书/高数/第10章 多元函数积分学中的基本公式及其应用",labels:["例10-1", "例10-2", "例10-3", "例10-4", "例10-5", "例10-6", "例10-7", "例10-8", "例10-9", "例10-10", "例10-11", "例10-12", "例10-13", "例10-14", "例10-15", "例10-16", "例10-17", "例10-18", "例10-19", "例10-20", "例10-21", "例10-22", "例10-23", "例10-24", "例10-25"]},
{id:"ch144",category:"shu1",number:144,name:"李范全书 - 高数 - 第11章 无穷级数",short:"第11章 无穷级数",total:26,cols:5,wb:"李范全书",subj:"高数",relPath:"李范全书/高数/第11章 无穷级数",labels:["例11-1", "例11-2", "例11-3", "例11-4", "例11-5", "例11-6", "例11-7", "例11-8", "例11-9", "例11-10", "例11-11", "例11-12", "例11-13", "例11-14", "例11-15", "例11-16", "例11-17", "例11-18", "例11-19", "例11-20", "例11-21", "例11-22", "例11-23", "例11-24", "例11-25", "例11-26"]},
{id:"ch145",category:"shu1",number:145,name:"李范全书 - 线代 - 第1章 行列式",short:"第1章 行列式",total:22,cols:5,wb:"李范全书",subj:"线代",relPath:"李范全书/线代/第1章 行列式",labels:["例1-1", "例1-2", "例1-3", "例1-4", "例1-5", "例1-6", "例1-7", "例1-8", "例1-9", "例1-10", "例1-11", "例1-12", "例1-13", "例1-14", "例1-15", "例1-16", "例1-17", "例1-18", "例1-19", "例1-20", "例1-21", "例1-22"]},
{id:"ch146",category:"shu1",number:146,name:"李范全书 - 线代 - 第2章 矩阵",short:"第2章 矩阵",total:41,cols:5,wb:"李范全书",subj:"线代",relPath:"李范全书/线代/第2章 矩阵",labels:["例2-1", "例2-2", "例2-3", "例2-4", "例2-5", "例2-6", "例2-7", "例2-8", "例2-9", "例2-10", "例2-11", "例2-12", "例2-13", "例2-14", "例2-15", "例2-16", "例2-17", "例2-18", "例2-19", "例2-20", "例2-21", "例2-22", "例2-23", "例2-24", "例2-25", "例2-26", "例2-27", "例2-28", "例2-29", "例2-30", "例2-31", "例2-32", "例2-33", "例2-34", "例2-35", "例2-36", "例2-37", "例2-38", "例2-39", "例2-40", "例2-41"]},
{id:"ch147",category:"shu1",number:147,name:"李范全书 - 线代 - 第3章 向量组的线性关系与秩",short:"第3章 向量组的线性关系与秩",total:57,cols:5,wb:"李范全书",subj:"线代",relPath:"李范全书/线代/第3章 向量组的线性关系与秩",labels:["例3-1", "例3-2", "例3-3", "例3-4", "例3-5", "例3-6", "例3-7", "例3-8", "例3-9", "例3-10", "例3-11", "例3-12", "例3-13", "例3-14", "例3-15", "例3-16", "例3-17", "例3-18", "例3-19", "例3-20", "例3-21", "例3-22", "例3-23", "例3-24", "例3-25", "例3-26", "例3-27", "例3-28", "例3-29", "例3-30", "例3-31", "例3-32", "例3-33", "例3-34", "例3-35", "例3-36", "例3-37", "例3-38", "例3-39", "例3-40", "例3-41", "例3-42", "例3-43", "例3-44", "例3-45", "例3-46", "例3-47", "例3-48", "例3-49", "例3-50", "例3-51", "例3-52", "例3-53", "例3-54", "例3-55", "例3-56", "例3-57"]},
{id:"ch148",category:"shu1",number:148,name:"李范全书 - 线代 - 第4章 线性方程组",short:"第4章 线性方程组",total:38,cols:5,wb:"李范全书",subj:"线代",relPath:"李范全书/线代/第4章 线性方程组",labels:["例4-1", "例4-2", "例4-3", "例4-4", "例4-5", "例4-6", "例4-7", "例4-8", "例4-9", "例4-10", "例4-11", "例4-12", "例4-13", "例4-14", "例4-15", "例4-16", "例4-17", "例4-18", "例4-19", "例4-20", "例4-21", "例4-22", "例4-23", "例4-24", "例4-25", "例4-26", "例4-27", "例4-28", "例4-29", "例4-30", "例4-31", "例4-32", "例4-33", "例4-34", "例4-35", "例4-36", "例4-37", "例4-38"]},
{id:"ch149",category:"shu1",number:149,name:"李范全书 - 线代 - 第5章 特征向量与特征值，相似，对角化",short:"第5章 特征向量与特征值，相似，对角化",total:49,cols:5,wb:"李范全书",subj:"线代",relPath:"李范全书/线代/第5章 特征向量与特征值，相似，对角化",labels:["例5-1", "例5-2", "例5-3", "例5-4", "例5-5", "例5-6", "例5-7", "例5-8", "例5-9", "例5-10", "例5-11", "例5-12", "例5-13", "例5-14", "例5-15", "例5-16", "例5-17", "例5-18", "例5-19", "例5-20", "例5-21", "例5-22", "例5-23", "例5-24", "例5-25", "例5-26", "例5-27", "例5-28", "例5-29", "例5-30", "例5-31", "例5-32", "例5-33", "例5-34", "例5-35", "例5-36", "例5-37", "例5-38", "例5-39", "例5-40", "例5-41", "例5-42", "例5-43", "例5-44", "例5-45", "例5-46", "例5-47", "例5-48", "例5-49"]},
{id:"ch150",category:"shu1",number:150,name:"李范全书 - 线代 - 第6章 二次型",short:"第6章 二次型",total:31,cols:5,wb:"李范全书",subj:"线代",relPath:"李范全书/线代/第6章 二次型",labels:["例6-1", "例6-2", "例6-3", "例6-4", "例6-5", "例6-6", "例6-7", "例6-8", "例6-9", "例6-10", "例6-11", "例6-12", "例6-13", "例6-14", "例6-15", "例6-16", "例6-17", "例6-18", "例6-19", "例6-20", "例6-21", "例6-22", "例6-23", "例6-24", "例6-25", "例6-26", "例6-27", "例6-28", "例6-29", "例6-30", "例6-31"]},
{id:"ch151",category:"shu1",number:151,name:"李范全书 - 概率论 - 第1章 随机事件和概率",short:"第1章 随机事件和概率",total:27,cols:5,wb:"李范全书",subj:"概率论",relPath:"李范全书/概率论/第1章 随机事件和概率",labels:["例1-1", "例1-2", "例1-3", "例1-4", "例1-5", "例1-6", "例1-7", "例1-8", "例1-9", "例1-10", "例1-11", "例1-12", "例1-13", "例1-14", "例1-15", "例1-16", "例1-17", "例1-18", "例1-19", "例1-20", "例1-21", "例1-22", "例1-23", "例1-24", "例1-25", "例1-26", "例1-27"]},
{id:"ch152",category:"shu1",number:152,name:"李范全书 - 概率论 - 第2章 随机变量及其分布",short:"第2章 随机变量及其分布",total:34,cols:5,wb:"李范全书",subj:"概率论",relPath:"李范全书/概率论/第2章 随机变量及其分布",labels:["例2-1", "例2-2", "例2-3", "例2-4", "例2-5", "例2-6", "例2-7", "例2-8", "例2-9", "例2-10", "例2-11", "例2-12", "例2-13", "例2-14", "例2-15", "例2-16", "例2-17", "例2-18", "例2-19", "例2-20", "例2-21", "例2-22", "例2-23", "例2-24", "例2-25", "例2-26", "例2-27", "例2-28", "例2-29", "例2-30", "例2-31", "例2-32", "例2-33", "例2-34"]},
{id:"ch153",category:"shu1",number:153,name:"李范全书 - 概率论 - 第3章 多维随机变量及其分布",short:"第3章 多维随机变量及其分布",total:30,cols:5,wb:"李范全书",subj:"概率论",relPath:"李范全书/概率论/第3章 多维随机变量及其分布",labels:["例3-1", "例3-2", "例3-3", "例3-4", "例3-5", "例3-6", "例3-7", "例3-8", "例3-9", "例3-10", "例3-11", "例3-12", "例3-13", "例3-14", "例3-15", "例3-16", "例3-17", "例3-18", "例3-19", "例3-20", "例3-21", "例3-22", "例3-23", "例3-24", "例3-25", "例3-26", "例3-27", "例3-28", "例3-29", "例3-30"]},
{id:"ch154",category:"shu1",number:154,name:"李范全书 - 概率论 - 第4章 随机变量的数字特征",short:"第4章 随机变量的数字特征",total:28,cols:5,wb:"李范全书",subj:"概率论",relPath:"李范全书/概率论/第4章 随机变量的数字特征",labels:["例4-1", "例4-2", "例4-3", "例4-4", "例4-5", "例4-6", "例4-7", "例4-8", "例4-9", "例4-10", "例4-11", "例4-12", "例4-13", "例4-14", "例4-15", "例4-16", "例4-17", "例4-18", "例4-19", "例4-20", "例4-21", "例4-22", "例4-23", "例4-24", "例4-25", "例4-26", "例4-27", "例4-28"]},
{id:"ch155",category:"shu1",number:155,name:"李范全书 - 概率论 - 第5章 大数定律和中心极限定理",short:"第5章 大数定律和中心极限定理",total:13,cols:5,wb:"李范全书",subj:"概率论",relPath:"李范全书/概率论/第5章 大数定律和中心极限定理",labels:["例5-1", "例5-2", "例5-3", "例5-4", "例5-5", "例5-6", "例5-7", "例5-8", "例5-9", "例5-10", "例5-11", "例5-12", "例5-13"]},
{id:"ch156",category:"shu1",number:156,name:"李范全书 - 概率论 - 第6章 数理统计的基本概念",short:"第6章 数理统计的基本概念",total:17,cols:5,wb:"李范全书",subj:"概率论",relPath:"李范全书/概率论/第6章 数理统计的基本概念",labels:["例6-1", "例6-2", "例6-3", "例6-4", "例6-5", "例6-6", "例6-7", "例6-8", "例6-9", "例6-10", "例6-11", "例6-12", "例6-13", "例6-14", "例6-15", "例6-16", "例6-17"]},
{id:"ch157",category:"shu1",number:157,name:"李范全书 - 概率论 - 第7章 参数估计和假设检验",short:"第7章 参数估计和假设检验",total:20,cols:5,wb:"李范全书",subj:"概率论",relPath:"李范全书/概率论/第7章 参数估计和假设检验",labels:["例7-1", "例7-2", "例7-3", "例7-4", "例7-5", "例7-6", "例7-7", "例7-8", "例7-9", "例7-10", "例7-11", "例7-12", "例7-13", "例7-14", "例7-15", "例7-16", "例7-17", "例7-18", "例7-19", "例7-20"]},
{"id": "ch158", "category": "shu1", "number": 158, "name": "李林880 - 高数 - 第1章 函数、极限、连续", "short": "第1章 函数、极限、连续", "total": 58, "cols": 5, "wb": "李林880", "subj": "高数", "relPath": "李林880/高数/第1章 函数、极限、连续", "labels": ["习1-1", "习1-2", "习1-3", "习1-4", "习1-5", "习1-6", "习1-7", "习1-8", "习1-9", "习1-10", "习1-11", "习1-12", "习1-13", "习1-14", "习1-15", "习1-16", "习1-17", "习1-18", "习1-18(2)", "习1-19", "习1-20", "习1-21", "习1-22", "习1-23", "习1-24", "习1-25", "习1-26", "习1-27", "习1-28", "习1-28(2)", "习1-29", "习1-30", "习1-31", "习1-32", "习1-33", "习1-34", "习1-35", "习1-36", "习1-37", "习1-38", "习1-39", "习1-40", "习1-41", "习1-42", "习1-43", "习1-44", "习1-45", "习1-46", "习1-47", "习1-48", "习1-49", "习1-50", "习1-51", "习1-52", "习1-53", "习1-54", "习1-55", "习1-56"], "fileBases": ["pb_1-1", "pb_1-2", "pb_1-3", "pb_1-4", "pb_1-5", "pb_1-6", "pb_1-7", "pb_1-8", "pb_1-9", "pb_1-10", "pb_1-11", "pb_1-12", "pb_1-13", "pb_1-14", "pb_1-15", "pb_1-16", "pb_1-17", "pb_1-18", "pb_1-18_2", "pb_1-19", "pb_1-20", "pb_1-21", "pb_1-22", "pb_1-23", "pb_1-24", "pb_1-25", "pb_1-26", "pb_1-27", "pb_1-28", "pb_1-28_2", "pb_1-29", "pb_1-30", "pb_1-31", "pb_1-32", "pb_1-33", "pb_1-34", "pb_1-35", "pb_1-36", "pb_1-37", "pb_1-38", "pb_1-39", "pb_1-40", "pb_1-41", "pb_1-42", "pb_1-43", "pb_1-44", "pb_1-45", "pb_1-46", "pb_1-47", "pb_1-48", "pb_1-49", "pb_1-50", "pb_1-51", "pb_1-52", "pb_1-53", "pb_1-54", "pb_1-55", "pb_1-56"]},
{"id": "ch159", "category": "shu1", "number": 159, "name": "李林880 - 高数 - 第2章 一元函数微分学", "short": "第2章 一元函数微分学", "total": 114, "cols": 5, "wb": "李林880", "subj": "高数", "relPath": "李林880/高数/第2章 一元函数微分学", "labels": ["习2-1", "习2-2", "习2-3", "习2-4", "习2-5", "习2-6", "习2-7", "习2-8", "习2-9", "习2-10", "习2-11", "习2-12", "习2-13", "习2-14", "习2-15", "习2-16", "习2-17", "习2-18", "习2-19", "习2-19(2)", "习2-20", "习2-21", "习2-22", "习2-23", "习2-24", "习2-25", "习2-26", "习2-27", "习2-28", "习2-29", "习2-30", "习2-31", "习2-32", "习2-33", "习2-34", "习2-35", "习2-36", "习2-36(2)", "习2-37", "习2-38", "习2-39", "习2-40", "习2-41", "习2-42", "习2-43", "习2-44", "习2-45", "习2-46", "习2-47", "习2-48", "习2-49", "习2-50", "习2-51", "习2-52", "习2-52(2)", "习2-53", "习2-54", "习2-55", "习2-56", "习2-57", "习2-58", "习2-59", "习2-60", "习2-60(2)", "习2-61", "习2-62", "习2-63", "习2-64", "习2-65", "习2-66", "习2-67", "习2-68", "习2-68(2)", "习2-69", "习2-70", "习2-71", "习2-72", "习2-73", "习2-74", "习2-75", "习2-76", "习2-76(2)", "习2-77", "习2-78", "习2-79", "习2-80", "习2-81", "习2-82", "习2-83", "习2-84", "习2-85", "习2-86", "习2-87", "习2-88", "习2-89", "习2-90", "习2-91", "习2-92", "习2-93", "习2-94", "习2-95", "习2-96", "习2-97", "习2-98", "习2-99", "习2-100", "习2-101", "习2-102", "习2-102(2)", "习2-103", "习2-104", "习2-105", "习2-106", "习2-107"], "fileBases": ["pb_2-1", "pb_2-2", "pb_2-3", "pb_2-4", "pb_2-5", "pb_2-6", "pb_2-7", "pb_2-8", "pb_2-9", "pb_2-10", "pb_2-11", "pb_2-12", "pb_2-13", "pb_2-14", "pb_2-15", "pb_2-16", "pb_2-17", "pb_2-18", "pb_2-19", "pb_2-19_2", "pb_2-20", "pb_2-21", "pb_2-22", "pb_2-23", "pb_2-24", "pb_2-25", "pb_2-26", "pb_2-27", "pb_2-28", "pb_2-29", "pb_2-30", "pb_2-31", "pb_2-32", "pb_2-33", "pb_2-34", "pb_2-35", "pb_2-36", "pb_2-36_2", "pb_2-37", "pb_2-38", "pb_2-39", "pb_2-40", "pb_2-41", "pb_2-42", "pb_2-43", "pb_2-44", "pb_2-45", "pb_2-46", "pb_2-47", "pb_2-48", "pb_2-49", "pb_2-50", "pb_2-51", "pb_2-52", "pb_2-52_2", "pb_2-53", "pb_2-54", "pb_2-55", "pb_2-56", "pb_2-57", "pb_2-58", "pb_2-59", "pb_2-60", "pb_2-60_2", "pb_2-61", "pb_2-62", "pb_2-63", "pb_2-64", "pb_2-65", "pb_2-66", "pb_2-67", "pb_2-68", "pb_2-68_2", "pb_2-69", "pb_2-70", "pb_2-71", "pb_2-72", "pb_2-73", "pb_2-74", "pb_2-75", "pb_2-76", "pb_2-76_2", "pb_2-77", "pb_2-78", "pb_2-79", "pb_2-80", "pb_2-81", "pb_2-82", "pb_2-83", "pb_2-84", "pb_2-85", "pb_2-86", "pb_2-87", "pb_2-88", "pb_2-89", "pb_2-90", "pb_2-91", "pb_2-92", "pb_2-93", "pb_2-94", "pb_2-95", "pb_2-96", "pb_2-97", "pb_2-98", "pb_2-99", "pb_2-100", "pb_2-101", "pb_2-102", "pb_2-102_2", "pb_2-103", "pb_2-104", "pb_2-105", "pb_2-106", "pb_2-107"]},
{"id": "ch160", "category": "shu1", "number": 160, "name": "李林880 - 高数 - 第3章 一元函数积分学", "short": "第3章 一元函数积分学", "total": 135, "cols": 5, "wb": "李林880", "subj": "高数", "relPath": "李林880/高数/第3章 一元函数积分学", "labels": ["习3-1", "习3-2", "习3-3", "习3-4", "习3-5", "习3-6", "习3-7", "习3-8", "习3-8(2)", "习3-9", "习3-10", "习3-11", "习3-12", "习3-13", "习3-14", "习3-15", "习3-16", "习3-17", "习3-18", "习3-19", "习3-20", "习3-21", "习3-22", "习3-23", "习3-24", "习3-25", "习3-26", "习3-27", "习3-28", "习3-29", "习3-30", "习3-31", "习3-32", "习3-32(2)", "习3-33", "习3-34", "习3-35", "习3-36", "习3-37", "习3-38", "习3-39", "习3-40", "习3-40(2)", "习3-41", "习3-42", "习3-43", "习3-44", "习3-45", "习3-46", "习3-47", "习3-48", "习3-49", "习3-50", "习3-51", "习3-52", "习3-53", "习3-53(2)", "习3-54", "习3-55", "习3-56", "习3-57", "习3-58", "习3-59", "习3-60", "习3-61", "习3-62", "习3-63", "习3-63(2)", "习3-64", "习3-65", "习3-66", "习3-67", "习3-68", "习3-69", "习3-70", "习3-71", "习3-72", "习3-73", "习3-74", "习3-75", "习3-76", "习3-77", "习3-78", "习3-79", "习3-80", "习3-80(2)", "习3-81", "习3-82", "习3-83", "习3-84", "习3-85", "习3-86", "习3-87", "习3-88", "习3-89", "习3-90", "习3-91", "习3-92", "习3-93", "习3-94", "习3-95", "习3-96", "习3-96(2)", "习3-97", "习3-98", "习3-99", "习3-100", "习3-101", "习3-102", "习3-103", "习3-104", "习3-105", "习3-106", "习3-107", "习3-108", "习3-109", "习3-110", "习3-111", "习3-112", "习3-113", "习3-114", "习3-115", "习3-116", "习3-117", "习3-118", "习3-119", "习3-120", "习3-121", "习3-121(2)", "习3-122", "习3-123", "习3-124", "习3-125", "习3-126", "习3-127"], "fileBases": ["pb_3-1", "pb_3-2", "pb_3-3", "pb_3-4", "pb_3-5", "pb_3-6", "pb_3-7", "pb_3-8", "pb_3-8_2", "pb_3-9", "pb_3-10", "pb_3-11", "pb_3-12", "pb_3-13", "pb_3-14", "pb_3-15", "pb_3-16", "pb_3-17", "pb_3-18", "pb_3-19", "pb_3-20", "pb_3-21", "pb_3-22", "pb_3-23", "pb_3-24", "pb_3-25", "pb_3-26", "pb_3-27", "pb_3-28", "pb_3-29", "pb_3-30", "pb_3-31", "pb_3-32", "pb_3-32_2", "pb_3-33", "pb_3-34", "pb_3-35", "pb_3-36", "pb_3-37", "pb_3-38", "pb_3-39", "pb_3-40", "pb_3-40_2", "pb_3-41", "pb_3-42", "pb_3-43", "pb_3-44", "pb_3-45", "pb_3-46", "pb_3-47", "pb_3-48", "pb_3-49", "pb_3-50", "pb_3-51", "pb_3-52", "pb_3-53", "pb_3-53_2", "pb_3-54", "pb_3-55", "pb_3-56", "pb_3-57", "pb_3-58", "pb_3-59", "pb_3-60", "pb_3-61", "pb_3-62", "pb_3-63", "pb_3-63_2", "pb_3-64", "pb_3-65", "pb_3-66", "pb_3-67", "pb_3-68", "pb_3-69", "pb_3-70", "pb_3-71", "pb_3-72", "pb_3-73", "pb_3-74", "pb_3-75", "pb_3-76", "pb_3-77", "pb_3-78", "pb_3-79", "pb_3-80", "pb_3-80_2", "pb_3-81", "pb_3-82", "pb_3-83", "pb_3-84", "pb_3-85", "pb_3-86", "pb_3-87", "pb_3-88", "pb_3-89", "pb_3-90", "pb_3-91", "pb_3-92", "pb_3-93", "pb_3-94", "pb_3-95", "pb_3-96", "pb_3-96_2", "pb_3-97", "pb_3-98", "pb_3-99", "pb_3-100", "pb_3-101", "pb_3-102", "pb_3-103", "pb_3-104", "pb_3-105", "pb_3-106", "pb_3-107", "pb_3-108", "pb_3-109", "pb_3-110", "pb_3-111", "pb_3-112", "pb_3-113", "pb_3-114", "pb_3-115", "pb_3-116", "pb_3-117", "pb_3-118", "pb_3-119", "pb_3-120", "pb_3-121", "pb_3-121_2", "pb_3-122", "pb_3-123", "pb_3-124", "pb_3-125", "pb_3-126", "pb_3-127"]},
{"id": "ch161", "category": "shu1", "number": 161, "name": "李林880 - 高数 - 第4章 空间解析几何", "short": "第4章 空间解析几何", "total": 25, "cols": 5, "wb": "李林880", "subj": "高数", "relPath": "李林880/高数/第4章 空间解析几何", "labels": ["习4-1", "习4-2", "习4-3", "习4-4", "习4-5", "习4-6", "习4-7", "习4-8", "习4-9", "习4-10", "习4-11", "习4-12", "习4-13", "习4-14", "习4-15", "习4-15(2)", "习4-16", "习4-17", "习4-18", "习4-19", "习4-20", "习4-21", "习4-22", "习4-23", "习4-24"], "fileBases": ["pb_4-1", "pb_4-2", "pb_4-3", "pb_4-4", "pb_4-5", "pb_4-6", "pb_4-7", "pb_4-8", "pb_4-9", "pb_4-10", "pb_4-11", "pb_4-12", "pb_4-13", "pb_4-14", "pb_4-15", "pb_4-15_2", "pb_4-16", "pb_4-17", "pb_4-18", "pb_4-19", "pb_4-20", "pb_4-21", "pb_4-22", "pb_4-23", "pb_4-24"]},
{"id": "ch162", "category": "shu1", "number": 162, "name": "李林880 - 高数 - 第5章 多元函数微分学", "short": "第5章 多元函数微分学", "total": 68, "cols": 5, "wb": "李林880", "subj": "高数", "relPath": "李林880/高数/第5章 多元函数微分学", "labels": ["习5-1", "习5-2", "习5-3", "习5-4", "习5-5", "习5-6", "习5-7", "习5-8", "习5-9", "习5-10", "习5-11", "习5-12", "习5-13", "习5-14", "习5-15", "习5-16", "习5-17", "习5-18", "习5-19", "习5-20", "习5-21", "习5-22", "习5-23", "习5-24", "习5-25", "习5-26", "习5-27", "习5-28", "习5-29", "习5-30", "习5-31", "习5-32", "习5-33", "习5-34", "习5-35", "习5-36", "习5-37", "习5-38", "习5-39", "习5-39(2)", "习5-40", "习5-41", "习5-42", "习5-43", "习5-44", "习5-45", "习5-46", "习5-47", "习5-48", "习5-49", "习5-50", "习5-51", "习5-52", "习5-53", "习5-54", "习5-55", "习5-56", "习5-57", "习5-58", "习5-59", "习5-60", "习5-61", "习5-62", "习5-63", "习5-64", "习5-65", "习5-66", "习5-67"], "fileBases": ["pb_5-1", "pb_5-2", "pb_5-3", "pb_5-4", "pb_5-5", "pb_5-6", "pb_5-7", "pb_5-8", "pb_5-9", "pb_5-10", "pb_5-11", "pb_5-12", "pb_5-13", "pb_5-14", "pb_5-15", "pb_5-16", "pb_5-17", "pb_5-18", "pb_5-19", "pb_5-20", "pb_5-21", "pb_5-22", "pb_5-23", "pb_5-24", "pb_5-25", "pb_5-26", "pb_5-27", "pb_5-28", "pb_5-29", "pb_5-30", "pb_5-31", "pb_5-32", "pb_5-33", "pb_5-34", "pb_5-35", "pb_5-36", "pb_5-37", "pb_5-38", "pb_5-39", "pb_5-39_2", "pb_5-40", "pb_5-41", "pb_5-42", "pb_5-43", "pb_5-44", "pb_5-45", "pb_5-46", "pb_5-47", "pb_5-48", "pb_5-49", "pb_5-50", "pb_5-51", "pb_5-52", "pb_5-53", "pb_5-54", "pb_5-55", "pb_5-56", "pb_5-57", "pb_5-58", "pb_5-59", "pb_5-60", "pb_5-61", "pb_5-62", "pb_5-63", "pb_5-64", "pb_5-65", "pb_5-66", "pb_5-67"]},
{"id": "ch163", "category": "shu1", "number": 163, "name": "李林880 - 高数 - 第6章 重积分", "short": "第6章 重积分", "total": 82, "cols": 5, "wb": "李林880", "subj": "高数", "relPath": "李林880/高数/第6章 重积分", "labels": ["习6-1", "习6-2", "习6-3", "习6-4", "习6-5", "习6-6", "习6-7", "习6-8", "习6-9", "习6-10", "习6-11", "习6-12", "习6-13", "习6-14", "习6-15", "习6-16", "习6-17", "习6-18", "习6-19", "习6-20", "习6-21", "习6-21(2)", "习6-22", "习6-23", "习6-24", "习6-25", "习6-26", "习6-27", "习6-28", "习6-29", "习6-30", "习6-31", "习6-32", "习6-33", "习6-34", "习6-35", "习6-36", "习6-37", "习6-37(2)", "习6-38", "习6-39", "习6-40", "习6-41", "习6-42", "习6-43", "习6-44", "习6-45", "习6-46", "习6-46(2)", "习6-47", "习6-48", "习6-49", "习6-50", "习6-51", "习6-52", "习6-53", "习6-54", "习6-55", "习6-56", "习6-57", "习6-58", "习6-59", "习6-60", "习6-61", "习6-62", "习6-63", "习6-64", "习6-65", "习6-66", "习6-67", "习6-68", "习6-69", "习6-70", "习6-71", "习6-72", "习6-73", "习6-74", "习6-75", "习6-76", "习6-76(2)", "习6-77", "习6-78"], "fileBases": ["pb_6-1", "pb_6-2", "pb_6-3", "pb_6-4", "pb_6-5", "pb_6-6", "pb_6-7", "pb_6-8", "pb_6-9", "pb_6-10", "pb_6-11", "pb_6-12", "pb_6-13", "pb_6-14", "pb_6-15", "pb_6-16", "pb_6-17", "pb_6-18", "pb_6-19", "pb_6-20", "pb_6-21", "pb_6-21_2", "pb_6-22", "pb_6-23", "pb_6-24", "pb_6-25", "pb_6-26", "pb_6-27", "pb_6-28", "pb_6-29", "pb_6-30", "pb_6-31", "pb_6-32", "pb_6-33", "pb_6-34", "pb_6-35", "pb_6-36", "pb_6-37", "pb_6-37_2", "pb_6-38", "pb_6-39", "pb_6-40", "pb_6-41", "pb_6-42", "pb_6-43", "pb_6-44", "pb_6-45", "pb_6-46", "pb_6-46_2", "pb_6-47", "pb_6-48", "pb_6-49", "pb_6-50", "pb_6-51", "pb_6-52", "pb_6-53", "pb_6-54", "pb_6-55", "pb_6-56", "pb_6-57", "pb_6-58", "pb_6-59", "pb_6-60", "pb_6-61", "pb_6-62", "pb_6-63", "pb_6-64", "pb_6-65", "pb_6-66", "pb_6-67", "pb_6-68", "pb_6-69", "pb_6-70", "pb_6-71", "pb_6-72", "pb_6-73", "pb_6-74", "pb_6-75", "pb_6-76", "pb_6-76_2", "pb_6-77", "pb_6-78"]},
{"id": "ch164", "category": "shu1", "number": 164, "name": "李林880 - 高数 - 第7章 微分方程", "short": "第7章 微分方程", "total": 66, "cols": 5, "wb": "李林880", "subj": "高数", "relPath": "李林880/高数/第7章 微分方程", "labels": ["习7-1", "习7-2", "习7-3", "习7-4", "习7-5", "习7-6", "习7-7", "习7-8", "习7-9", "习7-10", "习7-11", "习7-12", "习7-13", "习7-14", "习7-15", "习7-16", "习7-17", "习7-18", "习7-19", "习7-20", "习7-21", "习7-22", "习7-23", "习7-24", "习7-25", "习7-26", "习7-27", "习7-28", "习7-29", "习7-30", "习7-30(2)", "习7-31", "习7-32", "习7-33", "习7-34", "习7-35", "习7-36", "习7-37", "习7-38", "习7-39", "习7-40", "习7-41", "习7-42", "习7-43", "习7-44", "习7-45", "习7-46", "习7-47", "习7-48", "习7-49", "习7-50", "习7-51", "习7-52", "习7-53", "习7-54", "习7-55", "习7-56", "习7-57", "习7-58", "习7-59", "习7-60", "习7-61", "习7-62", "习7-63", "习7-64", "习7-65"], "fileBases": ["pb_7-1", "pb_7-2", "pb_7-3", "pb_7-4", "pb_7-5", "pb_7-6", "pb_7-7", "pb_7-8", "pb_7-9", "pb_7-10", "pb_7-11", "pb_7-12", "pb_7-13", "pb_7-14", "pb_7-15", "pb_7-16", "pb_7-17", "pb_7-18", "pb_7-19", "pb_7-20", "pb_7-21", "pb_7-22", "pb_7-23", "pb_7-24", "pb_7-25", "pb_7-26", "pb_7-27", "pb_7-28", "pb_7-29", "pb_7-30", "pb_7-30_2", "pb_7-31", "pb_7-32", "pb_7-33", "pb_7-34", "pb_7-35", "pb_7-36", "pb_7-37", "pb_7-38", "pb_7-39", "pb_7-40", "pb_7-41", "pb_7-42", "pb_7-43", "pb_7-44", "pb_7-45", "pb_7-46", "pb_7-47", "pb_7-48", "pb_7-49", "pb_7-50", "pb_7-51", "pb_7-52", "pb_7-53", "pb_7-54", "pb_7-55", "pb_7-56", "pb_7-57", "pb_7-58", "pb_7-59", "pb_7-60", "pb_7-61", "pb_7-62", "pb_7-63", "pb_7-64", "pb_7-65"]},
{"id": "ch165", "category": "shu1", "number": 165, "name": "李林880 - 高数 - 第8章 无穷级数", "short": "第8章 无穷级数", "total": 71, "cols": 5, "wb": "李林880", "subj": "高数", "relPath": "李林880/高数/第8章 无穷级数", "labels": ["习8-1", "习8-2", "习8-3", "习8-4", "习8-5", "习8-6", "习8-6(2)", "习8-7", "习8-8", "习8-9", "习8-10", "习8-11", "习8-12", "习8-13", "习8-14", "习8-15", "习8-16", "习8-17", "习8-17(2)", "习8-18", "习8-19", "习8-20", "习8-21", "习8-22", "习8-23", "习8-24", "习8-25", "习8-26", "习8-27", "习8-28", "习8-29", "习8-30", "习8-31", "习8-32", "习8-33", "习8-34", "习8-35", "习8-36", "习8-37", "习8-37(2)", "习8-38", "习8-39", "习8-40", "习8-41", "习8-42", "习8-43", "习8-44", "习8-45", "习8-46", "习8-47", "习8-48", "习8-49", "习8-50", "习8-51", "习8-51(2)", "习8-52", "习8-53", "习8-54", "习8-55", "习8-56", "习8-57", "习8-58", "习8-59", "习8-60", "习8-61", "习8-62", "习8-63", "习8-64", "习8-64(2)", "习8-65", "习8-66"], "fileBases": ["pb_8-1", "pb_8-2", "pb_8-3", "pb_8-4", "pb_8-5", "pb_8-6", "pb_8-6_2", "pb_8-7", "pb_8-8", "pb_8-9", "pb_8-10", "pb_8-11", "pb_8-12", "pb_8-13", "pb_8-14", "pb_8-15", "pb_8-16", "pb_8-17", "pb_8-17_2", "pb_8-18", "pb_8-19", "pb_8-20", "pb_8-21", "pb_8-22", "pb_8-23", "pb_8-24", "pb_8-25", "pb_8-26", "pb_8-27", "pb_8-28", "pb_8-29", "pb_8-30", "pb_8-31", "pb_8-32", "pb_8-33", "pb_8-34", "pb_8-35", "pb_8-36", "pb_8-37", "pb_8-37_2", "pb_8-38", "pb_8-39", "pb_8-40", "pb_8-41", "pb_8-42", "pb_8-43", "pb_8-44", "pb_8-45", "pb_8-46", "pb_8-47", "pb_8-48", "pb_8-49", "pb_8-50", "pb_8-51", "pb_8-51_2", "pb_8-52", "pb_8-53", "pb_8-54", "pb_8-55", "pb_8-56", "pb_8-57", "pb_8-58", "pb_8-59", "pb_8-60", "pb_8-61", "pb_8-62", "pb_8-63", "pb_8-64", "pb_8-64_2", "pb_8-65", "pb_8-66"]},
{"id": "ch166", "category": "shu1", "number": 166, "name": "李林880 - 高数 - 第9章 曲线积分与曲面积分", "short": "第9章 曲线积分与曲面积分", "total": 68, "cols": 5, "wb": "李林880", "subj": "高数", "relPath": "李林880/高数/第9章 曲线积分与曲面积分", "labels": ["习9-1", "习9-2", "习9-3", "习9-4", "习9-5", "习9-6", "习9-7", "习9-8", "习9-9", "习9-10", "习9-11", "习9-12", "习9-13", "习9-14", "习9-15", "习9-16", "习9-17", "习9-18", "习9-19", "习9-20", "习9-21", "习9-22", "习9-23", "习9-24", "习9-25", "习9-26", "习9-27", "习9-28", "习9-29", "习9-30", "习9-31", "习9-32", "习9-33", "习9-34", "习9-35", "习9-36", "习9-37", "习9-38", "习9-39", "习9-40", "习9-41", "习9-42", "习9-43", "习9-44", "习9-45", "习9-46", "习9-47", "习9-48", "习9-49", "习9-49(2)", "习9-50", "习9-51", "习9-52", "习9-53", "习9-54", "习9-55", "习9-56", "习9-57", "习9-58", "习9-59", "习9-60", "习9-61", "习9-62", "习9-63", "习9-64", "习9-65", "习9-66", "习9-67"], "fileBases": ["pb_9-1", "pb_9-2", "pb_9-3", "pb_9-4", "pb_9-5", "pb_9-6", "pb_9-7", "pb_9-8", "pb_9-9", "pb_9-10", "pb_9-11", "pb_9-12", "pb_9-13", "pb_9-14", "pb_9-15", "pb_9-16", "pb_9-17", "pb_9-18", "pb_9-19", "pb_9-20", "pb_9-21", "pb_9-22", "pb_9-23", "pb_9-24", "pb_9-25", "pb_9-26", "pb_9-27", "pb_9-28", "pb_9-29", "pb_9-30", "pb_9-31", "pb_9-32", "pb_9-33", "pb_9-34", "pb_9-35", "pb_9-36", "pb_9-37", "pb_9-38", "pb_9-39", "pb_9-40", "pb_9-41", "pb_9-42", "pb_9-43", "pb_9-44", "pb_9-45", "pb_9-46", "pb_9-47", "pb_9-48", "pb_9-49", "pb_9-49_2", "pb_9-50", "pb_9-51", "pb_9-52", "pb_9-53", "pb_9-54", "pb_9-55", "pb_9-56", "pb_9-57", "pb_9-58", "pb_9-59", "pb_9-60", "pb_9-61", "pb_9-62", "pb_9-63", "pb_9-64", "pb_9-65", "pb_9-66", "pb_9-67"]},
{"id": "ch167", "category": "shu1", "number": 167, "name": "李林880 - 线代 - 第10章 行列式", "short": "第10章 行列式", "total": 34, "cols": 5, "wb": "李林880", "subj": "线代", "relPath": "李林880/线代/第10章 行列式", "labels": ["习10-1", "习10-2", "习10-3", "习10-4", "习10-5", "习10-6", "习10-7", "习10-8", "习10-9", "习10-10", "习10-11", "习10-12", "习10-13", "习10-14", "习10-15", "习10-16", "习10-17", "习10-18", "习10-19", "习10-20", "习10-20(2)", "习10-21", "习10-22", "习10-23", "习10-24", "习10-25", "习10-26", "习10-27", "习10-28", "习10-29", "习10-30", "习10-30(2)", "习10-31", "习10-32"], "fileBases": ["pb_10-1", "pb_10-2", "pb_10-3", "pb_10-4", "pb_10-5", "pb_10-6", "pb_10-7", "pb_10-8", "pb_10-9", "pb_10-10", "pb_10-11", "pb_10-12", "pb_10-13", "pb_10-14", "pb_10-15", "pb_10-16", "pb_10-17", "pb_10-18", "pb_10-19", "pb_10-20", "pb_10-20_2", "pb_10-21", "pb_10-22", "pb_10-23", "pb_10-24", "pb_10-25", "pb_10-26", "pb_10-27", "pb_10-28", "pb_10-29", "pb_10-30", "pb_10-30_2", "pb_10-31", "pb_10-32"]},
{"id": "ch168", "category": "shu1", "number": 168, "name": "李林880 - 线代 - 第11章 矩阵", "short": "第11章 矩阵", "total": 49, "cols": 5, "wb": "李林880", "subj": "线代", "relPath": "李林880/线代/第11章 矩阵", "labels": ["习11-1", "习11-2", "习11-3", "习11-4", "习11-5", "习11-6", "习11-7", "习11-8", "习11-9", "习11-10", "习11-11", "习11-12", "习11-13", "习11-14", "习11-15", "习11-16", "习11-17", "习11-18", "习11-19", "习11-20", "习11-21", "习11-22", "习11-23", "习11-24", "习11-25", "习11-26", "习11-26(2)", "习11-27", "习11-28", "习11-29", "习11-30", "习11-31", "习11-32", "习11-33", "习11-34", "习11-35", "习11-35(2)", "习11-36", "习11-37", "习11-38", "习11-39", "习11-40", "习11-41", "习11-42", "习11-43", "习11-44", "习11-45", "习11-46", "习11-47"], "fileBases": ["pb_11-1", "pb_11-2", "pb_11-3", "pb_11-4", "pb_11-5", "pb_11-6", "pb_11-7", "pb_11-8", "pb_11-9", "pb_11-10", "pb_11-11", "pb_11-12", "pb_11-13", "pb_11-14", "pb_11-15", "pb_11-16", "pb_11-17", "pb_11-18", "pb_11-19", "pb_11-20", "pb_11-21", "pb_11-22", "pb_11-23", "pb_11-24", "pb_11-25", "pb_11-26", "pb_11-26_2", "pb_11-27", "pb_11-28", "pb_11-29", "pb_11-30", "pb_11-31", "pb_11-32", "pb_11-33", "pb_11-34", "pb_11-35", "pb_11-35_2", "pb_11-36", "pb_11-37", "pb_11-38", "pb_11-39", "pb_11-40", "pb_11-41", "pb_11-42", "pb_11-43", "pb_11-44", "pb_11-45", "pb_11-46", "pb_11-47"]},
{"id": "ch169", "category": "shu1", "number": 169, "name": "李林880 - 线代 - 第12章 向量", "short": "第12章 向量", "total": 39, "cols": 5, "wb": "李林880", "subj": "线代", "relPath": "李林880/线代/第12章 向量", "labels": ["习12-1", "习12-2", "习12-3", "习12-4", "习12-5", "习12-6", "习12-7", "习12-8", "习12-9", "习12-10", "习12-10(2)", "习12-11", "习12-12", "习12-13", "习12-14", "习12-15", "习12-16", "习12-17", "习12-18", "习12-19", "习12-20", "习12-21", "习12-22", "习12-22(2)", "习12-23", "习12-24", "习12-25", "习12-26", "习12-27", "习12-28", "习12-29", "习12-30", "习12-31", "习12-32", "习12-33", "习12-33(2)", "习12-34", "习12-35", "习12-36"], "fileBases": ["pb_12-1", "pb_12-2", "pb_12-3", "pb_12-4", "pb_12-5", "pb_12-6", "pb_12-7", "pb_12-8", "pb_12-9", "pb_12-10", "pb_12-10_2", "pb_12-11", "pb_12-12", "pb_12-13", "pb_12-14", "pb_12-15", "pb_12-16", "pb_12-17", "pb_12-18", "pb_12-19", "pb_12-20", "pb_12-21", "pb_12-22", "pb_12-22_2", "pb_12-23", "pb_12-24", "pb_12-25", "pb_12-26", "pb_12-27", "pb_12-28", "pb_12-29", "pb_12-30", "pb_12-31", "pb_12-32", "pb_12-33", "pb_12-33_2", "pb_12-34", "pb_12-35", "pb_12-36"]},
{"id": "ch170", "category": "shu1", "number": 170, "name": "李林880 - 线代 - 第13章 线性方程组", "short": "第13章 线性方程组", "total": 48, "cols": 5, "wb": "李林880", "subj": "线代", "relPath": "李林880/线代/第13章 线性方程组", "labels": ["习13-1", "习13-2", "习13-3", "习13-4", "习13-5", "习13-6", "习13-7", "习13-7(2)", "习13-8", "习13-9", "习13-10", "习13-11", "习13-12", "习13-13", "习13-14", "习13-15", "习13-15(2)", "习13-16", "习13-17", "习13-18", "习13-19", "习13-20", "习13-21", "习13-22", "习13-23", "习13-24", "习13-25", "习13-25(2)", "习13-26", "习13-27", "习13-28", "习13-29", "习13-30", "习13-31", "习13-32", "习13-33", "习13-34", "习13-35", "习13-35(2)", "习13-36", "习13-37", "习13-38", "习13-39", "习13-40", "习13-41", "习13-42", "习13-43", "习13-44"], "fileBases": ["pb_13-1", "pb_13-2", "pb_13-3", "pb_13-4", "pb_13-5", "pb_13-6", "pb_13-7", "pb_13-7_2", "pb_13-8", "pb_13-9", "pb_13-10", "pb_13-11", "pb_13-12", "pb_13-13", "pb_13-14", "pb_13-15", "pb_13-15_2", "pb_13-16", "pb_13-17", "pb_13-18", "pb_13-19", "pb_13-20", "pb_13-21", "pb_13-22", "pb_13-23", "pb_13-24", "pb_13-25", "pb_13-25_2", "pb_13-26", "pb_13-27", "pb_13-28", "pb_13-29", "pb_13-30", "pb_13-31", "pb_13-32", "pb_13-33", "pb_13-34", "pb_13-35", "pb_13-35_2", "pb_13-36", "pb_13-37", "pb_13-38", "pb_13-39", "pb_13-40", "pb_13-41", "pb_13-42", "pb_13-43", "pb_13-44"]},
{"id": "ch171", "category": "shu1", "number": 171, "name": "李林880 - 线代 - 第14章 相似矩阵", "short": "第14章 相似矩阵", "total": 56, "cols": 5, "wb": "李林880", "subj": "线代", "relPath": "李林880/线代/第14章 相似矩阵", "labels": ["习14-1", "习14-2", "习14-3", "习14-4", "习14-5", "习14-6", "习14-7", "习14-8", "习14-9", "习14-10", "习14-10(2)", "习14-11", "习14-12", "习14-13", "习14-14", "习14-15", "习14-16", "习14-17", "习14-18", "习14-18(2)", "习14-19", "习14-20", "习14-21", "习14-22", "习14-23", "习14-24", "习14-24(2)", "习14-25", "习14-26", "习14-27", "习14-28", "习14-29", "习14-30", "习14-31", "习14-32", "习14-33", "习14-34", "习14-34(2)", "习14-35", "习14-36", "习14-37", "习14-38", "习14-39", "习14-40", "习14-41", "习14-42", "习14-43", "习14-44", "习14-44(2)", "习14-45", "习14-46", "习14-47", "习14-48", "习14-49", "习14-50", "习14-51"], "fileBases": ["pb_14-1", "pb_14-2", "pb_14-3", "pb_14-4", "pb_14-5", "pb_14-6", "pb_14-7", "pb_14-8", "pb_14-9", "pb_14-10", "pb_14-10_2", "pb_14-11", "pb_14-12", "pb_14-13", "pb_14-14", "pb_14-15", "pb_14-16", "pb_14-17", "pb_14-18", "pb_14-18_2", "pb_14-19", "pb_14-20", "pb_14-21", "pb_14-22", "pb_14-23", "pb_14-24", "pb_14-24_2", "pb_14-25", "pb_14-26", "pb_14-27", "pb_14-28", "pb_14-29", "pb_14-30", "pb_14-31", "pb_14-32", "pb_14-33", "pb_14-34", "pb_14-34_2", "pb_14-35", "pb_14-36", "pb_14-37", "pb_14-38", "pb_14-39", "pb_14-40", "pb_14-41", "pb_14-42", "pb_14-43", "pb_14-44", "pb_14-44_2", "pb_14-45", "pb_14-46", "pb_14-47", "pb_14-48", "pb_14-49", "pb_14-50", "pb_14-51"]},
{"id": "ch172", "category": "shu1", "number": 172, "name": "李林880 - 线代 - 第15章 二次型", "short": "第15章 二次型", "total": 55, "cols": 5, "wb": "李林880", "subj": "线代", "relPath": "李林880/线代/第15章 二次型", "labels": ["习15-1", "习15-2", "习15-3", "习15-4", "习15-5", "习15-6", "习15-7", "习15-7(2)", "习15-8", "习15-9", "习15-10", "习15-11", "习15-12", "习15-13", "习15-14", "习15-15", "习15-16", "习15-17", "习15-18", "习15-18(2)", "习15-19", "习15-20", "习15-21", "习15-22", "习15-23", "习15-24", "习15-25", "习15-26", "习15-27", "习15-27(2)", "习15-28", "习15-29", "习15-30", "习15-31", "习15-32", "习15-33", "习15-34", "习15-35", "习15-36", "习15-37", "习15-38", "习15-38(2)", "习15-39", "习15-40", "习15-41", "习15-42", "习15-43", "习15-44", "习15-45", "习15-46", "习15-46(2)", "习15-47", "习15-48", "习15-49", "习15-50"], "fileBases": ["pb_15-1", "pb_15-2", "pb_15-3", "pb_15-4", "pb_15-5", "pb_15-6", "pb_15-7", "pb_15-7_2", "pb_15-8", "pb_15-9", "pb_15-10", "pb_15-11", "pb_15-12", "pb_15-13", "pb_15-14", "pb_15-15", "pb_15-16", "pb_15-17", "pb_15-18", "pb_15-18_2", "pb_15-19", "pb_15-20", "pb_15-21", "pb_15-22", "pb_15-23", "pb_15-24", "pb_15-25", "pb_15-26", "pb_15-27", "pb_15-27_2", "pb_15-28", "pb_15-29", "pb_15-30", "pb_15-31", "pb_15-32", "pb_15-33", "pb_15-34", "pb_15-35", "pb_15-36", "pb_15-37", "pb_15-38", "pb_15-38_2", "pb_15-39", "pb_15-40", "pb_15-41", "pb_15-42", "pb_15-43", "pb_15-44", "pb_15-45", "pb_15-46", "pb_15-46_2", "pb_15-47", "pb_15-48", "pb_15-49", "pb_15-50"]},
{"id": "ch173", "category": "shu1", "number": 173, "name": "李林880 - 概率论 - 第16章 随机事件及其概率", "short": "第16章 随机事件及其概率", "total": 24, "cols": 5, "wb": "李林880", "subj": "概率论", "relPath": "李林880/概率论/第16章 随机事件及其概率", "labels": ["习16-1", "习16-2", "习16-3", "习16-4", "习16-5", "习16-6", "习16-7", "习16-8", "习16-9", "习16-10", "习16-11", "习16-12", "习16-13", "习16-14", "习16-15", "习16-16", "习16-17", "习16-18", "习16-19", "习16-20", "习16-21", "习16-22", "习16-23", "习16-24"], "fileBases": ["pb_16-1", "pb_16-2", "pb_16-3", "pb_16-4", "pb_16-5", "pb_16-6", "pb_16-7", "pb_16-8", "pb_16-9", "pb_16-10", "pb_16-11", "pb_16-12", "pb_16-13", "pb_16-14", "pb_16-15", "pb_16-16", "pb_16-17", "pb_16-18", "pb_16-19", "pb_16-20", "pb_16-21", "pb_16-22", "pb_16-23", "pb_16-24"]},
{"id": "ch174", "category": "shu1", "number": 174, "name": "李林880 - 概率论 - 第17章 随机变量及其分布", "short": "第17章 随机变量及其分布", "total": 33, "cols": 5, "wb": "李林880", "subj": "概率论", "relPath": "李林880/概率论/第17章 随机变量及其分布", "labels": ["习17-1", "习17-2", "习17-3", "习17-4", "习17-5", "习17-6", "习17-7", "习17-8", "习17-9", "习17-10", "习17-11", "习17-12", "习17-13", "习17-14", "习17-15", "习17-16", "习17-17", "习17-18", "习17-19", "习17-20", "习17-21", "习17-21(2)", "习17-22", "习17-23", "习17-24", "习17-25", "习17-26", "习17-27", "习17-28", "习17-29", "习17-30", "习17-31", "习17-32"], "fileBases": ["pb_17-1", "pb_17-2", "pb_17-3", "pb_17-4", "pb_17-5", "pb_17-6", "pb_17-7", "pb_17-8", "pb_17-9", "pb_17-10", "pb_17-11", "pb_17-12", "pb_17-13", "pb_17-14", "pb_17-15", "pb_17-16", "pb_17-17", "pb_17-18", "pb_17-19", "pb_17-20", "pb_17-21", "pb_17-21_2", "pb_17-22", "pb_17-23", "pb_17-24", "pb_17-25", "pb_17-26", "pb_17-27", "pb_17-28", "pb_17-29", "pb_17-30", "pb_17-31", "pb_17-32"]},
{"id": "ch175", "category": "shu1", "number": 175, "name": "李林880 - 概率论 - 第18章 多维随机变量及其分布", "short": "第18章 多维随机变量及其分布", "total": 40, "cols": 5, "wb": "李林880", "subj": "概率论", "relPath": "李林880/概率论/第18章 多维随机变量及其分布", "labels": ["习18-1", "习18-2", "习18-3", "习18-4", "习18-5", "习18-6", "习18-7", "习18-7(2)", "习18-8", "习18-9", "习18-10", "习18-11", "习18-12", "习18-13", "习18-14", "习18-15", "习18-15(2)", "习18-16", "习18-17", "习18-18", "习18-19", "习18-20", "习18-21", "习18-22", "习18-22(2)", "习18-23", "习18-24", "习18-25", "习18-26", "习18-27", "习18-28", "习18-29", "习18-30", "习18-31", "习18-32", "习18-33", "习18-33(2)", "习18-34", "习18-35", "习18-36"], "fileBases": ["pb_18-1", "pb_18-2", "pb_18-3", "pb_18-4", "pb_18-5", "pb_18-6", "pb_18-7", "pb_18-7_2", "pb_18-8", "pb_18-9", "pb_18-10", "pb_18-11", "pb_18-12", "pb_18-13", "pb_18-14", "pb_18-15", "pb_18-15_2", "pb_18-16", "pb_18-17", "pb_18-18", "pb_18-19", "pb_18-20", "pb_18-21", "pb_18-22", "pb_18-22_2", "pb_18-23", "pb_18-24", "pb_18-25", "pb_18-26", "pb_18-27", "pb_18-28", "pb_18-29", "pb_18-30", "pb_18-31", "pb_18-32", "pb_18-33", "pb_18-33_2", "pb_18-34", "pb_18-35", "pb_18-36"]},
{"id": "ch176", "category": "shu1", "number": 176, "name": "李林880 - 概率论 - 第19章 随机变量的数字特征", "short": "第19章 随机变量的数字特征", "total": 50, "cols": 5, "wb": "李林880", "subj": "概率论", "relPath": "李林880/概率论/第19章 随机变量的数字特征", "labels": ["习19-1", "习19-2", "习19-3", "习19-4", "习19-5", "习19-6", "习19-7", "习19-8", "习19-9", "习19-10", "习19-11", "习19-12", "习19-12(2)", "习19-13", "习19-14", "习19-15", "习19-16", "习19-17", "习19-18", "习19-19", "习19-20", "习19-21", "习19-22", "习19-23", "习19-23(2)", "习19-24", "习19-25", "习19-26", "习19-27", "习19-28", "习19-29", "习19-30", "习19-31", "习19-32", "习19-33", "习19-34", "习19-35", "习19-36", "习19-36(2)", "习19-37", "习19-38", "习19-39", "习19-40", "习19-41", "习19-42", "习19-43", "习19-44", "习19-44(2)", "习19-45", "习19-46"], "fileBases": ["pb_19-1", "pb_19-2", "pb_19-3", "pb_19-4", "pb_19-5", "pb_19-6", "pb_19-7", "pb_19-8", "pb_19-9", "pb_19-10", "pb_19-11", "pb_19-12", "pb_19-12_2", "pb_19-13", "pb_19-14", "pb_19-15", "pb_19-16", "pb_19-17", "pb_19-18", "pb_19-19", "pb_19-20", "pb_19-21", "pb_19-22", "pb_19-23", "pb_19-23_2", "pb_19-24", "pb_19-25", "pb_19-26", "pb_19-27", "pb_19-28", "pb_19-29", "pb_19-30", "pb_19-31", "pb_19-32", "pb_19-33", "pb_19-34", "pb_19-35", "pb_19-36", "pb_19-36_2", "pb_19-37", "pb_19-38", "pb_19-39", "pb_19-40", "pb_19-41", "pb_19-42", "pb_19-43", "pb_19-44", "pb_19-44_2", "pb_19-45", "pb_19-46"]},
{"id": "ch177", "category": "shu1", "number": 177, "name": "李林880 - 概率论 - 第20章 大数定律与中心极限定理", "short": "第20章 大数定律与中心极限定理", "total": 10, "cols": 5, "wb": "李林880", "subj": "概率论", "relPath": "李林880/概率论/第20章 大数定律与中心极限定理", "labels": ["习20-1", "习20-2", "习20-3", "习20-4", "习20-5", "习20-6", "习20-7", "习20-7(2)", "习20-8", "习20-9"], "fileBases": ["pb_20-1", "pb_20-2", "pb_20-3", "pb_20-4", "pb_20-5", "pb_20-6", "pb_20-7", "pb_20-7_2", "pb_20-8", "pb_20-9"]},
{"id": "ch178", "category": "shu1", "number": 178, "name": "李林880 - 概率论 - 第21章 数理统计的基本概念", "short": "第21章 数理统计的基本概念", "total": 25, "cols": 5, "wb": "李林880", "subj": "概率论", "relPath": "李林880/概率论/第21章 数理统计的基本概念", "labels": ["习21-1", "习21-2", "习21-3", "习21-4", "习21-5", "习21-6", "习21-7", "习21-8", "习21-9", "习21-10", "习21-10(2)", "习21-11", "习21-12", "习21-13", "习21-14", "习21-15", "习21-16", "习21-17", "习21-18", "习21-18(2)", "习21-19", "习21-20", "习21-21", "习21-22", "习21-23"], "fileBases": ["pb_21-1", "pb_21-2", "pb_21-3", "pb_21-4", "pb_21-5", "pb_21-6", "pb_21-7", "pb_21-8", "pb_21-9", "pb_21-10", "pb_21-10_2", "pb_21-11", "pb_21-12", "pb_21-13", "pb_21-14", "pb_21-15", "pb_21-16", "pb_21-17", "pb_21-18", "pb_21-18_2", "pb_21-19", "pb_21-20", "pb_21-21", "pb_21-22", "pb_21-23"]},
{"id": "ch179", "category": "shu1", "number": 179, "name": "李林880 - 概率论 - 第22章 参数估计", "short": "第22章 参数估计", "total": 24, "cols": 5, "wb": "李林880", "subj": "概率论", "relPath": "李林880/概率论/第22章 参数估计", "labels": ["习22-1", "习22-2", "习22-3", "习22-4", "习22-5", "习22-6", "习22-7", "习22-8", "习22-9", "习22-10", "习22-11", "习22-12", "习22-13", "习22-14", "习22-15", "习22-16", "习22-17", "习22-18", "习22-19", "习22-20", "习22-21", "习22-22", "习22-23", "习22-24"], "fileBases": ["pb_22-1", "pb_22-2", "pb_22-3", "pb_22-4", "pb_22-5", "pb_22-6", "pb_22-7", "pb_22-8", "pb_22-9", "pb_22-10", "pb_22-11", "pb_22-12", "pb_22-13", "pb_22-14", "pb_22-15", "pb_22-16", "pb_22-17", "pb_22-18", "pb_22-19", "pb_22-20", "pb_22-21", "pb_22-22", "pb_22-23", "pb_22-24"]},
{"id": "ch180", "category": "shu1", "number": 180, "name": "李林880 - 概率论 - 第23章 假设检验", "short": "第23章 假设检验", "total": 7, "cols": 5, "wb": "李林880", "subj": "概率论", "relPath": "李林880/概率论/第23章 假设检验", "labels": ["习23-1", "习23-2", "习23-3", "习23-4", "习23-5", "习23-6", "习23-6(2)"], "fileBases": ["pb_23-1", "pb_23-2", "pb_23-3", "pb_23-4", "pb_23-5", "pb_23-6", "pb_23-6_2"]},
{"id": "ch200", "number": 200, "name": "何子述课后刷题本 - 第1章", "short": "第1章", "total": 27, "cols": 5, "wb": "何子述课后刷题本", "subj": "专业课", "category": "zhuanye", "relPath": "何子述课后刷题本/第1章", "labels": ["例1-6", "例1-6(2)", "例1-6(3)", "例1-8", "例1-8(2)", "例1-8(3)", "例1-8(4)", "例1-16", "例1-16(2)", "例1-16(3)", "例1-20", "例1-20(2)", "例1-20(3)", "例1-20(4)", "例1-21", "例1-22", "例1-36", "例1-p1_c1", "例1-p1_c2", "例1-p2_c1", "例1-p2_c2", "例1-p3_c1", "例1-p3_c2", "例1-p5_c2", "例1-p6_c1", "例1-p6_c2", "例1-p14_c1"], "fileBases": ["ex_1-6_question", "ex_1-6_question_2", "ex_1-6_question_3", "ex_1-8_question", "ex_1-8_question_2", "ex_1-8_question_3", "ex_1-8_question_4", "ex_1-16_question", "ex_1-16_question_2", "ex_1-16_question_3", "ex_1-20_question", "ex_1-20_question_2", "ex_1-20_question_3", "ex_1-20_question_4", "ex_1-21_question", "ex_1-22_question", "ex_1-36_question", "ex_1-p1_c1_question", "ex_1-p1_c2_question", "ex_1-p2_c1_question", "ex_1-p2_c2_question", "ex_1-p3_c1_question", "ex_1-p3_c2_question", "ex_1-p5_c2_question", "ex_1-p6_c1_question", "ex_1-p6_c2_question", "ex_1-p14_c1_question"]},
{"id": "ch201", "number": 201, "name": "何子述课后刷题本 - 第2章", "short": "第2章", "total": 22, "cols": 5, "wb": "何子述课后刷题本", "subj": "专业课", "category": "zhuanye", "relPath": "何子述课后刷题本/第2章", "labels": ["例2-2", "例2-9", "例2-11", "例2-11(2)", "例2-14", "例2-14(2)", "例2-14(3)", "例2-15", "例2-15(2)", "例2-15(3)", "例2-16", "例2-16(2)", "例2-18", "例2-22", "例2-22(2)", "例2-26", "例2-26(2)", "例2-28", "例2-p15_c1", "例2-p15_c2", "例2-p24_c2", "例2-p25_c1"], "fileBases": ["ex_2-2_question", "ex_2-9_question", "ex_2-11_question", "ex_2-11_question_2", "ex_2-14_question", "ex_2-14_question_2", "ex_2-14_question_3", "ex_2-15_question", "ex_2-15_question_2", "ex_2-15_question_3", "ex_2-16_question", "ex_2-16_question_2", "ex_2-18_question", "ex_2-22_question", "ex_2-22_question_2", "ex_2-26_question", "ex_2-26_question_2", "ex_2-28_question", "ex_2-p15_c1_question", "ex_2-p15_c2_question", "ex_2-p24_c2_question", "ex_2-p25_c1_question"]},
{"id": "ch202", "number": 202, "name": "何子述课后刷题本 - 第3章", "short": "第3章", "total": 30, "cols": 5, "wb": "何子述课后刷题本", "subj": "专业课", "category": "zhuanye", "relPath": "何子述课后刷题本/第3章", "labels": ["例3-3", "例3-3(2)", "例3-3(3)", "例3-6", "例3-6(2)", "例3-12", "例3-16", "例3-16(2)", "例3-17", "例3-17(2)", "例3-18", "例3-23", "例3-23(2)", "例3-24", "例3-24(2)", "例3-26", "例3-26(2)", "例3-26(3)", "例3-27", "例3-28", "例3-29", "例3-29(2)", "例3-32", "例3-32(2)", "例3-34", "例3-p28_c1", "例3-p28_c2", "例3-p29_c2", "例3-p38_c1", "例3-p38_c2"], "fileBases": ["ex_3-3_question", "ex_3-3_question_2", "ex_3-3_question_3", "ex_3-6_question", "ex_3-6_question_2", "ex_3-12_question", "ex_3-16_question", "ex_3-16_question_2", "ex_3-17_question", "ex_3-17_question_2", "ex_3-18_question", "ex_3-23_question", "ex_3-23_question_2", "ex_3-24_question", "ex_3-24_question_2", "ex_3-26_question", "ex_3-26_question_2", "ex_3-26_question_3", "ex_3-27_question", "ex_3-28_question", "ex_3-29_question", "ex_3-29_question_2", "ex_3-32_question", "ex_3-32_question_2", "ex_3-34_question", "ex_3-p28_c1_question", "ex_3-p28_c2_question", "ex_3-p29_c2_question", "ex_3-p38_c1_question", "ex_3-p38_c2_question"]},
{"id": "ch203", "number": 203, "name": "何子述课后刷题本 - 第4章", "short": "第4章", "total": 21, "cols": 5, "wb": "何子述课后刷题本", "subj": "专业课", "category": "zhuanye", "relPath": "何子述课后刷题本/第4章", "labels": ["例4-1", "例4-1(2)", "例4-8", "例4-9", "例4-11", "例4-13", "例4-13(2)", "例4-24", "例4-24(2)", "例4-25", "例4-26", "例4-28", "例4-28(2)", "例4-30", "例4-30(2)", "例4-p43_c1", "例4-p44_c2", "例4-p45_c1", "例4-p45_c2", "例4-p50_c1", "例4-p50_c2"], "fileBases": ["ex_4-1_question", "ex_4-1_question_2", "ex_4-8_question", "ex_4-9_question", "ex_4-11_question", "ex_4-13_question", "ex_4-13_question_2", "ex_4-24_question", "ex_4-24_question_2", "ex_4-25_question", "ex_4-26_question", "ex_4-28_question", "ex_4-28_question_2", "ex_4-30_question", "ex_4-30_question_2", "ex_4-p43_c1_question", "ex_4-p44_c2_question", "ex_4-p45_c1_question", "ex_4-p45_c2_question", "ex_4-p50_c1_question", "ex_4-p50_c2_question"]},
{"id": "ch204", "number": 204, "name": "何子述课后刷题本 - 第5章", "short": "第5章", "total": 36, "cols": 5, "wb": "何子述课后刷题本", "subj": "专业课", "category": "zhuanye", "relPath": "何子述课后刷题本/第5章", "labels": ["例5-2", "例5-2(2)", "例5-2(3)", "例5-3", "例5-3(2)", "例5-6", "例5-6(2)", "例5-6(3)", "例5-9", "例5-9(2)", "例5-10", "例5-12", "例5-13", "例5-13(2)", "例5-13(3)", "例5-14", "例5-14(2)", "例5-18", "例5-22", "例5-22(2)", "例5-23", "例5-34", "例5-34(2)", "例5-34(3)", "例5-34(4)", "例5-35", "例5-35(2)", "例5-35(3)", "例5-35(4)", "例5-38", "例5-38(2)", "例5-38(3)", "例5-40", "例5-p59_c2", "例5-p60_c1", "例5-p60_c2"], "fileBases": ["ex_5-2_question", "ex_5-2_question_2", "ex_5-2_question_3", "ex_5-3_question", "ex_5-3_question_2", "ex_5-6_question", "ex_5-6_question_2", "ex_5-6_question_3", "ex_5-9_question", "ex_5-9_question_2", "ex_5-10_question", "ex_5-12_question", "ex_5-13_question", "ex_5-13_question_2", "ex_5-13_question_3", "ex_5-14_question", "ex_5-14_question_2", "ex_5-18_question", "ex_5-22_question", "ex_5-22_question_2", "ex_5-23_question", "ex_5-34_question", "ex_5-34_question_2", "ex_5-34_question_3", "ex_5-34_question_4", "ex_5-35_question", "ex_5-35_question_2", "ex_5-35_question_3", "ex_5-35_question_4", "ex_5-38_question", "ex_5-38_question_2", "ex_5-38_question_3", "ex_5-40_question", "ex_5-p59_c2_question", "ex_5-p60_c1_question", "ex_5-p60_c2_question"]},
{"id": "ch205", "number": 205, "name": "何子述课后刷题本 - 第6章", "short": "第6章", "total": 31, "cols": 5, "wb": "何子述课后刷题本", "subj": "专业课", "category": "zhuanye", "relPath": "何子述课后刷题本/第6章", "labels": ["例6-3", "例6-3(2)", "例6-3(3)", "例6-5", "例6-5(2)", "例6-5(3)", "例6-6", "例6-6(2)", "例6-7", "例6-7(2)", "例6-7(3)", "例6-13", "例6-14", "例6-14(2)", "例6-18", "例6-18(2)", "例6-18(3)", "例6-19", "例6-21", "例6-22", "例6-28", "例6-29", "例6-29(2)", "例6-29(3)", "例6-31", "例6-32", "例6-33", "例6-35", "例6-36", "例6-36(2)", "例6-p74_c2"], "fileBases": ["ex_6-3_question", "ex_6-3_question_2", "ex_6-3_question_3", "ex_6-5_question", "ex_6-5_question_2", "ex_6-5_question_3", "ex_6-6_question", "ex_6-6_question_2", "ex_6-7_question", "ex_6-7_question_2", "ex_6-7_question_3", "ex_6-13_question", "ex_6-14_question", "ex_6-14_question_2", "ex_6-18_question", "ex_6-18_question_2", "ex_6-18_question_3", "ex_6-19_question", "ex_6-21_question", "ex_6-22_question", "ex_6-28_question", "ex_6-29_question", "ex_6-29_question_2", "ex_6-29_question_3", "ex_6-31_question", "ex_6-32_question", "ex_6-33_question", "ex_6-35_question", "ex_6-36_question", "ex_6-36_question_2", "ex_6-p74_c2_question"]},
{"id": "ch206", "number": 206, "name": "何子述课后刷题本 - 第7章", "short": "第7章", "total": 26, "cols": 5, "wb": "何子述课后刷题本", "subj": "专业课", "category": "zhuanye", "relPath": "何子述课后刷题本/第7章", "labels": ["例7-3", "例7-3(2)", "例7-3(3)", "例7-8", "例7-9", "例7-10", "例7-20", "例7-20(2)", "例7-24", "例7-24(2)", "例7-25", "例7-25(2)", "例7-25(3)", "例7-34", "例7-34(2)", "例7-34(3)", "例7-37", "例7-37(2)", "例7-37(3)", "例7-p87_c2", "例7-p89_c1", "例7-p89_c2", "例7-p92_c2", "例7-p93_c1", "例7-p93_c2", "例7-p97_c1"], "fileBases": ["ex_7-3_question", "ex_7-3_question_2", "ex_7-3_question_3", "ex_7-8_question", "ex_7-9_question", "ex_7-10_question", "ex_7-20_question", "ex_7-20_question_2", "ex_7-24_question", "ex_7-24_question_2", "ex_7-25_question", "ex_7-25_question_2", "ex_7-25_question_3", "ex_7-34_question", "ex_7-34_question_2", "ex_7-34_question_3", "ex_7-37_question", "ex_7-37_question_2", "ex_7-37_question_3", "ex_7-p87_c2_question", "ex_7-p89_c1_question", "ex_7-p89_c2_question", "ex_7-p92_c2_question", "ex_7-p93_c1_question", "ex_7-p93_c2_question", "ex_7-p97_c1_question"]},
{"id": "ch207", "number": 207, "name": "吴大正课后刷题本 - 第1章", "short": "第1章", "total": 60, "cols": 5, "wb": "吴大正课后刷题本", "subj": "专业课", "category": "zhuanye", "relPath": "吴大正课后刷题本/第1章", "labels": ["例1-1", "例1-1(2)", "例1-1(3)", "例1-2", "例1-2(2)", "例1-2(3)", "例1-2(4)", "例1-3", "例1-3(2)", "例1-4", "例1-4(2)", "例1-6", "例1-6(2)", "例1-7", "例1-7(2)", "例1-8", "例1-8(2)", "例1-9", "例1-10", "例1-10(2)", "例1-11", "例1-12", "例1-13", "例1-14", "例1-15", "例1-16", "例1-18", "例1-19", "例1-19(2)", "例1-20", "例1-20(2)", "例1-20(3)", "例1-20(4)", "例1-21", "例1-22", "例1-23", "例1-23(2)", "例1-23(3)", "例1-24", "例1-24(2)", "例1-24(3)", "例1-25", "例1-25(2)", "例1-26", "例1-27", "例1-28", "例1-29", "例1-30", "例1-30(2)", "例1-31", "例1-32", "例1-33", "例1-33(2)", "例1-p1_c1", "例1-p6_c2", "例1-p7_c1", "例1-p15_c1", "例1-p19_c2", "例1-p213_c1", "例1-p213_c2"], "fileBases": ["ex_1-1_question", "ex_1-1_question_2", "ex_1-1_question_3", "ex_1-2_question", "ex_1-2_question_2", "ex_1-2_question_3", "ex_1-2_question_4", "ex_1-3_question", "ex_1-3_question_2", "ex_1-4_question", "ex_1-4_question_2", "ex_1-6_question", "ex_1-6_question_2", "ex_1-7_question", "ex_1-7_question_2", "ex_1-8_question", "ex_1-8_question_2", "ex_1-9_question", "ex_1-10_question", "ex_1-10_question_2", "ex_1-11_question", "ex_1-12_question", "ex_1-13_question", "ex_1-14_question", "ex_1-15_question", "ex_1-16_question", "ex_1-18_question", "ex_1-19_question", "ex_1-19_question_2", "ex_1-20_question", "ex_1-20_question_2", "ex_1-20_question_3", "ex_1-20_question_4", "ex_1-21_question", "ex_1-22_question", "ex_1-23_question", "ex_1-23_question_2", "ex_1-23_question_3", "ex_1-24_question", "ex_1-24_question_2", "ex_1-24_question_3", "ex_1-25_question", "ex_1-25_question_2", "ex_1-26_question", "ex_1-27_question", "ex_1-28_question", "ex_1-29_question", "ex_1-30_question", "ex_1-30_question_2", "ex_1-31_question", "ex_1-32_question", "ex_1-33_question", "ex_1-33_question_2", "ex_1-p1_c1_question", "ex_1-p6_c2_question", "ex_1-p7_c1_question", "ex_1-p15_c1_question", "ex_1-p19_c2_question", "ex_1-p213_c1_question", "ex_1-p213_c2_question"]},
{"id": "ch208", "number": 208, "name": "吴大正课后刷题本 - 第2章", "short": "第2章", "total": 56, "cols": 5, "wb": "吴大正课后刷题本", "subj": "专业课", "category": "zhuanye", "relPath": "吴大正课后刷题本/第2章", "labels": ["例2-1", "例2-1(2)", "例2-1(3)", "例2-1(4)", "例2-1(5)", "例2-2", "例2-2(2)", "例2-3", "例2-4", "例2-4(2)", "例2-4(3)", "例2-5", "例2-6", "例2-7", "例2-7(2)", "例2-7(3)", "例2-8", "例2-9", "例2-10", "例2-11", "例2-12", "例2-13", "例2-14", "例2-15", "例2-16", "例2-16(2)", "例2-16(3)", "例2-17", "例2-17(2)", "例2-17(3)", "例2-17(4)", "例2-18", "例2-18(2)", "例2-18(3)", "例2-19", "例2-19(2)", "例2-20", "例2-21", "例2-22", "例2-23", "例2-24", "例2-25", "例2-26", "例2-27", "例2-28", "例2-29", "例2-30", "例2-31", "例2-32", "例2-33", "例2-34", "例2-35", "例2-35(2)", "例2-36", "例2-p33_c1", "例2-p56_c2"], "fileBases": ["ex_2-1_question", "ex_2-1_question_2", "ex_2-1_question_3", "ex_2-1_question_4", "ex_2-1_question_5", "ex_2-2_question", "ex_2-2_question_2", "ex_2-3_question", "ex_2-4_question", "ex_2-4_question_2", "ex_2-4_question_3", "ex_2-5_question", "ex_2-6_question", "ex_2-7_question", "ex_2-7_question_2", "ex_2-7_question_3", "ex_2-8_question", "ex_2-9_question", "ex_2-10_question", "ex_2-11_question", "ex_2-12_question", "ex_2-13_question", "ex_2-14_question", "ex_2-15_question", "ex_2-16_question", "ex_2-16_question_2", "ex_2-16_question_3", "ex_2-17_question", "ex_2-17_question_2", "ex_2-17_question_3", "ex_2-17_question_4", "ex_2-18_question", "ex_2-18_question_2", "ex_2-18_question_3", "ex_2-19_question", "ex_2-19_question_2", "ex_2-20_question", "ex_2-21_question", "ex_2-22_question", "ex_2-23_question", "ex_2-24_question", "ex_2-25_question", "ex_2-26_question", "ex_2-27_question", "ex_2-28_question", "ex_2-29_question", "ex_2-30_question", "ex_2-31_question", "ex_2-32_question", "ex_2-33_question", "ex_2-34_question", "ex_2-35_question", "ex_2-35_question_2", "ex_2-36_question", "ex_2-p33_c1_question", "ex_2-p56_c2_question"]},
{"id": "ch209", "number": 209, "name": "吴大正课后刷题本 - 第3章", "short": "第3章", "total": 49, "cols": 5, "wb": "吴大正课后刷题本", "subj": "专业课", "category": "zhuanye", "relPath": "吴大正课后刷题本/第3章", "labels": ["例3-2", "例3-2(2)", "例3-3", "例3-3(2)", "例3-4", "例3-4(2)", "例3-4(3)", "例3-5", "例3-6", "例3-6(2)", "例3-6(3)", "例3-6(4)", "例3-6(5)", "例3-7", "例3-8", "例3-8(2)", "例3-8(3)", "例3-8(4)", "例3-8(5)", "例3-11", "例3-11(2)", "例3-12", "例3-12(2)", "例3-13", "例3-13(2)", "例3-13(3)", "例3-14", "例3-14(2)", "例3-15", "例3-16", "例3-17", "例3-18", "例3-20", "例3-21", "例3-22", "例3-23", "例3-25", "例3-26", "例3-27", "例3-29", "例3-p66_c2", "例3-p67_c1", "例3-p67_c2", "例3-p68_c1", "例3-p68_c2", "例3-p69_c1", "例3-p76_c1", "例3-p78_c2", "例3-p80_c2"], "fileBases": ["ex_3-2_question", "ex_3-2_question_2", "ex_3-3_question", "ex_3-3_question_2", "ex_3-4_question", "ex_3-4_question_2", "ex_3-4_question_3", "ex_3-5_question", "ex_3-6_question", "ex_3-6_question_2", "ex_3-6_question_3", "ex_3-6_question_4", "ex_3-6_question_5", "ex_3-7_question", "ex_3-8_question", "ex_3-8_question_2", "ex_3-8_question_3", "ex_3-8_question_4", "ex_3-8_question_5", "ex_3-11_question", "ex_3-11_question_2", "ex_3-12_question", "ex_3-12_question_2", "ex_3-13_question", "ex_3-13_question_2", "ex_3-13_question_3", "ex_3-14_question", "ex_3-14_question_2", "ex_3-15_question", "ex_3-16_question", "ex_3-17_question", "ex_3-18_question", "ex_3-20_question", "ex_3-21_question", "ex_3-22_question", "ex_3-23_question", "ex_3-25_question", "ex_3-26_question", "ex_3-27_question", "ex_3-29_question", "ex_3-p66_c2_question", "ex_3-p67_c1_question", "ex_3-p67_c2_question", "ex_3-p68_c1_question", "ex_3-p68_c2_question", "ex_3-p69_c1_question", "ex_3-p76_c1_question", "ex_3-p78_c2_question", "ex_3-p80_c2_question"]},
{"id": "ch210", "number": 210, "name": "吴大正课后刷题本 - 第4章", "short": "第4章", "total": 91, "cols": 5, "wb": "吴大正课后刷题本", "subj": "专业课", "category": "zhuanye", "relPath": "吴大正课后刷题本/第4章", "labels": ["例4-1", "例4-2", "例4-3", "例4-3(2)", "例4-5", "例4-6", "例4-7", "例4-7(2)", "例4-8", "例4-8(2)", "例4-8(3)", "例4-8(4)", "例4-9", "例4-9(2)", "例4-10", "例4-10(2)", "例4-10(3)", "例4-10(4)", "例4-11", "例4-11(2)", "例4-12", "例4-12(2)", "例4-13", "例4-13(2)", "例4-13(3)", "例4-13(4)", "例4-14", "例4-14(2)", "例4-14(3)", "例4-14(4)", "例4-14(5)", "例4-14(6)", "例4-15", "例4-16", "例4-17", "例4-18", "例4-19", "例4-20", "例4-20(2)", "例4-21", "例4-22", "例4-22(2)", "例4-23", "例4-25", "例4-25(2)", "例4-27", "例4-28", "例4-29", "例4-30", "例4-32", "例4-33", "例4-34", "例4-36", "例4-37", "例4-38", "例4-39", "例4-39(2)", "例4-40", "例4-41", "例4-42", "例4-43", "例4-44", "例4-45", "例4-46", "例4-47", "例4-48", "例4-49", "例4-49(2)", "例4-50", "例4-50(2)", "例4-51", "例4-52", "例4-53", "例4-54", "例4-54(2)", "例4-55", "例4-55(2)", "例4-57", "例4-59", "例4-60", "例4-60(2)", "例4-60(3)", "例4-61", "例4-62", "例4-p83_c2", "例4-p103_c2", "例4-p105_c1", "例4-p107_c2", "例4-p109_c2", "例4-p122_c2", "例4-p123_c2"], "fileBases": ["ex_4-1_question", "ex_4-2_question", "ex_4-3_question", "ex_4-3_question_2", "ex_4-5_question", "ex_4-6_question", "ex_4-7_question", "ex_4-7_question_2", "ex_4-8_question", "ex_4-8_question_2", "ex_4-8_question_3", "ex_4-8_question_4", "ex_4-9_question", "ex_4-9_question_2", "ex_4-10_question", "ex_4-10_question_2", "ex_4-10_question_3", "ex_4-10_question_4", "ex_4-11_question", "ex_4-11_question_2", "ex_4-12_question", "ex_4-12_question_2", "ex_4-13_question", "ex_4-13_question_2", "ex_4-13_question_3", "ex_4-13_question_4", "ex_4-14_question", "ex_4-14_question_2", "ex_4-14_question_3", "ex_4-14_question_4", "ex_4-14_question_5", "ex_4-14_question_6", "ex_4-15_question", "ex_4-16_question", "ex_4-17_question", "ex_4-18_question", "ex_4-19_question", "ex_4-20_question", "ex_4-20_question_2", "ex_4-21_question", "ex_4-22_question", "ex_4-22_question_2", "ex_4-23_question", "ex_4-25_question", "ex_4-25_question_2", "ex_4-27_question", "ex_4-28_question", "ex_4-29_question", "ex_4-30_question", "ex_4-32_question", "ex_4-33_question", "ex_4-34_question", "ex_4-36_question", "ex_4-37_question", "ex_4-38_question", "ex_4-39_question", "ex_4-39_question_2", "ex_4-40_question", "ex_4-41_question", "ex_4-42_question", "ex_4-43_question", "ex_4-44_question", "ex_4-45_question", "ex_4-46_question", "ex_4-47_question", "ex_4-48_question", "ex_4-49_question", "ex_4-49_question_2", "ex_4-50_question", "ex_4-50_question_2", "ex_4-51_question", "ex_4-52_question", "ex_4-53_question", "ex_4-54_question", "ex_4-54_question_2", "ex_4-55_question", "ex_4-55_question_2", "ex_4-57_question", "ex_4-59_question", "ex_4-60_question", "ex_4-60_question_2", "ex_4-60_question_3", "ex_4-61_question", "ex_4-62_question", "ex_4-p83_c2_question", "ex_4-p103_c2_question", "ex_4-p105_c1_question", "ex_4-p107_c2_question", "ex_4-p109_c2_question", "ex_4-p122_c2_question", "ex_4-p123_c2_question"]},
{"id": "ch211", "number": 211, "name": "吴大正课后刷题本 - 第5章", "short": "第5章", "total": 95, "cols": 5, "wb": "吴大正课后刷题本", "subj": "专业课", "category": "zhuanye", "relPath": "吴大正课后刷题本/第5章", "labels": ["例5-1", "例5-1(2)", "例5-2", "例5-2(2)", "例5-2(3)", "例5-2(4)", "例5-2(5)", "例5-2(6)", "例5-3", "例5-3(2)", "例5-3(3)", "例5-3(4)", "例5-3(5)", "例5-3(6)", "例5-3(7)", "例5-3(8)", "例5-4", "例5-6", "例5-7", "例5-7(2)", "例5-7(3)", "例5-7(4)", "例5-8", "例5-8(2)", "例5-8(3)", "例5-9", "例5-9(2)", "例5-10", "例5-11", "例5-12", "例5-13", "例5-13(2)", "例5-14", "例5-14(2)", "例5-15", "例5-15(2)", "例5-16", "例5-16(2)", "例5-17", "例5-17(2)", "例5-18", "例5-18(2)", "例5-18(3)", "例5-19", "例5-20", "例5-21", "例5-21(2)", "例5-21(3)", "例5-21(4)", "例5-22", "例5-23", "例5-24", "例5-24(2)", "例5-26", "例5-27", "例5-28", "例5-29", "例5-30", "例5-30(2)", "例5-30(3)", "例5-31", "例5-31(2)", "例5-31(3)", "例5-32", "例5-33", "例5-33(2)", "例5-33(3)", "例5-33(4)", "例5-33(5)", "例5-34", "例5-35", "例5-36", "例5-37", "例5-38", "例5-39", "例5-40", "例5-41", "例5-41(2)", "例5-42", "例5-43", "例5-43(2)", "例5-43(3)", "例5-44", "例5-45", "例5-46", "例5-47", "例5-48", "例5-49", "例5-49(2)", "例5-50", "例5-51", "例5-51(2)", "例5-52", "例5-p135_c2", "例5-p136_c1"], "fileBases": ["ex_5-1_question", "ex_5-1_question_2", "ex_5-2_question", "ex_5-2_question_2", "ex_5-2_question_3", "ex_5-2_question_4", "ex_5-2_question_5", "ex_5-2_question_6", "ex_5-3_question", "ex_5-3_question_2", "ex_5-3_question_3", "ex_5-3_question_4", "ex_5-3_question_5", "ex_5-3_question_6", "ex_5-3_question_7", "ex_5-3_question_8", "ex_5-4_question", "ex_5-6_question", "ex_5-7_question", "ex_5-7_question_2", "ex_5-7_question_3", "ex_5-7_question_4", "ex_5-8_question", "ex_5-8_question_2", "ex_5-8_question_3", "ex_5-9_question", "ex_5-9_question_2", "ex_5-10_question", "ex_5-11_question", "ex_5-12_question", "ex_5-13_question", "ex_5-13_question_2", "ex_5-14_question", "ex_5-14_question_2", "ex_5-15_question", "ex_5-15_question_2", "ex_5-16_question", "ex_5-16_question_2", "ex_5-17_question", "ex_5-17_question_2", "ex_5-18_question", "ex_5-18_question_2", "ex_5-18_question_3", "ex_5-19_question", "ex_5-20_question", "ex_5-21_question", "ex_5-21_question_2", "ex_5-21_question_3", "ex_5-21_question_4", "ex_5-22_question", "ex_5-23_question", "ex_5-24_question", "ex_5-24_question_2", "ex_5-26_question", "ex_5-27_question", "ex_5-28_question", "ex_5-29_question", "ex_5-30_question", "ex_5-30_question_2", "ex_5-30_question_3", "ex_5-31_question", "ex_5-31_question_2", "ex_5-31_question_3", "ex_5-32_question", "ex_5-33_question", "ex_5-33_question_2", "ex_5-33_question_3", "ex_5-33_question_4", "ex_5-33_question_5", "ex_5-34_question", "ex_5-35_question", "ex_5-36_question", "ex_5-37_question", "ex_5-38_question", "ex_5-39_question", "ex_5-40_question", "ex_5-41_question", "ex_5-41_question_2", "ex_5-42_question", "ex_5-43_question", "ex_5-43_question_2", "ex_5-43_question_3", "ex_5-44_question", "ex_5-45_question", "ex_5-46_question", "ex_5-47_question", "ex_5-48_question", "ex_5-49_question", "ex_5-49_question_2", "ex_5-50_question", "ex_5-51_question", "ex_5-51_question_2", "ex_5-52_question", "ex_5-p135_c2_question", "ex_5-p136_c1_question"]},
{"id": "ch212", "number": 212, "name": "吴大正课后刷题本 - 第6章", "short": "第6章", "total": 85, "cols": 5, "wb": "吴大正课后刷题本", "subj": "专业课", "category": "zhuanye", "relPath": "吴大正课后刷题本/第6章", "labels": ["例6-1", "例6-2", "例6-2(2)", "例6-4", "例6-4(2)", "例6-5", "例6-5(2)", "例6-5(3)", "例6-5(4)", "例6-5(5)", "例6-6", "例6-6(2)", "例6-7", "例6-8", "例6-9", "例6-9(2)", "例6-9(3)", "例6-9(4)", "例6-9(5)", "例6-9(6)", "例6-10", "例6-10(2)", "例6-13", "例6-14", "例6-14(2)", "例6-14(3)", "例6-15", "例6-15(2)", "例6-16", "例6-16(2)", "例6-16(3)", "例6-17", "例6-18", "例6-19", "例6-20", "例6-20(2)", "例6-20(3)", "例6-21", "例6-21(2)", "例6-21(3)", "例6-21(4)", "例6-21(5)", "例6-22", "例6-22(2)", "例6-22(3)", "例6-23", "例6-24", "例6-28", "例6-29", "例6-30", "例6-31", "例6-34", "例6-35", "例6-36", "例6-39", "例6-40", "例6-45", "例6-45(2)", "例6-46", "例6-47", "例6-48", "例6-51", "例6-p176_c1", "例6-p176_c2", "例6-p177_c1", "例6-p177_c2", "例6-p187_c2", "例6-p188_c1", "例6-p188_c2", "例6-p189_c1", "例6-p189_c2", "例6-p190_c1", "例6-p190_c2", "例6-p191_c1", "例6-p204_c1", "例6-p204_c2", "例6-p205_c1", "例6-p207_c2", "例6-p208_c1", "例6-p210_c1", "例6-p210_c2", "例6-p212_c1", "例6-p216_c2", "例6-p217_c1", "例6-p217_c2"], "fileBases": ["ex_6-1_question", "ex_6-2_question", "ex_6-2_question_2", "ex_6-4_question", "ex_6-4_question_2", "ex_6-5_question", "ex_6-5_question_2", "ex_6-5_question_3", "ex_6-5_question_4", "ex_6-5_question_5", "ex_6-6_question", "ex_6-6_question_2", "ex_6-7_question", "ex_6-8_question", "ex_6-9_question", "ex_6-9_question_2", "ex_6-9_question_3", "ex_6-9_question_4", "ex_6-9_question_5", "ex_6-9_question_6", "ex_6-10_question", "ex_6-10_question_2", "ex_6-13_question", "ex_6-14_question", "ex_6-14_question_2", "ex_6-14_question_3", "ex_6-15_question", "ex_6-15_question_2", "ex_6-16_question", "ex_6-16_question_2", "ex_6-16_question_3", "ex_6-17_question", "ex_6-18_question", "ex_6-19_question", "ex_6-20_question", "ex_6-20_question_2", "ex_6-20_question_3", "ex_6-21_question", "ex_6-21_question_2", "ex_6-21_question_3", "ex_6-21_question_4", "ex_6-21_question_5", "ex_6-22_question", "ex_6-22_question_2", "ex_6-22_question_3", "ex_6-23_question", "ex_6-24_question", "ex_6-28_question", "ex_6-29_question", "ex_6-30_question", "ex_6-31_question", "ex_6-34_question", "ex_6-35_question", "ex_6-36_question", "ex_6-39_question", "ex_6-40_question", "ex_6-45_question", "ex_6-45_question_2", "ex_6-46_question", "ex_6-47_question", "ex_6-48_question", "ex_6-51_question", "ex_6-p176_c1_question", "ex_6-p176_c2_question", "ex_6-p177_c1_question", "ex_6-p177_c2_question", "ex_6-p187_c2_question", "ex_6-p188_c1_question", "ex_6-p188_c2_question", "ex_6-p189_c1_question", "ex_6-p189_c2_question", "ex_6-p190_c1_question", "ex_6-p190_c2_question", "ex_6-p191_c1_question", "ex_6-p204_c1_question", "ex_6-p204_c2_question", "ex_6-p205_c1_question", "ex_6-p207_c2_question", "ex_6-p208_c1_question", "ex_6-p210_c1_question", "ex_6-p210_c2_question", "ex_6-p212_c1_question", "ex_6-p216_c2_question", "ex_6-p217_c1_question", "ex_6-p217_c2_question"]},
{"id": "ch213", "number": 213, "name": "吴大正课后刷题本 - 第7章", "short": "第7章", "total": 75, "cols": 5, "wb": "吴大正课后刷题本", "subj": "专业课", "category": "zhuanye", "relPath": "吴大正课后刷题本/第7章", "labels": ["例7-1", "例7-1(2)", "例7-1(3)", "例7-1(4)", "例7-2", "例7-2(2)", "例7-3", "例7-7", "例7-8", "例7-8(2)", "例7-8(3)", "例7-9", "例7-9(2)", "例7-10", "例7-11", "例7-12", "例7-12(2)", "例7-12(3)", "例7-13", "例7-13(2)", "例7-13(3)", "例7-14", "例7-15", "例7-16", "例7-17", "例7-18", "例7-21", "例7-22", "例7-23", "例7-24", "例7-25", "例7-26", "例7-27", "例7-27(2)", "例7-30", "例7-31", "例7-31(2)", "例7-32", "例7-32(2)", "例7-32(3)", "例7-32(4)", "例7-33", "例7-33(2)", "例7-33(3)", "例7-33(4)", "例7-34", "例7-34(2)", "例7-34(3)", "例7-34(4)", "例7-35", "例7-35(2)", "例7-35(3)", "例7-35(4)", "例7-36", "例7-37", "例7-38", "例7-38(2)", "例7-38(3)", "例7-38(4)", "例7-38(5)", "例7-39", "例7-40", "例7-41", "例7-p222_c1", "例7-p222_c2", "例7-p223_c1", "例7-p223_c2", "例7-p224_c1", "例7-p224_c2", "例7-p234_c2", "例7-p235_c1", "例7-p239_c2", "例7-p240_c1", "例7-p240_c2", "例7-p241_c1"], "fileBases": ["ex_7-1_question", "ex_7-1_question_2", "ex_7-1_question_3", "ex_7-1_question_4", "ex_7-2_question", "ex_7-2_question_2", "ex_7-3_question", "ex_7-7_question", "ex_7-8_question", "ex_7-8_question_2", "ex_7-8_question_3", "ex_7-9_question", "ex_7-9_question_2", "ex_7-10_question", "ex_7-11_question", "ex_7-12_question", "ex_7-12_question_2", "ex_7-12_question_3", "ex_7-13_question", "ex_7-13_question_2", "ex_7-13_question_3", "ex_7-14_question", "ex_7-15_question", "ex_7-16_question", "ex_7-17_question", "ex_7-18_question", "ex_7-21_question", "ex_7-22_question", "ex_7-23_question", "ex_7-24_question", "ex_7-25_question", "ex_7-26_question", "ex_7-27_question", "ex_7-27_question_2", "ex_7-30_question", "ex_7-31_question", "ex_7-31_question_2", "ex_7-32_question", "ex_7-32_question_2", "ex_7-32_question_3", "ex_7-32_question_4", "ex_7-33_question", "ex_7-33_question_2", "ex_7-33_question_3", "ex_7-33_question_4", "ex_7-34_question", "ex_7-34_question_2", "ex_7-34_question_3", "ex_7-34_question_4", "ex_7-35_question", "ex_7-35_question_2", "ex_7-35_question_3", "ex_7-35_question_4", "ex_7-36_question", "ex_7-37_question", "ex_7-38_question", "ex_7-38_question_2", "ex_7-38_question_3", "ex_7-38_question_4", "ex_7-38_question_5", "ex_7-39_question", "ex_7-40_question", "ex_7-41_question", "ex_7-p222_c1_question", "ex_7-p222_c2_question", "ex_7-p223_c1_question", "ex_7-p223_c2_question", "ex_7-p224_c1_question", "ex_7-p224_c2_question", "ex_7-p234_c2_question", "ex_7-p235_c1_question", "ex_7-p239_c2_question", "ex_7-p240_c1_question", "ex_7-p240_c2_question", "ex_7-p241_c1_question"]},
{"id": "ch214", "number": 214, "name": "吴大正课后刷题本 - 第8章", "short": "第8章", "total": 39, "cols": 5, "wb": "吴大正课后刷题本", "subj": "专业课", "category": "zhuanye", "relPath": "吴大正课后刷题本/第8章", "labels": ["例8-1", "例8-1(2)", "例8-2", "例8-3", "例8-3(2)", "例8-4", "例8-5", "例8-6", "例8-6(2)", "例8-7", "例8-8", "例8-9", "例8-10", "例8-11", "例8-12", "例8-13", "例8-14", "例8-15", "例8-17", "例8-18", "例8-19", "例8-19(2)", "例8-19(3)", "例8-20", "例8-21", "例8-21(2)", "例8-21(3)", "例8-22", "例8-22(2)", "例8-23", "例8-24", "例8-24(2)", "例8-26", "例8-26(2)", "例8-26(3)", "例8-27", "例8-29", "例8-p272_c2", "例8-p275_c1"], "fileBases": ["ex_8-1_question", "ex_8-1_question_2", "ex_8-2_question", "ex_8-3_question", "ex_8-3_question_2", "ex_8-4_question", "ex_8-5_question", "ex_8-6_question", "ex_8-6_question_2", "ex_8-7_question", "ex_8-8_question", "ex_8-9_question", "ex_8-10_question", "ex_8-11_question", "ex_8-12_question", "ex_8-13_question", "ex_8-14_question", "ex_8-15_question", "ex_8-17_question", "ex_8-18_question", "ex_8-19_question", "ex_8-19_question_2", "ex_8-19_question_3", "ex_8-20_question", "ex_8-21_question", "ex_8-21_question_2", "ex_8-21_question_3", "ex_8-22_question", "ex_8-22_question_2", "ex_8-23_question", "ex_8-24_question", "ex_8-24_question_2", "ex_8-26_question", "ex_8-26_question_2", "ex_8-26_question_3", "ex_8-27_question", "ex_8-29_question", "ex_8-p272_c2_question", "ex_8-p275_c1_question"]},
{"id": "ch215", "number": 215, "name": "奥本海姆课后刷题本 - 第1章", "short": "第1章", "total": 147, "cols": 5, "wb": "奥本海姆课后刷题本", "subj": "专业课", "category": "zhuanye", "relPath": "奥本海姆课后刷题本/第1章", "labels": ["例1-1", "例1-2", "例1-3", "例1-3(2)", "例1-4", "例1-4(2)", "例1-4(3)", "例1-5", "例1-5(2)", "例1-5(3)", "例1-6", "例1-6(2)", "例1-7", "例1-7(2)", "例1-9", "例1-9(2)", "例1-10", "例1-11", "例1-12", "例1-13", "例1-15", "例1-15(2)", "例1-16", "例1-17", "例1-18", "例1-19", "例1-19(2)", "例1-21", "例1-21(2)", "例1-21(3)", "例1-22", "例1-22(2)", "例1-22(3)", "例1-23", "例1-23(2)", "例1-23(3)", "例1-24", "例1-24(2)", "例1-24(3)", "例1-25", "例1-25(2)", "例1-25(3)", "例1-26", "例1-26(2)", "例1-26(3)", "例1-27", "例1-27(2)", "例1-27(3)", "例1-27(4)", "例1-27(5)", "例1-27(6)", "例1-27(7)", "例1-28", "例1-28(2)", "例1-28(3)", "例1-28(4)", "例1-30", "例1-30(2)", "例1-30(3)", "例1-30(4)", "例1-30(5)", "例1-30(6)", "例1-30(7)", "例1-31", "例1-31(2)", "例1-32", "例1-33", "例1-34", "例1-34(2)", "例1-34(3)", "例1-34(4)", "例1-35", "例1-37", "例1-37(2)", "例1-37(3)", "例1-38", "例1-38(2)", "例1-39", "例1-40", "例1-40(2)", "例1-40(3)", "例1-41", "例1-41(2)", "例1-41(3)", "例1-42", "例1-43", "例1-43(2)", "例1-45", "例1-45(2)", "例1-46", "例1-46(2)", "例1-47", "例1-47(2)", "例1-47(3)", "例1-47(4)", "例1-48", "例1-48(2)", "例1-48(3)", "例1-48(4)", "例1-48(5)", "例1-49", "例1-49(2)", "例1-49(3)", "例1-49(4)", "例1-49(5)", "例1-49(6)", "例1-50", "例1-50(2)", "例1-50(3)", "例1-51", "例1-51(2)", "例1-51(3)", "例1-53", "例1-53(2)", "例1-53(3)", "例1-53(4)", "例1-54", "例1-54(2)", "例1-54(3)", "例1-54(4)", "例1-55", "例1-55(2)", "例1-55(3)", "例1-p1_c1", "例1-p3_c1", "例1-p9_c1", "例1-p9_c2", "例1-p13_c1", "例1-p17_c1", "例1-p17_c2", "例1-p40_c2", "例1-p41_c1", "例1-p41_c2", "例1-p49_c2", "例1-p50_c1", "例1-p50_c2", "例1-p51_c1", "例1-p51_c2", "例1-p64_c2", "例1-p65_c1", "例1-p65_c2", "例1-p66_c1", "例1-p66_c2", "例1-p67_c1", "例1-p73_c1", "例1-p73_c2", "例1-p74_c1"], "fileBases": ["ex_1-1_question", "ex_1-2_question", "ex_1-3_question", "ex_1-3_question_2", "ex_1-4_question", "ex_1-4_question_2", "ex_1-4_question_3", "ex_1-5_question", "ex_1-5_question_2", "ex_1-5_question_3", "ex_1-6_question", "ex_1-6_question_2", "ex_1-7_question", "ex_1-7_question_2", "ex_1-9_question", "ex_1-9_question_2", "ex_1-10_question", "ex_1-11_question", "ex_1-12_question", "ex_1-13_question", "ex_1-15_question", "ex_1-15_question_2", "ex_1-16_question", "ex_1-17_question", "ex_1-18_question", "ex_1-19_question", "ex_1-19_question_2", "ex_1-21_question", "ex_1-21_question_2", "ex_1-21_question_3", "ex_1-22_question", "ex_1-22_question_2", "ex_1-22_question_3", "ex_1-23_question", "ex_1-23_question_2", "ex_1-23_question_3", "ex_1-24_question", "ex_1-24_question_2", "ex_1-24_question_3", "ex_1-25_question", "ex_1-25_question_2", "ex_1-25_question_3", "ex_1-26_question", "ex_1-26_question_2", "ex_1-26_question_3", "ex_1-27_question", "ex_1-27_question_2", "ex_1-27_question_3", "ex_1-27_question_4", "ex_1-27_question_5", "ex_1-27_question_6", "ex_1-27_question_7", "ex_1-28_question", "ex_1-28_question_2", "ex_1-28_question_3", "ex_1-28_question_4", "ex_1-30_question", "ex_1-30_question_2", "ex_1-30_question_3", "ex_1-30_question_4", "ex_1-30_question_5", "ex_1-30_question_6", "ex_1-30_question_7", "ex_1-31_question", "ex_1-31_question_2", "ex_1-32_question", "ex_1-33_question", "ex_1-34_question", "ex_1-34_question_2", "ex_1-34_question_3", "ex_1-34_question_4", "ex_1-35_question", "ex_1-37_question", "ex_1-37_question_2", "ex_1-37_question_3", "ex_1-38_question", "ex_1-38_question_2", "ex_1-39_question", "ex_1-40_question", "ex_1-40_question_2", "ex_1-40_question_3", "ex_1-41_question", "ex_1-41_question_2", "ex_1-41_question_3", "ex_1-42_question", "ex_1-43_question", "ex_1-43_question_2", "ex_1-45_question", "ex_1-45_question_2", "ex_1-46_question", "ex_1-46_question_2", "ex_1-47_question", "ex_1-47_question_2", "ex_1-47_question_3", "ex_1-47_question_4", "ex_1-48_question", "ex_1-48_question_2", "ex_1-48_question_3", "ex_1-48_question_4", "ex_1-48_question_5", "ex_1-49_question", "ex_1-49_question_2", "ex_1-49_question_3", "ex_1-49_question_4", "ex_1-49_question_5", "ex_1-49_question_6", "ex_1-50_question", "ex_1-50_question_2", "ex_1-50_question_3", "ex_1-51_question", "ex_1-51_question_2", "ex_1-51_question_3", "ex_1-53_question", "ex_1-53_question_2", "ex_1-53_question_3", "ex_1-53_question_4", "ex_1-54_question", "ex_1-54_question_2", "ex_1-54_question_3", "ex_1-54_question_4", "ex_1-55_question", "ex_1-55_question_2", "ex_1-55_question_3", "ex_1-p1_c1_question", "ex_1-p3_c1_question", "ex_1-p9_c1_question", "ex_1-p9_c2_question", "ex_1-p13_c1_question", "ex_1-p17_c1_question", "ex_1-p17_c2_question", "ex_1-p40_c2_question", "ex_1-p41_c1_question", "ex_1-p41_c2_question", "ex_1-p49_c2_question", "ex_1-p50_c1_question", "ex_1-p50_c2_question", "ex_1-p51_c1_question", "ex_1-p51_c2_question", "ex_1-p64_c2_question", "ex_1-p65_c1_question", "ex_1-p65_c2_question", "ex_1-p66_c1_question", "ex_1-p66_c2_question", "ex_1-p67_c1_question", "ex_1-p73_c1_question", "ex_1-p73_c2_question", "ex_1-p74_c1_question"]},
{"id": "ch216", "number": 216, "name": "奥本海姆课后刷题本 - 第2章", "short": "第2章", "total": 125, "cols": 5, "wb": "奥本海姆课后刷题本", "subj": "专业课", "category": "zhuanye", "relPath": "奥本海姆课后刷题本/第2章", "labels": ["例2-1", "例2-1(2)", "例2-1(3)", "例2-2", "例2-3", "例2-7", "例2-7(2)", "例2-7(3)", "例2-7(4)", "例2-8", "例2-9", "例2-12", "例2-13", "例2-15", "例2-15(2)", "例2-16", "例2-18", "例2-19", "例2-19(2)", "例2-20", "例2-20(2)", "例2-20(3)", "例2-21", "例2-21(2)", "例2-21(3)", "例2-21(4)", "例2-21(5)", "例2-22", "例2-22(2)", "例2-22(3)", "例2-22(4)", "例2-22(5)", "例2-23", "例2-23(2)", "例2-23(3)", "例2-23(4)", "例2-24", "例2-24(2)", "例2-25", "例2-25(2)", "例2-26", "例2-26(2)", "例2-26(3)", "例2-26(4)", "例2-27", "例2-28", "例2-28(2)", "例2-28(3)", "例2-28(4)", "例2-29", "例2-29(2)", "例2-29(3)", "例2-29(4)", "例2-30", "例2-32", "例2-32(2)", "例2-32(3)", "例2-33", "例2-33(2)", "例2-33(3)", "例2-33(4)", "例2-33(5)", "例2-33(6)", "例2-33(7)", "例2-34", "例2-34(2)", "例2-34(3)", "例2-34(4)", "例2-34(5)", "例2-35", "例2-36", "例2-36(2)", "例2-37", "例2-38", "例2-38(2)", "例2-39", "例2-39(2)", "例2-40", "例2-41", "例2-41(2)", "例2-42", "例2-42(2)", "例2-43", "例2-43(2)", "例2-43(3)", "例2-43(4)", "例2-44", "例2-44(2)", "例2-44(3)", "例2-44(4)", "例2-45", "例2-45(2)", "例2-45(3)", "例2-45(4)", "例2-46", "例2-47", "例2-48", "例2-48(2)", "例2-49", "例2-49(2)", "例2-49(3)", "例2-50", "例2-50(2)", "例2-51", "例2-51(2)", "例2-51(3)", "例2-52", "例2-53", "例2-53(2)", "例2-53(3)", "例2-p77_c1", "例2-p77_c2", "例2-p78_c1", "例2-p81_c2", "例2-p82_c1", "例2-p82_c2", "例2-p83_c1", "例2-p83_c2", "例2-p85_c1", "例2-p85_c2", "例2-p87_c2", "例2-p88_c1", "例2-p107_c1", "例2-p114_c2", "例2-p129_c1"], "fileBases": ["ex_2-1_question", "ex_2-1_question_2", "ex_2-1_question_3", "ex_2-2_question", "ex_2-3_question", "ex_2-7_question", "ex_2-7_question_2", "ex_2-7_question_3", "ex_2-7_question_4", "ex_2-8_question", "ex_2-9_question", "ex_2-12_question", "ex_2-13_question", "ex_2-15_question", "ex_2-15_question_2", "ex_2-16_question", "ex_2-18_question", "ex_2-19_question", "ex_2-19_question_2", "ex_2-20_question", "ex_2-20_question_2", "ex_2-20_question_3", "ex_2-21_question", "ex_2-21_question_2", "ex_2-21_question_3", "ex_2-21_question_4", "ex_2-21_question_5", "ex_2-22_question", "ex_2-22_question_2", "ex_2-22_question_3", "ex_2-22_question_4", "ex_2-22_question_5", "ex_2-23_question", "ex_2-23_question_2", "ex_2-23_question_3", "ex_2-23_question_4", "ex_2-24_question", "ex_2-24_question_2", "ex_2-25_question", "ex_2-25_question_2", "ex_2-26_question", "ex_2-26_question_2", "ex_2-26_question_3", "ex_2-26_question_4", "ex_2-27_question", "ex_2-28_question", "ex_2-28_question_2", "ex_2-28_question_3", "ex_2-28_question_4", "ex_2-29_question", "ex_2-29_question_2", "ex_2-29_question_3", "ex_2-29_question_4", "ex_2-30_question", "ex_2-32_question", "ex_2-32_question_2", "ex_2-32_question_3", "ex_2-33_question", "ex_2-33_question_2", "ex_2-33_question_3", "ex_2-33_question_4", "ex_2-33_question_5", "ex_2-33_question_6", "ex_2-33_question_7", "ex_2-34_question", "ex_2-34_question_2", "ex_2-34_question_3", "ex_2-34_question_4", "ex_2-34_question_5", "ex_2-35_question", "ex_2-36_question", "ex_2-36_question_2", "ex_2-37_question", "ex_2-38_question", "ex_2-38_question_2", "ex_2-39_question", "ex_2-39_question_2", "ex_2-40_question", "ex_2-41_question", "ex_2-41_question_2", "ex_2-42_question", "ex_2-42_question_2", "ex_2-43_question", "ex_2-43_question_2", "ex_2-43_question_3", "ex_2-43_question_4", "ex_2-44_question", "ex_2-44_question_2", "ex_2-44_question_3", "ex_2-44_question_4", "ex_2-45_question", "ex_2-45_question_2", "ex_2-45_question_3", "ex_2-45_question_4", "ex_2-46_question", "ex_2-47_question", "ex_2-48_question", "ex_2-48_question_2", "ex_2-49_question", "ex_2-49_question_2", "ex_2-49_question_3", "ex_2-50_question", "ex_2-50_question_2", "ex_2-51_question", "ex_2-51_question_2", "ex_2-51_question_3", "ex_2-52_question", "ex_2-53_question", "ex_2-53_question_2", "ex_2-53_question_3", "ex_2-p77_c1_question", "ex_2-p77_c2_question", "ex_2-p78_c1_question", "ex_2-p81_c2_question", "ex_2-p82_c1_question", "ex_2-p82_c2_question", "ex_2-p83_c1_question", "ex_2-p83_c2_question", "ex_2-p85_c1_question", "ex_2-p85_c2_question", "ex_2-p87_c2_question", "ex_2-p88_c1_question", "ex_2-p107_c1_question", "ex_2-p114_c2_question", "ex_2-p129_c1_question"]},
{"id": "ch217", "number": 217, "name": "奥本海姆课后刷题本 - 第3章", "short": "第3章", "total": 17, "cols": 5, "wb": "奥本海姆课后刷题本", "subj": "专业课", "category": "zhuanye", "relPath": "奥本海姆课后刷题本/第3章", "labels": ["例3-3", "例3-8", "例3-11", "例3-13", "例3-14", "例3-16", "例3-27", "例3-34", "例3-41", "例3-42", "例3-42(2)", "例3-42(3)", "例3-42(4)", "例3-42(5)", "例3-44", "例3-63", "例3-63(2)"], "fileBases": ["ex_3-3_question", "ex_3-8_question", "ex_3-11_question", "ex_3-13_question", "ex_3-14_question", "ex_3-16_question", "ex_3-27_question", "ex_3-34_question", "ex_3-41_question", "ex_3-42_question", "ex_3-42_question_2", "ex_3-42_question_3", "ex_3-42_question_4", "ex_3-42_question_5", "ex_3-44_question", "ex_3-63_question", "ex_3-63_question_2"]},
{"id": "ch218", "number": 218, "name": "奥本海姆课后刷题本 - 第4章", "short": "第4章", "total": 14, "cols": 5, "wb": "奥本海姆课后刷题本", "subj": "专业课", "category": "zhuanye", "relPath": "奥本海姆课后刷题本/第4章", "labels": ["例4-10", "例4-11", "例4-17", "例4-18", "例4-21", "例4-21(2)", "例4-21(3)", "例4-21(4)", "例4-21(5)", "例4-36", "例4-41", "例4-41(2)", "例4-41(3)", "例4-44"], "fileBases": ["ex_4-10_question", "ex_4-11_question", "ex_4-17_question", "ex_4-18_question", "ex_4-21_question", "ex_4-21_question_2", "ex_4-21_question_3", "ex_4-21_question_4", "ex_4-21_question_5", "ex_4-36_question", "ex_4-41_question", "ex_4-41_question_2", "ex_4-41_question_3", "ex_4-44_question"]},
{"id": "ch219", "number": 219, "name": "奥本海姆课后刷题本 - 第5章", "short": "第5章", "total": 21, "cols": 5, "wb": "奥本海姆课后刷题本", "subj": "专业课", "category": "zhuanye", "relPath": "奥本海姆课后刷题本/第5章", "labels": ["例5-8", "例5-9", "例5-12", "例5-14", "例5-15", "例5-19", "例5-21", "例5-21(2)", "例5-21(3)", "例5-21(4)", "例5-21(5)", "例5-21(6)", "例5-22", "例5-22(2)", "例5-22(3)", "例5-22(4)", "例5-22(5)", "例5-22(6)", "例5-22(7)", "例5-22(8)", "例5-23"], "fileBases": ["ex_5-8_question", "ex_5-9_question", "ex_5-12_question", "ex_5-14_question", "ex_5-15_question", "ex_5-19_question", "ex_5-21_question", "ex_5-21_question_2", "ex_5-21_question_3", "ex_5-21_question_4", "ex_5-21_question_5", "ex_5-21_question_6", "ex_5-22_question", "ex_5-22_question_2", "ex_5-22_question_3", "ex_5-22_question_4", "ex_5-22_question_5", "ex_5-22_question_6", "ex_5-22_question_7", "ex_5-22_question_8", "ex_5-23_question"]},
{"id": "ch220", "number": 220, "name": "奥本海姆课后刷题本 - 第6章", "short": "第6章", "total": 4, "cols": 5, "wb": "奥本海姆课后刷题本", "subj": "专业课", "category": "zhuanye", "relPath": "奥本海姆课后刷题本/第6章", "labels": ["例6-5", "例6-21", "例6-22", "例6-44"], "fileBases": ["ex_6-5_question", "ex_6-21_question", "ex_6-22_question", "ex_6-44_question"]},
{"id": "ch221", "number": 221, "name": "奥本海姆课后刷题本 - 第7章", "short": "第7章", "total": 11, "cols": 5, "wb": "奥本海姆课后刷题本", "subj": "专业课", "category": "zhuanye", "relPath": "奥本海姆课后刷题本/第7章", "labels": ["例7-3", "例7-3(2)", "例7-3(3)", "例7-4", "例7-8", "例7-21", "例7-21(2)", "例7-21(3)", "例7-21(4)", "例7-27", "例7-28"], "fileBases": ["ex_7-3_question", "ex_7-3_question_2", "ex_7-3_question_3", "ex_7-4_question", "ex_7-8_question", "ex_7-21_question", "ex_7-21_question_2", "ex_7-21_question_3", "ex_7-21_question_4", "ex_7-27_question", "ex_7-28_question"]},
{"id": "ch222", "number": 222, "name": "奥本海姆课后刷题本 - 第8章", "short": "第8章", "total": 7, "cols": 5, "wb": "奥本海姆课后刷题本", "subj": "专业课", "category": "zhuanye", "relPath": "奥本海姆课后刷题本/第8章", "labels": ["例8-4", "例8-8", "例8-18", "例8-22", "例8-26", "例8-30", "例8-34"], "fileBases": ["ex_8-4_question", "ex_8-8_question", "ex_8-18_question", "ex_8-22_question", "ex_8-26_question", "ex_8-30_question", "ex_8-34_question"]},
{"id": "ch223", "number": 223, "name": "奥本海姆课后刷题本 - 第9章", "short": "第9章", "total": 24, "cols": 5, "wb": "奥本海姆课后刷题本", "subj": "专业课", "category": "zhuanye", "relPath": "奥本海姆课后刷题本/第9章", "labels": ["例9-6", "例9-10", "例9-10(2)", "例9-14", "例9-21", "例9-21(2)", "例9-21(3)", "例9-21(4)", "例9-21(5)", "例9-22", "例9-22(2)", "例9-22(3)", "例9-22(4)", "例9-23", "例9-27", "例9-33", "例9-34", "例9-37", "例9-37(2)", "例9-41", "例9-42", "例9-44", "例9-45", "例9-p185_c1"], "fileBases": ["ex_9-6_question", "ex_9-10_question", "ex_9-10_question_2", "ex_9-14_question", "ex_9-21_question", "ex_9-21_question_2", "ex_9-21_question_3", "ex_9-21_question_4", "ex_9-21_question_5", "ex_9-22_question", "ex_9-22_question_2", "ex_9-22_question_3", "ex_9-22_question_4", "ex_9-23_question", "ex_9-27_question", "ex_9-33_question", "ex_9-34_question", "ex_9-37_question", "ex_9-37_question_2", "ex_9-41_question", "ex_9-42_question", "ex_9-44_question", "ex_9-45_question", "ex_9-p185_c1_question"]},
{"id": "ch224", "number": 224, "name": "奥本海姆课后刷题本 - 第10章", "short": "第10章", "total": 11, "cols": 5, "wb": "奥本海姆课后刷题本", "subj": "专业课", "category": "zhuanye", "relPath": "奥本海姆课后刷题本/第10章", "labels": ["例10-9", "例10-21", "例10-21(2)", "例10-21(3)", "例10-21(4)", "例10-31", "例10-37", "例10-43", "例10-46", "例10-47", "例10-59"], "fileBases": ["ex_10-9_question", "ex_10-21_question", "ex_10-21_question_2", "ex_10-21_question_3", "ex_10-21_question_4", "ex_10-31_question", "ex_10-37_question", "ex_10-43_question", "ex_10-46_question", "ex_10-47_question", "ex_10-59_question"]},
{"id": "ch225", "number": 225, "name": "奥本海姆课后刷题本 - 第24章", "short": "第24章", "total": 1, "cols": 5, "wb": "奥本海姆课后刷题本", "subj": "专业课", "category": "zhuanye", "relPath": "奥本海姆课后刷题本/第24章", "labels": ["例24-4"], "fileBases": ["ex_24-4_question"]},
{"id": "ch226", "number": 226, "name": "杨晓非课后刷题本 - 第1章", "short": "第1章", "total": 29, "cols": 5, "wb": "杨晓非课后刷题本", "subj": "专业课", "category": "zhuanye", "relPath": "杨晓非课后刷题本/第1章", "labels": ["例1-2", "例1-2(2)", "例1-2(3)", "例1-7", "例1-9", "例1-9(2)", "例1-9(3)", "例1-9(4)", "例1-9(5)", "例1-23", "例1-23(2)", "例1-23(3)", "例1-23(4)", "例1-24", "例1-24(2)", "例1-24(3)", "例1-24(4)", "例1-24(5)", "例1-24(6)", "例1-24(7)", "例1-27", "例1-27(2)", "例1-28", "例1-p1_c1", "例1-p6_c1", "例1-p6_c2", "例1-p7_c1", "例1-p7_c2", "例1-p8_c1"], "fileBases": ["ex_1-2_question", "ex_1-2_question_2", "ex_1-2_question_3", "ex_1-7_question", "ex_1-9_question", "ex_1-9_question_2", "ex_1-9_question_3", "ex_1-9_question_4", "ex_1-9_question_5", "ex_1-23_question", "ex_1-23_question_2", "ex_1-23_question_3", "ex_1-23_question_4", "ex_1-24_question", "ex_1-24_question_2", "ex_1-24_question_3", "ex_1-24_question_4", "ex_1-24_question_5", "ex_1-24_question_6", "ex_1-24_question_7", "ex_1-27_question", "ex_1-27_question_2", "ex_1-28_question", "ex_1-p1_c1_question", "ex_1-p6_c1_question", "ex_1-p6_c2_question", "ex_1-p7_c1_question", "ex_1-p7_c2_question", "ex_1-p8_c1_question"]},
{"id": "ch227", "number": 227, "name": "杨晓非课后刷题本 - 第2章", "short": "第2章", "total": 23, "cols": 5, "wb": "杨晓非课后刷题本", "subj": "专业课", "category": "zhuanye", "relPath": "杨晓非课后刷题本/第2章", "labels": ["例2-1", "例2-2", "例2-2(2)", "例2-2(3)", "例2-2(4)", "例2-3", "例2-3(2)", "例2-3(3)", "例2-6", "例2-6(2)", "例2-16", "例2-16(2)", "例2-16(3)", "例2-19", "例2-19(2)", "例2-19(3)", "例2-20", "例2-20(2)", "例2-21", "例2-25", "例2-26", "例2-37", "例2-38"], "fileBases": ["ex_2-1_question", "ex_2-2_question", "ex_2-2_question_2", "ex_2-2_question_3", "ex_2-2_question_4", "ex_2-3_question", "ex_2-3_question_2", "ex_2-3_question_3", "ex_2-6_question", "ex_2-6_question_2", "ex_2-16_question", "ex_2-16_question_2", "ex_2-16_question_3", "ex_2-19_question", "ex_2-19_question_2", "ex_2-19_question_3", "ex_2-20_question", "ex_2-20_question_2", "ex_2-21_question", "ex_2-25_question", "ex_2-26_question", "ex_2-37_question", "ex_2-38_question"]},
{"id": "ch228", "number": 228, "name": "杨晓非课后刷题本 - 第3章", "short": "第3章", "total": 59, "cols": 5, "wb": "杨晓非课后刷题本", "subj": "专业课", "category": "zhuanye", "relPath": "杨晓非课后刷题本/第3章", "labels": ["例3-2", "例3-4", "例3-6", "例3-6(2)", "例3-7", "例3-9", "例3-9(2)", "例3-14", "例3-15", "例3-17", "例3-17(2)", "例3-17(3)", "例3-18", "例3-18(2)", "例3-19", "例3-19(2)", "例3-20", "例3-20(2)", "例3-21", "例3-22", "例3-23", "例3-23(2)", "例3-23(3)", "例3-23(4)", "例3-24", "例3-24(2)", "例3-25", "例3-25(2)", "例3-26", "例3-26(2)", "例3-26(3)", "例3-26(4)", "例3-26(5)", "例3-26(6)", "例3-27", "例3-38", "例3-42", "例3-44", "例3-44(2)", "例3-50", "例3-50(2)", "例3-51", "例3-52", "例3-52(2)", "例3-53", "例3-54", "例3-55", "例3-56", "例3-57", "例3-57(2)", "例3-57(3)", "例3-p27_c2", "例3-p32_c1", "例3-p32_c2", "例3-p33_c1", "例3-p46_c2", "例3-p47_c1", "例3-p47_c2", "例3-p49_c1"], "fileBases": ["ex_3-2_question", "ex_3-4_question", "ex_3-6_question", "ex_3-6_question_2", "ex_3-7_question", "ex_3-9_question", "ex_3-9_question_2", "ex_3-14_question", "ex_3-15_question", "ex_3-17_question", "ex_3-17_question_2", "ex_3-17_question_3", "ex_3-18_question", "ex_3-18_question_2", "ex_3-19_question", "ex_3-19_question_2", "ex_3-20_question", "ex_3-20_question_2", "ex_3-21_question", "ex_3-22_question", "ex_3-23_question", "ex_3-23_question_2", "ex_3-23_question_3", "ex_3-23_question_4", "ex_3-24_question", "ex_3-24_question_2", "ex_3-25_question", "ex_3-25_question_2", "ex_3-26_question", "ex_3-26_question_2", "ex_3-26_question_3", "ex_3-26_question_4", "ex_3-26_question_5", "ex_3-26_question_6", "ex_3-27_question", "ex_3-38_question", "ex_3-42_question", "ex_3-44_question", "ex_3-44_question_2", "ex_3-50_question", "ex_3-50_question_2", "ex_3-51_question", "ex_3-52_question", "ex_3-52_question_2", "ex_3-53_question", "ex_3-54_question", "ex_3-55_question", "ex_3-56_question", "ex_3-57_question", "ex_3-57_question_2", "ex_3-57_question_3", "ex_3-p27_c2_question", "ex_3-p32_c1_question", "ex_3-p32_c2_question", "ex_3-p33_c1_question", "ex_3-p46_c2_question", "ex_3-p47_c1_question", "ex_3-p47_c2_question", "ex_3-p49_c1_question"]},
{"id": "ch229", "number": 229, "name": "杨晓非课后刷题本 - 第4章", "short": "第4章", "total": 30, "cols": 5, "wb": "杨晓非课后刷题本", "subj": "专业课", "category": "zhuanye", "relPath": "杨晓非课后刷题本/第4章", "labels": ["例4-3", "例4-3(2)", "例4-5", "例4-5(2)", "例4-5(3)", "例4-5(4)", "例4-6", "例4-6(2)", "例4-18", "例4-31", "例4-31(2)", "例4-31(3)", "例4-36", "例4-38", "例4-38(2)", "例4-38(3)", "例4-40", "例4-46", "例4-47", "例4-48", "例4-53", "例4-53(2)", "例4-53(3)", "例4-p57_c2", "例4-p61_c1", "例4-p61_c2", "例4-p62_c1", "例4-p62_c2", "例4-p63_c1", "例4-p64_c1"], "fileBases": ["ex_4-3_question", "ex_4-3_question_2", "ex_4-5_question", "ex_4-5_question_2", "ex_4-5_question_3", "ex_4-5_question_4", "ex_4-6_question", "ex_4-6_question_2", "ex_4-18_question", "ex_4-31_question", "ex_4-31_question_2", "ex_4-31_question_3", "ex_4-36_question", "ex_4-38_question", "ex_4-38_question_2", "ex_4-38_question_3", "ex_4-40_question", "ex_4-46_question", "ex_4-47_question", "ex_4-48_question", "ex_4-53_question", "ex_4-53_question_2", "ex_4-53_question_3", "ex_4-p57_c2_question", "ex_4-p61_c1_question", "ex_4-p61_c2_question", "ex_4-p62_c1_question", "ex_4-p62_c2_question", "ex_4-p63_c1_question", "ex_4-p64_c1_question"]},
{"id": "ch230", "number": 230, "name": "杨晓非课后刷题本 - 第5章", "short": "第5章", "total": 34, "cols": 5, "wb": "杨晓非课后刷题本", "subj": "专业课", "category": "zhuanye", "relPath": "杨晓非课后刷题本/第5章", "labels": ["例5-1", "例5-1(2)", "例5-1(3)", "例5-1(4)", "例5-1(5)", "例5-2", "例5-2(2)", "例5-2(3)", "例5-2(4)", "例5-11", "例5-11(2)", "例5-11(3)", "例5-14", "例5-14(2)", "例5-14(3)", "例5-14(4)", "例5-15", "例5-15(2)", "例5-15(3)", "例5-20", "例5-21", "例5-23", "例5-24", "例5-26", "例5-27", "例5-31", "例5-32", "例5-33", "例5-38", "例5-39", "例5-40", "例5-41", "例5-45", "例5-p77_c2"], "fileBases": ["ex_5-1_question", "ex_5-1_question_2", "ex_5-1_question_3", "ex_5-1_question_4", "ex_5-1_question_5", "ex_5-2_question", "ex_5-2_question_2", "ex_5-2_question_3", "ex_5-2_question_4", "ex_5-11_question", "ex_5-11_question_2", "ex_5-11_question_3", "ex_5-14_question", "ex_5-14_question_2", "ex_5-14_question_3", "ex_5-14_question_4", "ex_5-15_question", "ex_5-15_question_2", "ex_5-15_question_3", "ex_5-20_question", "ex_5-21_question", "ex_5-23_question", "ex_5-24_question", "ex_5-26_question", "ex_5-27_question", "ex_5-31_question", "ex_5-32_question", "ex_5-33_question", "ex_5-38_question", "ex_5-39_question", "ex_5-40_question", "ex_5-41_question", "ex_5-45_question", "ex_5-p77_c2_question"]},
{"id": "ch231", "number": 231, "name": "管致中课后刷题本 - 第1章", "short": "第1章", "total": 13, "cols": 5, "wb": "管致中课后刷题本", "subj": "专业课", "category": "zhuanye", "relPath": "管致中课后刷题本/第1章", "labels": ["例1-2", "例1-2(2)", "例1-2(3)", "例1-2(4)", "例1-3", "例1-3(2)", "例1-3(3)", "例1-6", "例1-8", "例1-8(2)", "例1-10", "例1-11", "例1-p1_c1"], "fileBases": ["ex_1-2_question", "ex_1-2_question_2", "ex_1-2_question_3", "ex_1-2_question_4", "ex_1-3_question", "ex_1-3_question_2", "ex_1-3_question_3", "ex_1-6_question", "ex_1-8_question", "ex_1-8_question_2", "ex_1-10_question", "ex_1-11_question", "ex_1-p1_c1_question"]},
{"id": "ch232", "number": 232, "name": "管致中课后刷题本 - 第2章", "short": "第2章", "total": 17, "cols": 5, "wb": "管致中课后刷题本", "subj": "专业课", "category": "zhuanye", "relPath": "管致中课后刷题本/第2章", "labels": ["例2-5", "例2-7", "例2-7(2)", "例2-10", "例2-10(2)", "例2-10(3)", "例2-15", "例2-16", "例2-16(2)", "例2-16(3)", "例2-16(4)", "例2-17", "例2-20", "例2-20(2)", "例2-20(3)", "例2-20(4)", "例2-p15_c2"], "fileBases": ["ex_2-5_question", "ex_2-7_question", "ex_2-7_question_2", "ex_2-10_question", "ex_2-10_question_2", "ex_2-10_question_3", "ex_2-15_question", "ex_2-16_question", "ex_2-16_question_2", "ex_2-16_question_3", "ex_2-16_question_4", "ex_2-17_question", "ex_2-20_question", "ex_2-20_question_2", "ex_2-20_question_3", "ex_2-20_question_4", "ex_2-p15_c2_question"]},
{"id": "ch233", "number": 233, "name": "管致中课后刷题本 - 第3章", "short": "第3章", "total": 10, "cols": 5, "wb": "管致中课后刷题本", "subj": "专业课", "category": "zhuanye", "relPath": "管致中课后刷题本/第3章", "labels": ["例3-6", "例3-9", "例3-13", "例3-14", "例3-14(2)", "例3-15", "例3-15(2)", "例3-p19_c2", "例3-p20_c1", "例3-p20_c2"], "fileBases": ["ex_3-6_question", "ex_3-9_question", "ex_3-13_question", "ex_3-14_question", "ex_3-14_question_2", "ex_3-15_question", "ex_3-15_question_2", "ex_3-p19_c2_question", "ex_3-p20_c1_question", "ex_3-p20_c2_question"]},
{"id": "ch234", "number": 234, "name": "管致中课后刷题本 - 第4章", "short": "第4章", "total": 6, "cols": 5, "wb": "管致中课后刷题本", "subj": "专业课", "category": "zhuanye", "relPath": "管致中课后刷题本/第4章", "labels": ["例4-4", "例4-6", "例4-7", "例4-8", "例4-10", "例4-13"], "fileBases": ["ex_4-4_question", "ex_4-6_question", "ex_4-7_question", "ex_4-8_question", "ex_4-10_question", "ex_4-13_question"]},
{"id": "ch235", "number": 235, "name": "管致中课后刷题本 - 第5章", "short": "第5章", "total": 27, "cols": 5, "wb": "管致中课后刷题本", "subj": "专业课", "category": "zhuanye", "relPath": "管致中课后刷题本/第5章", "labels": ["例5-3", "例5-3(2)", "例5-3(3)", "例5-3(4)", "例5-4", "例5-4(2)", "例5-4(3)", "例5-5", "例5-5(2)", "例5-13", "例5-13(2)", "例5-14", "例5-14(2)", "例5-15", "例5-15(2)", "例5-15(3)", "例5-23", "例5-24", "例5-25", "例5-28", "例5-29", "例5-33", "例5-p32_c1", "例5-p32_c2", "例5-p33_c1", "例5-p33_c2", "例5-p34_c1"], "fileBases": ["ex_5-3_question", "ex_5-3_question_2", "ex_5-3_question_3", "ex_5-3_question_4", "ex_5-4_question", "ex_5-4_question_2", "ex_5-4_question_3", "ex_5-5_question", "ex_5-5_question_2", "ex_5-13_question", "ex_5-13_question_2", "ex_5-14_question", "ex_5-14_question_2", "ex_5-15_question", "ex_5-15_question_2", "ex_5-15_question_3", "ex_5-23_question", "ex_5-24_question", "ex_5-25_question", "ex_5-28_question", "ex_5-29_question", "ex_5-33_question", "ex_5-p32_c1_question", "ex_5-p32_c2_question", "ex_5-p33_c1_question", "ex_5-p33_c2_question", "ex_5-p34_c1_question"]},
{"id": "ch236", "number": 236, "name": "管致中课后刷题本 - 第6章", "short": "第6章", "total": 3, "cols": 5, "wb": "管致中课后刷题本", "subj": "专业课", "category": "zhuanye", "relPath": "管致中课后刷题本/第6章", "labels": ["例6-9", "例6-10", "例6-p38_c2"], "fileBases": ["ex_6-9_question", "ex_6-10_question", "ex_6-p38_c2_question"]},
{"id": "ch237", "number": 237, "name": "管致中课后刷题本 - 第7章", "short": "第7章", "total": 12, "cols": 5, "wb": "管致中课后刷题本", "subj": "专业课", "category": "zhuanye", "relPath": "管致中课后刷题本/第7章", "labels": ["例7-14", "例7-14(2)", "例7-14(3)", "例7-14(4)", "例7-21", "例7-24", "例7-24(2)", "例7-27", "例7-29", "例7-29(2)", "例7-31", "例7-p44_c1"], "fileBases": ["ex_7-14_question", "ex_7-14_question_2", "ex_7-14_question_3", "ex_7-14_question_4", "ex_7-21_question", "ex_7-24_question", "ex_7-24_question_2", "ex_7-27_question", "ex_7-29_question", "ex_7-29_question_2", "ex_7-31_question", "ex_7-p44_c1_question"]},
{"id": "ch238", "number": 238, "name": "管致中课后刷题本 - 第8章", "short": "第8章", "total": 18, "cols": 5, "wb": "管致中课后刷题本", "subj": "专业课", "category": "zhuanye", "relPath": "管致中课后刷题本/第8章", "labels": ["例8-2", "例8-2(2)", "例8-7", "例8-7(2)", "例8-7(3)", "例8-8", "例8-8(2)", "例8-9", "例8-9(2)", "例8-10", "例8-10(2)", "例8-13", "例8-13(2)", "例8-p46_c1", "例8-p46_c2", "例8-p47_c1", "例8-p52_c1", "例8-p52_c2"], "fileBases": ["ex_8-2_question", "ex_8-2_question_2", "ex_8-7_question", "ex_8-7_question_2", "ex_8-7_question_3", "ex_8-8_question", "ex_8-8_question_2", "ex_8-9_question", "ex_8-9_question_2", "ex_8-10_question", "ex_8-10_question_2", "ex_8-13_question", "ex_8-13_question_2", "ex_8-p46_c1_question", "ex_8-p46_c2_question", "ex_8-p47_c1_question", "ex_8-p52_c1_question", "ex_8-p52_c2_question"]},
{"id": "ch239", "number": 239, "name": "郑君里课后刷题本 - 第1章", "short": "第1章", "total": 32, "cols": 5, "wb": "郑君里课后刷题本", "subj": "专业课", "category": "zhuanye", "relPath": "郑君里课后刷题本/第1章", "labels": ["例1-1", "例1-1(2)", "例1-1(3)", "例1-2", "例1-3", "例1-4", "例1-5", "例1-6", "例1-7", "例1-8", "例1-9", "例1-10", "例1-11", "例1-11(2)", "例1-12", "例1-12(2)", "例1-13", "例1-14", "例1-14(2)", "例1-15", "例1-16", "例1-17", "例1-18", "例1-18(2)", "例1-19", "例1-20", "例1-20(2)", "例1-21", "例1-22", "例1-23", "例1-24", "例1-p1_c1"], "fileBases": ["ex_1-1_question", "ex_1-1_question_2", "ex_1-1_question_3", "ex_1-2_question", "ex_1-3_question", "ex_1-4_question", "ex_1-5_question", "ex_1-6_question", "ex_1-7_question", "ex_1-8_question", "ex_1-9_question", "ex_1-10_question", "ex_1-11_question", "ex_1-11_question_2", "ex_1-12_question", "ex_1-12_question_2", "ex_1-13_question", "ex_1-14_question", "ex_1-14_question_2", "ex_1-15_question", "ex_1-16_question", "ex_1-17_question", "ex_1-18_question", "ex_1-18_question_2", "ex_1-19_question", "ex_1-20_question", "ex_1-20_question_2", "ex_1-21_question", "ex_1-22_question", "ex_1-23_question", "ex_1-24_question", "ex_1-p1_c1_question"]},
{"id": "ch240", "number": 240, "name": "郑君里课后刷题本 - 第2章", "short": "第2章", "total": 37, "cols": 5, "wb": "郑君里课后刷题本", "subj": "专业课", "category": "zhuanye", "relPath": "郑君里课后刷题本/第2章", "labels": ["例2-1", "例2-1(2)", "例2-2", "例2-3", "例2-4", "例2-4(2)", "例2-4(3)", "例2-5", "例2-6", "例2-7", "例2-8", "例2-9", "例2-9(2)", "例2-10", "例2-11", "例2-12", "例2-13", "例2-13(2)", "例2-13(3)", "例2-14", "例2-15", "例2-15(2)", "例2-16", "例2-17", "例2-18", "例2-19", "例2-19(2)", "例2-19(3)", "例2-19(4)", "例2-19(5)", "例2-19(6)", "例2-20", "例2-21", "例2-22", "例2-23", "例2-24", "例2-25"], "fileBases": ["ex_2-1_question", "ex_2-1_question_2", "ex_2-2_question", "ex_2-3_question", "ex_2-4_question", "ex_2-4_question_2", "ex_2-4_question_3", "ex_2-5_question", "ex_2-6_question", "ex_2-7_question", "ex_2-8_question", "ex_2-9_question", "ex_2-9_question_2", "ex_2-10_question", "ex_2-11_question", "ex_2-12_question", "ex_2-13_question", "ex_2-13_question_2", "ex_2-13_question_3", "ex_2-14_question", "ex_2-15_question", "ex_2-15_question_2", "ex_2-16_question", "ex_2-17_question", "ex_2-18_question", "ex_2-19_question", "ex_2-19_question_2", "ex_2-19_question_3", "ex_2-19_question_4", "ex_2-19_question_5", "ex_2-19_question_6", "ex_2-20_question", "ex_2-21_question", "ex_2-22_question", "ex_2-23_question", "ex_2-24_question", "ex_2-25_question"]},
{"id": "ch241", "number": 241, "name": "郑君里课后刷题本 - 第3章", "short": "第3章", "total": 66, "cols": 5, "wb": "郑君里课后刷题本", "subj": "专业课", "category": "zhuanye", "relPath": "郑君里课后刷题本/第3章", "labels": ["例3-1", "例3-2", "例3-3", "例3-3(2)", "例3-4", "例3-5", "例3-6", "例3-7", "例3-7(2)", "例3-7(3)", "例3-8", "例3-8(2)", "例3-9", "例3-10", "例3-11", "例3-12", "例3-13", "例3-14", "例3-14(2)", "例3-15", "例3-16", "例3-16(2)", "例3-17", "例3-17(2)", "例3-18", "例3-19", "例3-19(2)", "例3-20", "例3-20(2)", "例3-21", "例3-22", "例3-23", "例3-24", "例3-25", "例3-26", "例3-27", "例3-28", "例3-29", "例3-29(2)", "例3-30", "例3-30(2)", "例3-30(3)", "例3-30(4)", "例3-31", "例3-32", "例3-33", "例3-34", "例3-35", "例3-36", "例3-37", "例3-37(2)", "例3-37(3)", "例3-37(4)", "例3-38", "例3-38(2)", "例3-38(3)", "例3-39", "例3-40", "例3-40(2)", "例3-40(3)", "例3-40(4)", "例3-40(5)", "例3-40(6)", "例3-40(7)", "例3-41", "例3-42"], "fileBases": ["ex_3-1_question", "ex_3-2_question", "ex_3-3_question", "ex_3-3_question_2", "ex_3-4_question", "ex_3-5_question", "ex_3-6_question", "ex_3-7_question", "ex_3-7_question_2", "ex_3-7_question_3", "ex_3-8_question", "ex_3-8_question_2", "ex_3-9_question", "ex_3-10_question", "ex_3-11_question", "ex_3-12_question", "ex_3-13_question", "ex_3-14_question", "ex_3-14_question_2", "ex_3-15_question", "ex_3-16_question", "ex_3-16_question_2", "ex_3-17_question", "ex_3-17_question_2", "ex_3-18_question", "ex_3-19_question", "ex_3-19_question_2", "ex_3-20_question", "ex_3-20_question_2", "ex_3-21_question", "ex_3-22_question", "ex_3-23_question", "ex_3-24_question", "ex_3-25_question", "ex_3-26_question", "ex_3-27_question", "ex_3-28_question", "ex_3-29_question", "ex_3-29_question_2", "ex_3-30_question", "ex_3-30_question_2", "ex_3-30_question_3", "ex_3-30_question_4", "ex_3-31_question", "ex_3-32_question", "ex_3-33_question", "ex_3-34_question", "ex_3-35_question", "ex_3-36_question", "ex_3-37_question", "ex_3-37_question_2", "ex_3-37_question_3", "ex_3-37_question_4", "ex_3-38_question", "ex_3-38_question_2", "ex_3-38_question_3", "ex_3-39_question", "ex_3-40_question", "ex_3-40_question_2", "ex_3-40_question_3", "ex_3-40_question_4", "ex_3-40_question_5", "ex_3-40_question_6", "ex_3-40_question_7", "ex_3-41_question", "ex_3-42_question"]},
{"id": "ch242", "number": 242, "name": "郑君里课后刷题本 - 第4章", "short": "第4章", "total": 73, "cols": 5, "wb": "郑君里课后刷题本", "subj": "专业课", "category": "zhuanye", "relPath": "郑君里课后刷题本/第4章", "labels": ["例4-1", "例4-1(2)", "例4-1(3)", "例4-1(4)", "例4-1(5)", "例4-2", "例4-3", "例4-4", "例4-4(2)", "例4-4(3)", "例4-4(4)", "例4-4(5)", "例4-5", "例4-6", "例4-7", "例4-8", "例4-9", "例4-10", "例4-11", "例4-12", "例4-13", "例4-13(2)", "例4-13(3)", "例4-14", "例4-15", "例4-16", "例4-17", "例4-18", "例4-19", "例4-20", "例4-20(2)", "例4-21", "例4-22", "例4-23", "例4-23(2)", "例4-23(3)", "例4-23(4)", "例4-24", "例4-24(2)", "例4-24(3)", "例4-24(4)", "例4-25", "例4-26", "例4-26(2)", "例4-26(3)", "例4-26(4)", "例4-27", "例4-28", "例4-29", "例4-30", "例4-31", "例4-32", "例4-33", "例4-34", "例4-35", "例4-36", "例4-37", "例4-38", "例4-40", "例4-40(2)", "例4-40(3)", "例4-41", "例4-42", "例4-43", "例4-44", "例4-45", "例4-46", "例4-47", "例4-48", "例4-49", "例4-50", "例4-51", "例4-p97_c2"], "fileBases": ["ex_4-1_question", "ex_4-1_question_2", "ex_4-1_question_3", "ex_4-1_question_4", "ex_4-1_question_5", "ex_4-2_question", "ex_4-3_question", "ex_4-4_question", "ex_4-4_question_2", "ex_4-4_question_3", "ex_4-4_question_4", "ex_4-4_question_5", "ex_4-5_question", "ex_4-6_question", "ex_4-7_question", "ex_4-8_question", "ex_4-9_question", "ex_4-10_question", "ex_4-11_question", "ex_4-12_question", "ex_4-13_question", "ex_4-13_question_2", "ex_4-13_question_3", "ex_4-14_question", "ex_4-15_question", "ex_4-16_question", "ex_4-17_question", "ex_4-18_question", "ex_4-19_question", "ex_4-20_question", "ex_4-20_question_2", "ex_4-21_question", "ex_4-22_question", "ex_4-23_question", "ex_4-23_question_2", "ex_4-23_question_3", "ex_4-23_question_4", "ex_4-24_question", "ex_4-24_question_2", "ex_4-24_question_3", "ex_4-24_question_4", "ex_4-25_question", "ex_4-26_question", "ex_4-26_question_2", "ex_4-26_question_3", "ex_4-26_question_4", "ex_4-27_question", "ex_4-28_question", "ex_4-29_question", "ex_4-30_question", "ex_4-31_question", "ex_4-32_question", "ex_4-33_question", "ex_4-34_question", "ex_4-35_question", "ex_4-36_question", "ex_4-37_question", "ex_4-38_question", "ex_4-40_question", "ex_4-40_question_2", "ex_4-40_question_3", "ex_4-41_question", "ex_4-42_question", "ex_4-43_question", "ex_4-44_question", "ex_4-45_question", "ex_4-46_question", "ex_4-47_question", "ex_4-48_question", "ex_4-49_question", "ex_4-50_question", "ex_4-51_question", "ex_4-p97_c2_question"]},
{"id": "ch243", "number": 243, "name": "郑君里课后刷题本 - 第5章", "short": "第5章", "total": 29, "cols": 5, "wb": "郑君里课后刷题本", "subj": "专业课", "category": "zhuanye", "relPath": "郑君里课后刷题本/第5章", "labels": ["例5-1", "例5-2", "例5-3", "例5-5", "例5-6", "例5-7", "例5-8", "例5-9", "例5-10", "例5-11", "例5-12", "例5-13", "例5-14", "例5-15", "例5-16", "例5-17", "例5-18", "例5-19", "例5-20", "例5-21", "例5-22", "例5-23", "例5-25", "例5-26", "例5-27", "例5-p106_c2", "例5-p112_c1", "例5-p117_c1", "例5-p117_c2"], "fileBases": ["ex_5-1_question", "ex_5-2_question", "ex_5-3_question", "ex_5-5_question", "ex_5-6_question", "ex_5-7_question", "ex_5-8_question", "ex_5-9_question", "ex_5-10_question", "ex_5-11_question", "ex_5-12_question", "ex_5-13_question", "ex_5-14_question", "ex_5-15_question", "ex_5-16_question", "ex_5-17_question", "ex_5-18_question", "ex_5-19_question", "ex_5-20_question", "ex_5-21_question", "ex_5-22_question", "ex_5-23_question", "ex_5-25_question", "ex_5-26_question", "ex_5-27_question", "ex_5-p106_c2_question", "ex_5-p112_c1_question", "ex_5-p117_c1_question", "ex_5-p117_c2_question"]},
{"id": "ch244", "number": 244, "name": "郑君里课后刷题本 - 第6章", "short": "第6章", "total": 31, "cols": 5, "wb": "郑君里课后刷题本", "subj": "专业课", "category": "zhuanye", "relPath": "郑君里课后刷题本/第6章", "labels": ["例6-1", "例6-2", "例6-5", "例6-6", "例6-7", "例6-8", "例6-9", "例6-10", "例6-10(2)", "例6-10(3)", "例6-10(4)", "例6-11", "例6-12", "例6-13", "例6-14", "例6-15", "例6-16", "例6-17", "例6-17(2)", "例6-17(3)", "例6-18", "例6-19", "例6-21", "例6-22", "例6-23", "例6-24", "例6-25", "例6-25(2)", "例6-41", "例6-p120_c2", "例6-p131_c2"], "fileBases": ["ex_6-1_question", "ex_6-2_question", "ex_6-5_question", "ex_6-6_question", "ex_6-7_question", "ex_6-8_question", "ex_6-9_question", "ex_6-10_question", "ex_6-10_question_2", "ex_6-10_question_3", "ex_6-10_question_4", "ex_6-11_question", "ex_6-12_question", "ex_6-13_question", "ex_6-14_question", "ex_6-15_question", "ex_6-16_question", "ex_6-17_question", "ex_6-17_question_2", "ex_6-17_question_3", "ex_6-18_question", "ex_6-19_question", "ex_6-21_question", "ex_6-22_question", "ex_6-23_question", "ex_6-24_question", "ex_6-25_question", "ex_6-25_question_2", "ex_6-41_question", "ex_6-p120_c2_question", "ex_6-p131_c2_question"]},
{"id": "ch245", "number": 245, "name": "郑君里课后刷题本 - 第7章", "short": "第7章", "total": 46, "cols": 5, "wb": "郑君里课后刷题本", "subj": "专业课", "category": "zhuanye", "relPath": "郑君里课后刷题本/第7章", "labels": ["例7-1", "例7-1(2)", "例7-2", "例7-2(2)", "例7-3", "例7-4", "例7-5", "例7-6", "例7-7", "例7-8", "例7-9", "例7-10", "例7-11", "例7-11(2)", "例7-12", "例7-12(2)", "例7-13", "例7-14", "例7-15", "例7-16", "例7-17", "例7-18", "例7-19", "例7-20", "例7-21", "例7-22", "例7-23", "例7-24", "例7-25", "例7-26", "例7-27", "例7-28", "例7-28(2)", "例7-28(3)", "例7-29", "例7-30", "例7-31", "例7-31(2)", "例7-31(3)", "例7-31(4)", "例7-32", "例7-32(2)", "例7-32(3)", "例7-33", "例7-34", "例7-35"], "fileBases": ["ex_7-1_question", "ex_7-1_question_2", "ex_7-2_question", "ex_7-2_question_2", "ex_7-3_question", "ex_7-4_question", "ex_7-5_question", "ex_7-6_question", "ex_7-7_question", "ex_7-8_question", "ex_7-9_question", "ex_7-10_question", "ex_7-11_question", "ex_7-11_question_2", "ex_7-12_question", "ex_7-12_question_2", "ex_7-13_question", "ex_7-14_question", "ex_7-15_question", "ex_7-16_question", "ex_7-17_question", "ex_7-18_question", "ex_7-19_question", "ex_7-20_question", "ex_7-21_question", "ex_7-22_question", "ex_7-23_question", "ex_7-24_question", "ex_7-25_question", "ex_7-26_question", "ex_7-27_question", "ex_7-28_question", "ex_7-28_question_2", "ex_7-28_question_3", "ex_7-29_question", "ex_7-30_question", "ex_7-31_question", "ex_7-31_question_2", "ex_7-31_question_3", "ex_7-31_question_4", "ex_7-32_question", "ex_7-32_question_2", "ex_7-32_question_3", "ex_7-33_question", "ex_7-34_question", "ex_7-35_question"]},
{"id": "ch246", "number": 246, "name": "郑君里课后刷题本 - 第8章", "short": "第8章", "total": 47, "cols": 5, "wb": "郑君里课后刷题本", "subj": "专业课", "category": "zhuanye", "relPath": "郑君里课后刷题本/第8章", "labels": ["例8-1", "例8-1(2)", "例8-2", "例8-3", "例8-4", "例8-4(2)", "例8-5", "例8-6", "例8-7", "例8-7(2)", "例8-8", "例8-9", "例8-10", "例8-11", "例8-12", "例8-13", "例8-14", "例8-15", "例8-16", "例8-17", "例8-18", "例8-19", "例8-19(2)", "例8-19(3)", "例8-20", "例8-21", "例8-21(2)", "例8-21(3)", "例8-22", "例8-23", "例8-24", "例8-25", "例8-26", "例8-26(2)", "例8-26(3)", "例8-27", "例8-28", "例8-29", "例8-30", "例8-31", "例8-32", "例8-33", "例8-34", "例8-35", "例8-36", "例8-37", "例8-38"], "fileBases": ["ex_8-1_question", "ex_8-1_question_2", "ex_8-2_question", "ex_8-3_question", "ex_8-4_question", "ex_8-4_question_2", "ex_8-5_question", "ex_8-6_question", "ex_8-7_question", "ex_8-7_question_2", "ex_8-8_question", "ex_8-9_question", "ex_8-10_question", "ex_8-11_question", "ex_8-12_question", "ex_8-13_question", "ex_8-14_question", "ex_8-15_question", "ex_8-16_question", "ex_8-17_question", "ex_8-18_question", "ex_8-19_question", "ex_8-19_question_2", "ex_8-19_question_3", "ex_8-20_question", "ex_8-21_question", "ex_8-21_question_2", "ex_8-21_question_3", "ex_8-22_question", "ex_8-23_question", "ex_8-24_question", "ex_8-25_question", "ex_8-26_question", "ex_8-26_question_2", "ex_8-26_question_3", "ex_8-27_question", "ex_8-28_question", "ex_8-29_question", "ex_8-30_question", "ex_8-31_question", "ex_8-32_question", "ex_8-33_question", "ex_8-34_question", "ex_8-35_question", "ex_8-36_question", "ex_8-37_question", "ex_8-38_question"]},
{"id": "ch247", "number": 247, "name": "郑君里课后刷题本 - 第9章", "short": "第9章", "total": 39, "cols": 5, "wb": "郑君里课后刷题本", "subj": "专业课", "category": "zhuanye", "relPath": "郑君里课后刷题本/第9章", "labels": ["例9-1", "例9-2", "例9-3", "例9-4", "例9-5", "例9-6", "例9-7", "例9-8", "例9-9", "例9-10", "例9-11", "例9-12", "例9-13", "例9-14", "例9-15", "例9-16", "例9-17", "例9-18", "例9-18(2)", "例9-19", "例9-20", "例9-21", "例9-22", "例9-23", "例9-24", "例9-25", "例9-25(2)", "例9-25(3)", "例9-26", "例9-27", "例9-28", "例9-29", "例9-30", "例9-31", "例9-32", "例9-33", "例9-34", "例9-35", "例9-36"], "fileBases": ["ex_9-1_question", "ex_9-2_question", "ex_9-3_question", "ex_9-4_question", "ex_9-5_question", "ex_9-6_question", "ex_9-7_question", "ex_9-8_question", "ex_9-9_question", "ex_9-10_question", "ex_9-11_question", "ex_9-12_question", "ex_9-13_question", "ex_9-14_question", "ex_9-15_question", "ex_9-16_question", "ex_9-17_question", "ex_9-18_question", "ex_9-18_question_2", "ex_9-19_question", "ex_9-20_question", "ex_9-21_question", "ex_9-22_question", "ex_9-23_question", "ex_9-24_question", "ex_9-25_question", "ex_9-25_question_2", "ex_9-25_question_3", "ex_9-26_question", "ex_9-27_question", "ex_9-28_question", "ex_9-29_question", "ex_9-30_question", "ex_9-31_question", "ex_9-32_question", "ex_9-33_question", "ex_9-34_question", "ex_9-35_question", "ex_9-36_question"]},
{"id": "ch248", "number": 248, "name": "郑君里课后刷题本 - 第10章", "short": "第10章", "total": 35, "cols": 5, "wb": "郑君里课后刷题本", "subj": "专业课", "category": "zhuanye", "relPath": "郑君里课后刷题本/第10章", "labels": ["例10-1", "例10-1(2)", "例10-2", "例10-3", "例10-4", "例10-7", "例10-7(2)", "例10-7(3)", "例10-7(4)", "例10-9", "例10-10", "例10-11", "例10-13", "例10-14", "例10-15", "例10-16", "例10-17", "例10-18", "例10-19", "例10-20", "例10-21", "例10-22", "例10-23", "例10-24", "例10-24(2)", "例10-25", "例10-26", "例10-27", "例10-28", "例10-29", "例10-30", "例10-p203_c2", "例10-p204_c1", "例10-p206_c2", "例10-p208_c2"], "fileBases": ["ex_10-1_question", "ex_10-1_question_2", "ex_10-2_question", "ex_10-3_question", "ex_10-4_question", "ex_10-7_question", "ex_10-7_question_2", "ex_10-7_question_3", "ex_10-7_question_4", "ex_10-9_question", "ex_10-10_question", "ex_10-11_question", "ex_10-13_question", "ex_10-14_question", "ex_10-15_question", "ex_10-16_question", "ex_10-17_question", "ex_10-18_question", "ex_10-19_question", "ex_10-20_question", "ex_10-21_question", "ex_10-22_question", "ex_10-23_question", "ex_10-24_question", "ex_10-24_question_2", "ex_10-25_question", "ex_10-26_question", "ex_10-27_question", "ex_10-28_question", "ex_10-29_question", "ex_10-30_question", "ex_10-p203_c2_question", "ex_10-p204_c1_question", "ex_10-p206_c2_question", "ex_10-p208_c2_question"]},
{"id": "ch249", "number": 249, "name": "郑君里课后刷题本 - 第11章", "short": "第11章", "total": 42, "cols": 5, "wb": "郑君里课后刷题本", "subj": "专业课", "category": "zhuanye", "relPath": "郑君里课后刷题本/第11章", "labels": ["例11-1", "例11-2", "例11-3", "例11-5", "例11-6", "例11-7", "例11-8", "例11-9", "例11-10", "例11-11", "例11-11(2)", "例11-11(3)", "例11-12", "例11-12(2)", "例11-12(3)", "例11-13", "例11-14", "例11-15", "例11-16", "例11-17", "例11-17(2)", "例11-18", "例11-19", "例11-20", "例11-20(2)", "例11-21", "例11-22", "例11-23", "例11-24", "例11-25", "例11-26", "例11-27", "例11-27(2)", "例11-28", "例11-28(2)", "例11-30", "例11-31", "例11-32", "例11-32(2)", "例11-p220_c1", "例11-p236_c2", "例11-p237_c1"], "fileBases": ["ex_11-1_question", "ex_11-2_question", "ex_11-3_question", "ex_11-5_question", "ex_11-6_question", "ex_11-7_question", "ex_11-8_question", "ex_11-9_question", "ex_11-10_question", "ex_11-11_question", "ex_11-11_question_2", "ex_11-11_question_3", "ex_11-12_question", "ex_11-12_question_2", "ex_11-12_question_3", "ex_11-13_question", "ex_11-14_question", "ex_11-15_question", "ex_11-16_question", "ex_11-17_question", "ex_11-17_question_2", "ex_11-18_question", "ex_11-19_question", "ex_11-20_question", "ex_11-20_question_2", "ex_11-21_question", "ex_11-22_question", "ex_11-23_question", "ex_11-24_question", "ex_11-25_question", "ex_11-26_question", "ex_11-27_question", "ex_11-27_question_2", "ex_11-28_question", "ex_11-28_question_2", "ex_11-30_question", "ex_11-31_question", "ex_11-32_question", "ex_11-32_question_2", "ex_11-p220_c1_question", "ex_11-p236_c2_question", "ex_11-p237_c1_question"]},
{"id": "ch250", "number": 250, "name": "郑君里课后刷题本 - 第12章", "short": "第12章", "total": 26, "cols": 5, "wb": "郑君里课后刷题本", "subj": "专业课", "category": "zhuanye", "relPath": "郑君里课后刷题本/第12章", "labels": ["例12-1", "例12-2", "例12-3", "例12-4", "例12-5", "例12-6", "例12-6(2)", "例12-7", "例12-7(2)", "例12-7(3)", "例12-8", "例12-9", "例12-10", "例12-12", "例12-13", "例12-14", "例12-15", "例12-16", "例12-17", "例12-18", "例12-19", "例12-19(2)", "例12-19(3)", "例12-20", "例12-21", "例12-p246_c1"], "fileBases": ["ex_12-1_question", "ex_12-2_question", "ex_12-3_question", "ex_12-4_question", "ex_12-5_question", "ex_12-6_question", "ex_12-6_question_2", "ex_12-7_question", "ex_12-7_question_2", "ex_12-7_question_3", "ex_12-8_question", "ex_12-9_question", "ex_12-10_question", "ex_12-12_question", "ex_12-13_question", "ex_12-14_question", "ex_12-15_question", "ex_12-16_question", "ex_12-17_question", "ex_12-18_question", "ex_12-19_question", "ex_12-19_question_2", "ex_12-19_question_3", "ex_12-20_question", "ex_12-21_question", "ex_12-p246_c1_question"]}
];

// ===== 全局配置与状态 =====
const SUBJ_ORDER = [
  '高数',
  '基础篇-高数',
  '强化篇-高数',
  '线代',
  '基础篇-线代',
  '强化篇-线代',
  '概率论',
  '基础篇-概率论',
  '强化篇-概率论',
  '专业课'
];
const WB_ORDER = [
  '李林880',
  '基础30讲',
  '张宇强化36讲',
  '数一1000题',
  '李范全书',
  '何子述课后刷题本',
  '吴大正课后刷题本',
  '奥本海姆课后刷题本',
  '杨晓非课后刷题本',
  '管致中课后刷题本',
  '郑君里课后刷题本'
];

let currentCategory = 'shu1';
let currentChapterId = 'ch1';
let current = 0;
let showSolution = true;
let defaultShowSolution = true;
let subMode = false;
let currentFilters = new Set(['all']);

let statuses = {};
let qBad = {};
let sBad = {};
let notesData = {};
let annoActive = false;
let initializedUserId = null;
let appUiBound = false;

// ===== 用户身份与存储键 =====
function getSignedInUserId() {
  const user = window.PrivateStudy?.getCurrentUser?.();
  if (!user) {
    throw new Error('未登录，不能读写用户学习数据');
  }
  return user.id;
}

function userCacheKey(dataType, chapterId = currentChapterId) {
  return `kaoyan:${getSignedInUserId()}:${chapterId}:${dataType}`;
}

function getAnnotationStorageKey(chapterId, questionId) {
  const user = window.PrivateStudy?.getCurrentUser?.();
  if (!user) {
    throw new Error('未登录，不能保存题目标注');
  }
  return `annotation:${user.id}:${chapterId}:${questionId}`;
}

// ===== 章节与数据检索 =====
function getChapter(chapterId = currentChapterId) {
  return CHAPTERS.find(function (c) {
    return c.id === chapterId;
  });
}

function stripSubSuffix(label) {
  return String(label || '').replace(/\s*[\(（][^\)）]*[\)）]\s*$/, '');
}

function subSuffix(label) {
  const m = String(label || '').match(/[\(（][^\)）]*[\)）]\s*$/);
  return m ? m[0].trim() : String(label || '');
}

function ensureGroups(ch) {
  if (!ch) ch = getChapter();
  if (!ch || ch.subGroups) return;

  const labels = ch.labels || [];
  const groups = [];
  let i = 0;
  while (i < labels.length) {
    const parent = stripSubSuffix(labels[i]);
    const hasParen = parent !== labels[i];
    let j = i + 1;
    if (hasParen) {
      while (j < labels.length && stripSubSuffix(labels[j]) === parent && stripSubSuffix(labels[j]) !== labels[j]) j++;
    }
    groups.push({ parentLabel: parent, startIdx: i, count: j - i, isParent: hasParen && (j - i) > 1 });
    i = j;
  }
  ch.subGroups = groups;
  ch.groupForIdx = new Array(labels.length);
  groups.forEach(function (g) {
    for (let k = 0; k < g.count; k++) {
      ch.groupForIdx[g.startIdx + k] = g;
    }
  });
}

function effectiveCols() {
  const ch = getChapter();
  return ch?.cols || 5;
}

function getStatus(index) {
  return statuses[index] || '';
}

function getStatusClass(index) {
  return getStatus(index) || 'unmarked';
}

function clearRecord(record) {
  for (const key in record) {
    delete record[key];
  }
}

// ===== 图像路径解析 =====
function getImgPath(idx) {
  const chapter = getChapter();
  if (!chapter) throw new Error(`Unknown chapter: ${currentChapterId}`);

  const rootDir = chapter.category === 'zhuanye' ? '专业题库' : '数一题库';
  const chapterDir = `${rootDir}/${chapter.relPath}`;

  if (Array.isArray(chapter.fileBases) && chapter.fileBases[idx]) {
    return `${chapterDir}/${chapter.fileBases[idx]}`;
  }

  const label = String(chapter.labels?.[idx] ?? '');
  if (!label) throw new Error(`Missing image label for question ${idx + 1}`);

  const fileBase = label.startsWith('例')
    ? `ex_${label.slice(1)}`
    : `pb_${label}`;

  return `${chapterDir}/${fileBase}`;
}

// ===== 本地与云端持久化 =====
function saveUserCache(dataType, data, chapterId = currentChapterId, overrideTimestamp = null) {
  try {
    const key = userCacheKey(dataType, chapterId);
    const envelope = { __data: data, __updatedAt: overrideTimestamp ?? Date.now() };
    localStorage.setItem(key, JSON.stringify(envelope));
  } catch (error) {
    console.warn(`保存 ${dataType} 本地缓存失败:`, error);
  }
}

function loadUserCache(dataType, chapterId = currentChapterId) {
  try {
    const key = userCacheKey(dataType, chapterId);
    const raw = localStorage.getItem(key);
    if (!raw) return null;
    const parsed = JSON.parse(raw);
    if (parsed && typeof parsed === 'object' && '__data' in parsed && '__updatedAt' in parsed) {
      return parsed; // Returns { __data, __updatedAt }
    }
    // Legacy format backward compatibility
    return { __data: parsed, __updatedAt: 0 };
  } catch (error) {
    console.warn(`读取 ${dataType} 本地缓存失败:`, error);
    return null;
  }
}

function scheduleSave(dataType, data, chapterId = currentChapterId) {
  saveUserCache(dataType, data, chapterId);
  const api = window.PrivateStudy;
  if (api && api.getCurrentUser()) {
    api.scheduleSave(chapterId, dataType, data);
  }
}

function saveStatuses() { scheduleSave('status', statuses); }
function saveQBad() { scheduleSave('questionBad', qBad); }
function saveSBad() { scheduleSave('solutionBad', sBad); }
function saveNotes() { scheduleSave('notes', notesData); }

function resetAllUserState() {
  clearRecord(statuses);
  clearRecord(qBad);
  clearRecord(sBad);
  clearRecord(notesData);
  annoActive = false;
  initializedUserId = null;
  const canvas = document.getElementById('annotationCanvas');
  if (canvas) canvas.style.display = 'none';
  const toolbar = document.getElementById('annoToolbar');
  if (toolbar) toolbar.style.display = 'none';
}

function replaceRecord(target, source) {
  clearRecord(target);
  if (source && typeof source === 'object' && !Array.isArray(source)) {
    Object.assign(target, source);
  }
}

async function restoreChapterState(chapterId = currentChapterId) {
  clearRecord(statuses);
  clearRecord(qBad);
  clearRecord(sBad);
  clearRecord(notesData);

  const localStatusEnv = loadUserCache('status', chapterId);
  if (localStatusEnv?.__data) Object.assign(statuses, localStatusEnv.__data);
  const localQBadEnv = loadUserCache('questionBad', chapterId);
  if (localQBadEnv?.__data) Object.assign(qBad, localQBadEnv.__data);
  const localSBadEnv = loadUserCache('solutionBad', chapterId);
  if (localSBadEnv?.__data) Object.assign(sBad, localSBadEnv.__data);
  const localNotesEnv = loadUserCache('notes', chapterId);
  if (localNotesEnv?.__data) Object.assign(notesData, localNotesEnv.__data);

  const api = window.PrivateStudy;
  if (!api || !api.getCurrentUser()) return;

  try {
    const bundle = await api.loadBundle(chapterId);
    if (bundle) {
      const syncDataType = (dataTypeStr, localEnv, bundleItem, globalTarget) => {
        if (bundleItem !== null) {
          if (!localEnv || bundleItem.updatedAt > localEnv.__updatedAt) {
            replaceRecord(globalTarget, bundleItem.data);
            saveUserCache(dataTypeStr, bundleItem.data, chapterId, bundleItem.updatedAt);
          } else if (localEnv.__updatedAt > bundleItem.updatedAt) {
            api.scheduleSave(chapterId, dataTypeStr, globalTarget);
          }
        } else if (localEnv?.__data) {
          api.scheduleSave(chapterId, dataTypeStr, globalTarget);
        }
      };

      syncDataType('status', localStatusEnv, bundle.status, statuses);
      syncDataType('questionBad', localQBadEnv, bundle.questionBad, qBad);
      syncDataType('solutionBad', localSBadEnv, bundle.solutionBad, sBad);
      syncDataType('notes', localNotesEnv, bundle.notes, notesData);

      if (bundle.lastPosition !== null) {
        const restoredPosition = Number(bundle.lastPosition.data);
        const ch = getChapter(chapterId);
        if (ch && Number.isInteger(restoredPosition) && restoredPosition >= 0) {
          current = Math.min(restoredPosition, ch.total - 1);
        }
      }
    }
  } catch (error) {
    console.warn('读取云端数据失败，降级使用本地缓存状态:', error);
  }
}

async function restoreCurrentUserProgress(chapterId = currentChapterId) {
  await restoreChapterState(chapterId);
}

// ===== 解析提示展示 =====
function showSolutionNotice(message) {
  const area = document.getElementById('solutionArea');
  const image = document.getElementById('solutionImg');
  if (!area || !image) return;

  let notice = document.getElementById('solutionNotice');
  if (!notice) {
    notice = document.createElement('div');
    notice.id = 'solutionNotice';
    notice.className = 'solution-empty-notice';
    notice.style.padding = '20px';
    notice.style.textAlign = 'center';
    notice.style.color = '#888';
    notice.style.fontSize = '14px';
    area.appendChild(notice);
  }

  image.style.display = 'none';
  image.removeAttribute('src');
  notice.textContent = message;
  notice.style.display = 'block';
}

function hideSolutionNotice() {
  const image = document.getElementById('solutionImg');
  const notice = document.getElementById('solutionNotice');
  if (image) image.style.display = 'block';
  if (notice) notice.style.display = 'none';
}

// ===== 标注引擎与持久化 =====
function saveQuestionAnnotation() {
  const canvas = document.getElementById('annotationCanvas');
  if (!canvas) return;
  const key = getAnnotationStorageKey(currentChapterId, current);
  try {
    localStorage.setItem(key, canvas.toDataURL('image/png'));
  } catch (error) {
    console.warn('标注保存失败，可能已达到浏览器存储上限', error);
  }
}

function restoreQuestionAnnotation() {
  const canvas = document.getElementById('annotationCanvas');
  if (!canvas) return;
  const context = canvas.getContext('2d');
  const key = getAnnotationStorageKey(currentChapterId, current);

  context.clearRect(0, 0, canvas.width, canvas.height);

  const dataUrl = localStorage.getItem(key);
  if (!dataUrl) return;

  const image = new Image();
  image.onload = function () {
    context.drawImage(image, 0, 0, canvas.width, canvas.height);
  };
  image.src = dataUrl;
}

function toggleAnnotation(show) {
  const canvas = document.getElementById('annotationCanvas');
  const toolbar = document.getElementById('annoToolbar');
  const button = document.getElementById('btnToggleAnnotation');
  const questionImage = document.getElementById('questionImg');

  if (!canvas) return;

  if (typeof show !== 'boolean') {
    show = !annoActive;
  }

  annoActive = show;
  canvas.style.display = show ? 'block' : 'none';
  if (toolbar) toolbar.style.display = show ? 'flex' : 'none';

  if (button) {
    button.classList.toggle('active', show);
    const name = button.querySelector('.func-name');
    if (name) {
      name.textContent = show ? '✏️ 关闭标注' : '✏️ 开启标注';
    }
  }

  if (!show || !questionImage) return;

  const width = questionImage.clientWidth || questionImage.naturalWidth;
  const height = questionImage.clientHeight || questionImage.naturalHeight;

  if (width > 0 && height > 0) {
    canvas.width = width;
    canvas.height = height;
    restoreQuestionAnnotation();
  }
}

function initAnnotationEngine() {
  const canvas = document.getElementById('annotationCanvas');
  if (!canvas) return;

  const context = canvas.getContext('2d');
  let drawing = false;
  let activePointerId = null;
  let currentTool = 'pen';
  let currentColor = '#ef4444';
  let currentSize = 3;

  function configureContext() {
    context.lineCap = 'round';
    context.lineJoin = 'round';

    if (currentTool === 'eraser') {
      context.globalCompositeOperation = 'destination-out';
      context.lineWidth = currentSize * 4;
    } else {
      context.globalCompositeOperation = 'source-over';
      context.strokeStyle = currentColor;
      context.lineWidth = currentSize;
    }
  }

  function canvasPoint(event) {
    const rect = canvas.getBoundingClientRect();
    const scaleX = canvas.width / (rect.width || 1);
    const scaleY = canvas.height / (rect.height || 1);

    return {
      x: (event.clientX - rect.left) * scaleX,
      y: (event.clientY - rect.top) * scaleY
    };
  }

  canvas.addEventListener('pointerdown', function (event) {
    if (event.button !== 0 && event.pointerType === 'mouse') return;

    drawing = true;
    activePointerId = event.pointerId;

    if (typeof canvas.setPointerCapture === 'function') {
      try { canvas.setPointerCapture(event.pointerId); } catch (e) {}
    }

    configureContext();
    const point = canvasPoint(event);
    context.beginPath();
    context.moveTo(point.x, point.y);
  });

  canvas.addEventListener('pointermove', function (event) {
    if (!drawing || event.pointerId !== activePointerId) return;

    event.preventDefault();
    configureContext();
    const point = canvasPoint(event);
    context.lineTo(point.x, point.y);
    context.stroke();
  });

  function stopDrawing(event) {
    if (!drawing) return;
    if (event && event.pointerId !== activePointerId) return;

    drawing = false;
    if (activePointerId !== null && typeof canvas.releasePointerCapture === 'function') {
      try {
        if (canvas.hasPointerCapture(activePointerId)) {
          canvas.releasePointerCapture(activePointerId);
        }
      } catch (e) {}
    }
    activePointerId = null;
    saveQuestionAnnotation();
  }

  canvas.addEventListener('pointerup', stopDrawing);
  canvas.addEventListener('pointercancel', stopDrawing);
  canvas.addEventListener('lostpointercapture', stopDrawing);

  const toolEraser = document.getElementById('annoToolEraser');
  toolEraser?.addEventListener('click', function () {
    currentTool = currentTool === 'eraser' ? 'pen' : 'eraser';
    toolEraser.classList.toggle('active', currentTool === 'eraser');
  });

  document.querySelectorAll('.anno-color-btn').forEach(function (button) {
    button.addEventListener('click', function () {
      currentColor = button.dataset.color || currentColor;
      currentTool = 'pen';
      toolEraser?.classList.remove('active');
      
      document.querySelectorAll('.anno-color-btn').forEach(item => {
        const selected = item === button;
        item.classList.toggle('active', selected);
        item.setAttribute('aria-pressed', selected ? 'true' : 'false');
      });
    });
  });

  const sizeSlider = document.getElementById('annoSizeSlider');
  const sizeVal = document.getElementById('annoSizeVal');

  sizeSlider?.addEventListener('input', function () {
    currentSize = Number(sizeSlider.value) || 3;
    if (sizeVal) sizeVal.textContent = String(currentSize);
  });

  const clearBtnAnno = document.getElementById('annoClear');
  clearBtnAnno?.addEventListener('click', function () {
    context.clearRect(0, 0, canvas.width, canvas.height);
    saveQuestionAnnotation();
  });

  const closeBtnAnno = document.getElementById('annoClose');
  closeBtnAnno?.addEventListener('click', function () {
    toggleAnnotation(false);
  });
}

// ===== 灯箱放大预览 =====
function openLightbox(src) {
  const overlay = document.getElementById('lightbox');
  const img = document.getElementById('lightboxImg');
  if (overlay && img) {
    img.src = src;
    overlay.classList.add('show');
    overlay.setAttribute('aria-hidden', 'false');
    document.body.style.overflow = 'hidden';
  }
}

function closeLightbox() {
  const overlay = document.getElementById('lightbox');
  if (!overlay) return;

  overlay.classList.remove('show');
  overlay.setAttribute('aria-hidden', 'true');
  document.body.style.overflow = '';
}

function bindLightboxEvents() {
  const overlay = document.getElementById('lightbox');
  const closeBtn = document.getElementById('lightboxClose');
  const questionImage = document.getElementById('questionImg');
  const solutionImage = document.getElementById('solutionImg');

  questionImage?.addEventListener('click', function () {
    const src = questionImage.getAttribute('src');
    if (src) openLightbox(src);
  });

  solutionImage?.addEventListener('click', function () {
    const src = solutionImage.getAttribute('src');
    if (src) openLightbox(src);
  });

  closeBtn?.addEventListener('click', closeLightbox);

  overlay?.addEventListener('click', function (event) {
    if (event.target === overlay) closeLightbox();
  });
}

// ===== 主题切换 =====
function updateThemeButton() {
  const button = document.getElementById('catBtnTheme');
  if (!button) return;

  const isDark = document.body.classList.contains('dark-mode');
  button.textContent = isDark ? '☀️ 日光模式' : '🌙 护眼模式';
}

function initTheme() {
  const mode = localStorage.getItem('kaoyan_theme_mode') || 'light';
  document.body.classList.toggle('dark-mode', mode === 'dark');
  updateThemeButton();
}

function toggleTheme() {
  const isDark = document.body.classList.toggle('dark-mode');
  localStorage.setItem('kaoyan_theme_mode', isDark ? 'dark' : 'light');
  updateThemeButton();
}

// ===== 学习状态与质量标记 =====
function setQuestionStatus(statusType) {
  const curStatus = getStatus(current);
  const newStatus = curStatus === statusType ? '' : statusType;
  statuses[current] = newStatus;
  saveStatuses();
  updateStatusButtons();
  renderNav();
  renderStats();
  updateFilterCounts();
}

function updateStatusButtons() {
  const currentStatus = getStatus(current);
  const entries = [
    ['btnProficient', 'proficient'],
    ['btnVague', 'vague'],
    ['btnWrong', 'wrong']
  ];

  entries.forEach(([id, status]) => {
    const button = document.getElementById(id);
    if (!button) return;

    ['proficient', 'vague', 'wrong'].forEach(className => {
      button.classList.toggle(className, currentStatus === className);
    });
    button.classList.toggle('active', currentStatus === status);
    button.setAttribute('aria-pressed', currentStatus === status ? 'true' : 'false');
  });
}

function toggleQBad() {
  qBad[current] = !qBad[current];
  saveQBad();
  updateQualityBadges();
  renderNav();
}

function toggleSBad() {
  const ch = getChapter();
  if (ch && ch.category === 'zhuanye') {
    alert('专业课暂无解析图，无需标记');
    return;
  }
  sBad[current] = !sBad[current];
  saveSBad();
  updateQualityBadges();
  renderNav();
}

function updateQualityBadges() {
  const chapter = getChapter();
  const hasSolutionImage = chapter?.category !== 'zhuanye';
  const questionMarked = Boolean(qBad[current]);
  const solutionMarked = hasSolutionImage && Boolean(sBad[current]);

  const qButton = document.getElementById('btnQBad');
  const sButton = document.getElementById('btnSBad');
  const qWarning = document.getElementById('qBadWarning');
  const sWarning = document.getElementById('sBadWarning');

  qButton?.classList.toggle('marked', questionMarked);
  sButton?.classList.toggle('marked', solutionMarked);
  qButton?.classList.remove('active');
  sButton?.classList.remove('active');

  qWarning?.classList.toggle('show', questionMarked);
  sWarning?.classList.toggle('show', solutionMarked);

  if (qButton) qButton.setAttribute('aria-pressed', questionMarked ? 'true' : 'false');
  if (sButton) {
    sButton.disabled = !hasSolutionImage;
    sButton.title = hasSolutionImage ? '' : '专业课暂无解析图片';
    sButton.setAttribute('aria-pressed', solutionMarked ? 'true' : 'false');
  }
}

// ===== 解析显示控制 =====
function toggleSolutionVisibility() {
  showSolution = !showSolution;
  const area = document.getElementById('solutionArea');
  if (area) area.style.display = showSolution ? 'block' : 'none';
  const btn = document.getElementById('btnToggle');
  if (btn) {
    const name = btn.querySelector('.func-name');
    if (name) name.textContent = showSolution ? '👁️ 隐藏解析' : '👁️ 显示解析';
  }
}

function toggleDefaultSolutionStrategy() {
  defaultShowSolution = !defaultShowSolution;
  showSolution = defaultShowSolution;
  const btn = document.getElementById('btnSolDefault');
  if (btn) {
    btn.innerHTML = `解析默认：${defaultShowSolution ? '显示' : '隐藏'}<span class="sol-key">Shift+Space</span>`;
  }
  const area = document.getElementById('solutionArea');
  if (area) area.style.display = showSolution ? 'block' : 'none';
}

// ===== 笔记功能 =====
function renderNotesForCurrentQuestion() {
  const ch = getChapter();
  if (!ch) return;
  const label = ch.labels?.[current];
  const noteText = label ? (notesData[label] || '') : '';

  const textarea = document.getElementById('notesTextarea');
  const renderArea = document.getElementById('notesRender');
  const preview = document.getElementById('notePreview');

  if (textarea) textarea.value = noteText;
  if (renderArea) renderArea.textContent = noteText || '暂无笔记内容';
  if (preview) preview.textContent = noteText ? `笔记: ${noteText.slice(0, 30)}...` : '暂无笔记';
  const notesToggle = document.getElementById('notesToggle');
  if (notesToggle) {
    notesToggle.classList.toggle('has-content', Boolean(noteText));
  }
}

function setNotesEditing(editing) {
  const textarea = document.getElementById('notesTextarea');
  const renderArea = document.getElementById('notesRender');
  const editButton = document.getElementById('btnNoteEdit');
  const saveButton = document.getElementById('btnNoteSave');
  const cancelButton = document.getElementById('btnNoteCancel');
  const deleteButton = document.getElementById('btnNoteDelete');

  if (textarea) textarea.style.display = editing ? 'block' : 'none';
  if (renderArea) renderArea.style.display = editing ? 'none' : 'block';
  if (editButton) editButton.style.display = editing ? 'none' : 'inline-flex';
  if (saveButton) saveButton.style.display = editing ? 'inline-flex' : 'none';
  if (cancelButton) cancelButton.style.display = editing ? 'inline-flex' : 'none';
  if (deleteButton) deleteButton.style.display = editing ? 'none' : 'inline-flex';

  if (editing) textarea?.focus();
}

function setupNotesEvents() {
  const btnEdit = document.getElementById('btnNoteEdit');
  const btnSave = document.getElementById('btnNoteSave');
  const btnCancel = document.getElementById('btnNoteCancel');
  const btnDelete = document.getElementById('btnNoteDelete');
  const notesBody = document.getElementById('notesBody');
  const notesToggle = document.getElementById('notesToggle');

  notesToggle?.addEventListener('click', function () {
    if (notesBody) {
      notesBody.classList.toggle('open');
    }
  });

  btnEdit?.addEventListener('click', function () {
    if (notesBody && !notesBody.classList.contains('open')) {
      notesBody.classList.add('open');
    }
    setNotesEditing(true);
  });

  btnSave?.addEventListener('click', function () {
    const ch = getChapter();
    if (!ch) return;
    const label = ch.labels?.[current];
    if (!label) return;

    const textarea = document.getElementById('notesTextarea');
    const noteText = textarea ? textarea.value.trim() : '';

    if (noteText) {
      notesData[label] = noteText;
    } else {
      delete notesData[label];
    }

    saveNotes();
    renderNotesForCurrentQuestion();
    renderNav();
    setNotesEditing(false);
  });

  btnCancel?.addEventListener('click', function () {
    renderNotesForCurrentQuestion();
    setNotesEditing(false);
  });

  btnDelete?.addEventListener('click', function () {
    if (!confirm('确定要删除当前题目笔记吗？')) return;
    const ch = getChapter();
    if (!ch) return;
    const label = ch.labels?.[current];
    if (!label) return;

    delete notesData[label];
    saveNotes();
    renderNotesForCurrentQuestion();
    renderNav();
    setNotesEditing(false);
  });
}

// ===== 筛选逻辑 =====
function isAllFilterActive() {
  return currentFilters.has('all') || currentFilters.size === 0;
}

function getFilteredIndices() {
  const ch = getChapter();
  if (!ch) return [];
  if (isAllFilterActive()) {
    return Array.from({ length: ch.total }, (_, i) => i);
  }

  const indices = [];
  for (let i = 0; i < ch.total; i++) {
    const s = getStatus(i);
    const isUnmarked = !s;
    if (
      (currentFilters.has('proficient') && s === 'proficient') ||
      (currentFilters.has('vague') && s === 'vague') ||
      (currentFilters.has('wrong') && s === 'wrong') ||
      (currentFilters.has('unmarked') && isUnmarked)
    ) {
      indices.push(i);
    }
  }
  return indices;
}

function updateFilterButtons() {
  const btns = document.querySelectorAll('.filter-btn');
  btns.forEach(btn => {
    const filter = btn.getAttribute('data-filter');
    const isActive = currentFilters.has(filter) || (filter === 'all' && currentFilters.size === 0);
    btn.classList.toggle('active', isActive);
    btn.setAttribute('aria-pressed', isActive ? 'true' : 'false');
  });
}

function updateFilterCounts() {
  const ch = getChapter();
  if (!ch) return;

  let proficient = 0, vague = 0, wrong = 0;
  for (let i = 0; i < ch.total; i++) {
    const s = getStatus(i);
    if (s === 'proficient') proficient++;
    else if (s === 'vague') vague++;
    else if (s === 'wrong') wrong++;
  }
  const unmarked = Math.max(0, ch.total - (proficient + vague + wrong));

  const setCount = (filter, count) => {
    const btn = document.querySelector(`.filter-btn[data-filter="${filter}"] .filter-count`);
    if (btn) btn.textContent = ` (${count})`;
  };

  setCount('all', ch.total);
  setCount('proficient', proficient);
  setCount('vague', vague);
  setCount('wrong', wrong);
  setCount('unmarked', unmarked);
}

function setupFilterEvents() {
  const btns = document.querySelectorAll('.filter-btn');
  btns.forEach(btn => {
    btn.addEventListener('click', function () {
      const filter = btn.getAttribute('data-filter');
      if (filter === 'all') {
        currentFilters = new Set(['all']);
      } else {
        currentFilters.delete('all');
        if (currentFilters.has(filter)) {
          currentFilters.delete(filter);
        } else {
          currentFilters.add(filter);
        }
        if (currentFilters.size === 0) {
          currentFilters.add('all');
        }
      }
      updateFilterButtons();
      renderNav();

      const filtered = getFilteredIndices();
      if (filtered.length > 0 && !filtered.includes(current)) {
        switchTo(filtered[0]);
      }
    });
  });
}

// ===== 视图渲染与题目切换 =====
function renderTitle() {
  const chapter = getChapter();
  if (!chapter) return;

  const workbookText = document.getElementById('txtWb');
  const subjectText = document.getElementById('txtSubj');
  const chapterText = document.getElementById('txtChapter');

  if (workbookText) workbookText.textContent = chapter.wb || '';
  if (subjectText) subjectText.textContent = chapter.subj || '';
  if (chapterText) {
    chapterText.textContent = chapter.short || chapter.name || '';
  }
}

function renderStats() {
  const ch = getChapter();
  if (!ch) return;
  const total = ch.total || 0;
  let proficient = 0, vague = 0, wrong = 0;

  for (let index = 0; index < total; index++) {
    const status = getStatus(index);
    if (status === 'proficient') proficient++;
    else if (status === 'vague') vague++;
    else if (status === 'wrong') wrong++;
  }

  const done = proficient + vague + wrong;
  const unmarked = Math.max(0, total - done);

  const setProgress = (id, val) => {
    const el = document.getElementById(id);
    if (el) el.textContent = String(val);
  };

  setProgress('statTotal', total);
  setProgress('statDone', done);
  setProgress('statProficient', proficient);
  setProgress('statVague', vague);
  setProgress('statWrong', wrong);
  setProgress('statUnmarked', unmarked);

  const bar = document.getElementById('statBarFill');
  if (bar) {
    const percent = total > 0 ? (done / total) * 100 : 0;
    bar.style.width = `${percent}%`;
  }
}

function renderNav() {
  const ch = getChapter();
  if (!ch) return;
  const nav = document.getElementById('qnav');
  if (!nav) return;
  nav.innerHTML = '';
  ensureGroups(ch);

  const labels = ch.labels || [];
  const filteredSet = new Set(getFilteredIndices());

  for (let i = 0; i < ch.total; i++) {
    const btn = document.createElement('button');
    btn.type = 'button';
    btn.className = 'q-item ' + getStatusClass(i) + (i === current ? ' active' : '');
    
    if (!filteredSet.has(i)) {
      btn.classList.add('filtered-out');
      btn.disabled = true;
    }
    
    btn.textContent = labels[i] || (i + 1);
    btn.addEventListener('click', function () {
      switchTo(i);
    });

    const badges = document.createElement('span');
    badges.className = 'img-badges';

    if (qBad[i]) {
      const qb = document.createElement('span');
      qb.className = 'qbad-dot';
      qb.textContent = 'Q';
      badges.appendChild(qb);
    }
    if (sBad[i]) {
      const sb = document.createElement('span');
      sb.className = 'sbad-dot';
      sb.textContent = 'S';
      badges.appendChild(sb);
    }
    if (notesData[labels[i]]) {
      const nb = document.createElement('span');
      nb.className = 'note-dot';
      nb.textContent = 'N';
      badges.appendChild(nb);
    }

    if (badges.hasChildNodes()) {
      btn.appendChild(badges);
    }

    nav.appendChild(btn);
  }
}

// ===== 图像加载及 GitHub Raw 智能 Fallback 挂载 =====
function loadImageWithFallback(img, localUrl, fallbackUrl, onFinalError) {
  if (!img) return;
  delete img.dataset.fallback;

  img.onerror = function () {
    if (!img.dataset.fallback) {
      img.dataset.fallback = 'true';
      img.src = fallbackUrl;
    } else {
      if (typeof onFinalError === 'function') {
        onFinalError();
      }
    }
  };

  img.src = localUrl;
}

function switchTo(idx) {
  const ch = getChapter();
  if (!ch) return;

  current = Math.max(0, Math.min(idx, ch.total - 1));
  showSolution = defaultShowSolution;

  const qImg = document.getElementById('questionImg');
  const sImg = document.getElementById('solutionImg');
  const sArea = document.getElementById('solutionArea');

  const qLabel = document.getElementById('qLabel');
  if (qLabel) {
    const labelStr = ch.labels?.[current] || (current + 1);
    qLabel.textContent = `第 ${current + 1} / ${ch.total} 题 (${labelStr})`;
  }

  const base = getImgPath(current);

  if (qImg) delete qImg.dataset.fallback;
  if (sImg) delete sImg.dataset.fallback;

  const base = getImgPath(current);
  const GITHUB_RAW_BASE = 'https://raw.githubusercontent.com/Flanahao/kaoyan-tiku/main';

  if (qImg) {
    const isZhuanye = ch.category === 'zhuanye' && base.includes('_question');
    const localQUrl = isZhuanye ? base + '.png' : base + '_question.png';
    const fallbackQUrl = GITHUB_RAW_BASE + '/' + encodeURI(base) + (isZhuanye ? '.png' : '_question.png');

    loadImageWithFallback(qImg, localQUrl, fallbackQUrl, function () {
      console.warn('题目图片加载失败:', base);
    });
  }

  if (ch.category === 'zhuanye') {
    showSolutionNotice('该题暂无解析图片');
  } else {
    if (sImg) {
      sImg.onload = function () {
        hideSolutionNotice();
      };
      const localSUrl = base + '_solution.png';
      const fallbackSUrl = GITHUB_RAW_BASE + '/' + encodeURI(base) + '_solution.png';

      loadImageWithFallback(sImg, localSUrl, fallbackSUrl, function () {
        showSolutionNotice('解析图片加载失败');
      });
    }
  };
    if (ch.category === 'zhuanye' && base.includes('_question')) {
      qImg.src = base + '.png';
    } else {
      qImg.src = base + '_question.png';
    }
  }

  if (ch.category === 'zhuanye') {
    showSolutionNotice('该题暂无解析图片');
  } else {
    if (sImg) {
      sImg.onerror = function () {
        if (!sImg.dataset.fallback) {
          sImg.dataset.fallback = 'true';
          const fallbackUrl = GITHUB_RAW_BASE + '/' + encodeURI(base) + '_solution.png';
          sImg.src = fallbackUrl;
        } else {
          showSolutionNotice('解析图片加载失败');
        }
      };
      sImg.onload = function () {
        hideSolutionNotice();
      };
      sImg.src = base + '_solution.png';
    }
  }

  if (sArea) sArea.style.display = showSolution ? 'block' : 'none';

  updateStatusButtons();
  updateQualityBadges();
  renderNotesForCurrentQuestion();
  renderNav();
  updateFilterCounts();

  if (annoActive) {
    restoreQuestionAnnotation();
  }

  const api = window.PrivateStudy;
  if (api?.getCurrentUser?.()) {
    api.scheduleSave(currentChapterId, 'lastPosition', current);
  }

  // Preload next and previous images for faster switching, especially for large zhuanye images
  if (current < ch.total - 1) {
    const nextBase = getImgPath(current + 1);
    const nextImg = new Image();
    nextImg.decoding = 'async';
    nextImg.src = (ch.category === 'zhuanye' && nextBase.includes('_question')) ? nextBase + '.png' : nextBase + '_question.png';
  }
  if (current > 0) {
    const prevBase = getImgPath(current - 1);
    const prevImg = new Image();
    prevImg.decoding = 'async';
    prevImg.src = (ch.category === 'zhuanye' && prevBase.includes('_question')) ? prevBase + '.png' : prevBase + '_question.png';
  }
}

// ===== 章节与分类切换 =====
async function switchChapter(chapterId) {
  const targetChapter = CHAPTERS.find(c => c.id === chapterId);
  if (!targetChapter || targetChapter.total === 0) {
    console.warn('章节未提供或为空:', chapterId);
    return;
  }

  const api = window.PrivateStudy;
  if (api && api.getCurrentUser()) {
    try {
      await api.flushPendingWrites();
    } catch (error) {
      console.warn('切换章节前刷新提交失败', error);
    }
  }

  currentChapterId = chapterId;
  current = 0;
  showSolution = defaultShowSolution;
  subMode = false;
  currentFilters = new Set(['all']);

  try {
    await restoreChapterState(chapterId);
  } catch (err) {
    console.warn('restoreChapterState fail-safe:', err);
  }

  updateFilterButtons();
  renderTitle();
  renderStats();
  renderNav();
  switchTo(current);
  updateFilterCounts();
}

async function switchCategory(category) {
  currentCategory = category;

  document
    .getElementById('catBtnShu1')
    ?.classList.toggle('active', category === 'shu1');

  document
    .getElementById('catBtnZhuanye')
    ?.classList.toggle('active', category === 'zhuanye');

  const firstChapter = CHAPTERS.find(function (chapter) {
    return (
      (chapter.category || 'shu1') === category &&
      chapter.total > 0
    );
  });

  if (firstChapter) {
    await switchChapter(firstChapter.id);
  }
}

// ===== 三级标题下拉菜单 =====
function sortByPreferredOrder(values, preferredOrder) {
  return [...values].sort((a, b) => {
    const aIndex = preferredOrder.indexOf(a);
    const bIndex = preferredOrder.indexOf(b);
    const safeA = aIndex === -1 ? Number.MAX_SAFE_INTEGER : aIndex;
    const safeB = bIndex === -1 ? Number.MAX_SAFE_INTEGER : bIndex;
    return safeA - safeB || a.localeCompare(b, 'zh-CN');
  });
}

function createTitleOption(text, active, onSelect) {
  const option = document.createElement('button');
  option.type = 'button';
  option.className = `title-option${active ? ' active' : ''}`;
  option.textContent = text;
  option.setAttribute('role', 'option');
  option.setAttribute('aria-selected', active ? 'true' : 'false');

  option.addEventListener('click', async function (event) {
    event.stopPropagation();
    closeAllTitlePanels();
    await onSelect();
  });

  return option;
}

function fillWbPanel() {
  const panel = document.getElementById('panelWb');
  if (!panel) return;
  panel.innerHTML = '';

  const wbs = [];
  CHAPTERS.forEach(function (ch) {
    if ((ch.category || 'shu1') !== currentCategory) return;
    if (!wbs.includes(ch.wb)) wbs.push(ch.wb);
  });

  const sortedWbs = sortByPreferredOrder(wbs, WB_ORDER);
  const curCh = getChapter();

  sortedWbs.forEach(function (wb) {
    const item = createTitleOption(wb, curCh && curCh.wb === wb, async () => {
      const first = CHAPTERS.find(c => (c.category || 'shu1') === currentCategory && c.wb === wb && c.total > 0);
      if (first) switchChapter(first.id);
    });
    panel.appendChild(item);
  });
}

function fillSubjPanel() {
  const panel = document.getElementById('panelSubj');
  if (!panel) return;
  panel.innerHTML = '';

  const curCh = getChapter();
  if (!curCh) return;

  const subjs = [];
  CHAPTERS.forEach(function (ch) {
    if ((ch.category || 'shu1') !== currentCategory) return;
    if (ch.wb !== curCh.wb) return;
    if (!subjs.includes(ch.subj)) subjs.push(ch.subj);
  });

  const sortedSubjs = sortByPreferredOrder(subjs, SUBJ_ORDER);

  sortedSubjs.forEach(function (subj) {
    const item = createTitleOption(subj, curCh.subj === subj, async () => {
      const first = CHAPTERS.find(c => (c.category || 'shu1') === currentCategory && c.wb === curCh.wb && c.subj === subj && c.total > 0);
      if (first) switchChapter(first.id);
    });
    panel.appendChild(item);
  });
}

function fillChapterPanel() {
  const panel = document.getElementById('panelChapter');
  if (!panel) return;
  panel.innerHTML = '';

  const curCh = getChapter();
  if (!curCh) return;

  const chs = CHAPTERS.filter(function (ch) {
    return (ch.category || 'shu1') === currentCategory && ch.wb === curCh.wb && ch.subj === curCh.subj && ch.total > 0;
  });

  chs.forEach(function (ch) {
    const item = createTitleOption(ch.short || ch.name, ch.id === currentChapterId, async () => {
      switchChapter(ch.id);
    });
    panel.appendChild(item);
  });
}

const TITLE_DROPDOWNS = [
  ['trigWb', 'panelWb'],
  ['trigSubj', 'panelSubj'],
  ['trigChapter', 'panelChapter']
];

function closeAllTitlePanels() {
  TITLE_DROPDOWNS.forEach(([triggerId, panelId]) => {
    const trigger = document.getElementById(triggerId);
    const panel = document.getElementById(panelId);
    trigger?.classList.remove('open');
    panel?.classList.remove('open');
    trigger?.setAttribute('aria-expanded', 'false');
  });
}

function toggleTitlePanel(triggerId, panelId, fillPanel) {
  const trigger = document.getElementById(triggerId);
  const panel = document.getElementById(panelId);
  if (!trigger || !panel) return;

  const shouldOpen = !panel.classList.contains('open');
  closeAllTitlePanels();

  if (shouldOpen) {
    fillPanel();
    trigger.classList.add('open');
    panel.classList.add('open');
    trigger.setAttribute('aria-expanded', 'true');
  }
}

function setupTitleDropdownEvents() {
  const trigWb = document.getElementById('trigWb');
  const trigSubj = document.getElementById('trigSubj');
  const trigChapter = document.getElementById('trigChapter');

  trigWb?.addEventListener('click', event => {
    event.stopPropagation();
    toggleTitlePanel('trigWb', 'panelWb', fillWbPanel);
  });

  trigSubj?.addEventListener('click', event => {
    event.stopPropagation();
    toggleTitlePanel('trigSubj', 'panelSubj', fillSubjPanel);
  });

  trigChapter?.addEventListener('click', event => {
    event.stopPropagation();
    toggleTitlePanel('trigChapter', 'panelChapter', fillChapterPanel);
  });

  document.addEventListener('click', closeAllTitlePanels);
}

// ===== 键盘快捷键监听 =====
function setupKeyboardShortcuts() {
  document.addEventListener('keydown', function (event) {
    if (!window.PrivateStudy?.getCurrentUser?.()) return;

    const activeEl = document.activeElement;
    if (
      activeEl &&
      (activeEl.tagName === 'INPUT' ||
        activeEl.tagName === 'TEXTAREA' ||
        activeEl.isContentEditable)
    ) {
      return;
    }

    const key = event.key.toUpperCase();
    const ch = getChapter();

    if (event.shiftKey) {
      if (event.code === 'Space') {
        event.preventDefault();
        toggleDefaultSolutionStrategy();
        return;
      }
      
      const filterMap = {
        A: 'all',
        Z: 'proficient',
        X: 'vague',
        C: 'wrong',
        N: 'unmarked'
      };
      
      if (filterMap[key]) {
        event.preventDefault();
        const btn = document.querySelector(`.filter-btn[data-filter="${filterMap[key]}"]`);
        if (btn) btn.click();
        return;
      }
    }

    if (event.code === 'Space') {
      event.preventDefault();
      toggleSolutionVisibility();
      return;
    }

    if (key === 'A' || key === 'ARROWLEFT') {
      event.preventDefault();
      if (ch && current > 0) switchTo(current - 1);
      return;
    }

    if (key === 'D' || key === 'ARROWRIGHT') {
      event.preventDefault();
      if (ch && current < ch.total - 1) switchTo(current + 1);
      return;
    }

    if (key === 'W' || key === 'ARROWUP') {
      event.preventDefault();
      const cols = effectiveCols();
      if (current >= cols) switchTo(current - cols);
      return;
    }

    if (key === 'S' || key === 'ARROWDOWN') {
      event.preventDefault();
      const cols = effectiveCols();
      if (ch && current + cols < ch.total) switchTo(current + cols);
      return;
    }

    if (key === '1' || key === 'Z') {
      event.preventDefault();
      setQuestionStatus('proficient');
      return;
    }

    if (key === '2' || key === 'X') {
      event.preventDefault();
      setQuestionStatus('vague');
      return;
    }

    if (key === '3' || key === 'C') {
      event.preventDefault();
      setQuestionStatus('wrong');
      return;
    }

    if (key === 'P') {
      event.preventDefault();
      toggleAnnotation();
      return;
    }

    if (key === 'R') {
      event.preventDefault();
      toggleQBad();
      return;
    }

    if (key === 'T') {
      event.preventDefault();
      toggleSBad();
      return;
    }

    if (key === 'N') {
      event.preventDefault();
      const textarea = document.getElementById('notesTextarea');
      const renderArea = document.getElementById('notesRender');
      const notesBody = document.getElementById('notesBody');
      if (notesBody) notesBody.style.display = 'block';
      if (textarea) textarea.style.display = 'block';
      if (renderArea) renderArea.style.display = 'none';
      textarea?.focus();
      return;
    }

    if (key === 'H') {
      event.preventDefault();
      const btn = document.getElementById('btnShortcutHelp');
      if (btn) btn.click();
      return;
    }

    if (key === 'ESCAPE') {
      event.preventDefault();
      closeLightbox();
      closeAllTitlePanels();
      if (annoActive) toggleAnnotation(false);
      return;
    }
  });
}

// ===== 单次绑定与初始化 =====
function bindAppUiOnce() {
  if (appUiBound) return;
  appUiBound = true;

  initTheme();
  initAnnotationEngine();
  bindLightboxEvents();
  setupNotesEvents();
  setupFilterEvents();
  setupTitleDropdownEvents();
  setupKeyboardShortcuts();

  document.getElementById('catBtnShu1')?.addEventListener('click', function () {
    switchCategory('shu1').catch(console.error);
  });

  document.getElementById('catBtnZhuanye')?.addEventListener('click', function () {
    switchCategory('zhuanye').catch(console.error);
  });

  document.getElementById('catBtnTheme')?.addEventListener('click', toggleTheme);

  document.getElementById('btnProficient')?.addEventListener('click', function () {
    setQuestionStatus('proficient');
  });

  document.getElementById('btnVague')?.addEventListener('click', function () {
    setQuestionStatus('vague');
  });

  document.getElementById('btnWrong')?.addEventListener('click', function () {
    setQuestionStatus('wrong');
  });

  document.getElementById('btnToggleAnnotation')?.addEventListener('click', function () {
    toggleAnnotation();
  });

  document.getElementById('btnQBad')?.addEventListener('click', toggleQBad);
  document.getElementById('btnSBad')?.addEventListener('click', toggleSBad);

  document.getElementById('btnToggle')?.addEventListener('click', toggleSolutionVisibility);
  document.getElementById('btnSolDefault')?.addEventListener('click', toggleDefaultSolutionStrategy);
}

// ===== Supabase 事件集成 =====
document.addEventListener('private-study:signed-in', async function (event) {
  const user = event.detail?.user;
  if (!user) return;

  try {
    bindAppUiOnce();
    resetAllUserState();
    initializedUserId = user.id;

    const chapterId = currentChapterId || CHAPTERS[0]?.id || 'ch1';
    currentChapterId = chapterId;

    try {
      await restoreChapterState(chapterId);
    } catch (err) {
      console.warn('restoreChapterState fail-safe:', err);
    }

    renderTitle();
    renderStats();
    renderNav();
    switchTo(current);
    updateFilterCounts();
  } catch (error) {
    console.error('初始化当前用户题库失败', error);
  }
});

document.addEventListener('private-study:signed-out', function () {
  resetAllUserState();
});

if (document.readyState === 'loading') {
  document.addEventListener('DOMContentLoaded', bindAppUiOnce, { once: true });
} else {
  bindAppUiOnce();
}
